[
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Carbon is the primary building block of life on Earth.Carbon can form stable, complex molecules with other elements, especially hydrogen, oxygen, and nitrogen.\n\nCarbon-based molecules are the basis for life in all living organisms, including humans. These molecules include nucleic acids, carbohydrates, lipids, cells, and proteins. It is considered the major building block of organisms because of its unique ability to form stable bonds with many different elements, including itself, allowing it to create complex, diverse, and large molecules necessary for life, like proteins, carbohydrates, and nucleic acids, which are the foundation of all living things.",
    "passage": "",
    "question_text": "The major building block of an organism is...",
    "option_1_text": "Nitrogen",
    "option_1_image": "",
    "option_2_text": "Carbon",
    "option_2_image": "",
    "option_3_text": "Water",
    "option_3_image": "",
    "option_4_text": "Sulphur",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The process by which plants lose water to the atmosphere is called transpiration.\n\nTranspiration is the process by which plants release water into the atmosphere as water vapour. It occurs through stomata, which are tiny pores on the surface of leaves that allow plants to exchange gases with the atmosphere. Transpiration also occurs through evaporation from the surfaces of leaves, stems, and flowers. Guttation also involves water loss but there is difference between the two.\n\nTranspiration is the process where plants lose water vapour through tiny pores called stomata on their leaves, while guttation is the release of liquid water droplets from specialized structures called hydathodes, usually located on the edges of leaves, occurring when the plant absorbs water faster than it can transpire, creating a pressure that forces the water out; essentially, transpiration is water loss as vapour, and guttation is water loss as liquid droplets. \n\nTranslocation is the process by which plants move dissolved materials, like sugars and nutrients, throughout the plant. \n\nEvaporation\" in plants refers to the process called transpiration, where water absorbed by the plant roots travels through the plant's vascular system and exits as water vapour through tiny pores on the leaves called stomata.",
    "passage": "",
    "question_text": "The process by which plants loss water to the atmosphere is",
    "option_1_text": "transpiration",
    "option_1_image": "",
    "option_2_text": "guttation",
    "option_2_image": "",
    "option_3_text": "translocation",
    "option_3_image": "",
    "option_4_text": "evaporation",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q3.png",
    "explanation_image": "",
    "explanation_text": "The diagram is that of the virus. Viruses are obligate parasites, meaning they can't produce their own energy or proteins. They enter the host cell and use the cell's machinery to make their own nucleic acids and proteins. Viruses also use the host cell's lipids and sugar chains to create their membranes and glycoproteins. This parasitic replication can severely damage the host cell, which can lead to disease or cell death. They usually enter your body through your mucous membranes. These include your eyes, nose, mouth, penis, vagina and anus.\n\nViruses are a unique type of organism that are not plants, animals, or bacteria. They are often classified in their own kingdom. However, for the sake of the question, since most of their attributes and metabolic activities are more of the bacteria, we'll go with option A - Monera",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe organism belongs to kingdom",
    "option_1_text": "monera",
    "option_1_image": "",
    "option_2_text": "protista",
    "option_2_image": "",
    "option_3_text": "fungi",
    "option_3_image": "",
    "option_4_text": "animalia",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A lysosome functions as the \"garbage disposal unit\" of a cell, primarily responsible for breaking down and recycling waste materials within the cell by digesting old cell parts, extracellular debris, and invading pathogens using digestive enzymes, thus maintaining cellular homeostasis and contributing to important processes like programmed cell death (apoptosis). \n\nThe primary function of a ribosome in a living cell is to synthesize proteins by translating the genetic code carried by messenger RNA (mRNA) into a sequence of amino acids, which then fold to form functional proteins; essentially acting as the site where protein synthesis occurs within the cell. \n\nCentrioles are barrel-shaped organelles in the cytoplasm of animal cells that help organize microtubules and form centrosomes, cilia, and flagella. They are found near the nuclear envelope. Centrioles are essential for the formation of cilia and flagella in living cells. It is a barrel-shaped organelles made of microtubules that play a central role in the formation of cilia, flagella, and centrosomes.\n\nPlastids, organelles found primarily in plant cells, are responsible for the synthesis and storage of important molecules like food, pigments, and other metabolites, with their primary function being photosynthesis, using sunlight to convert carbon dioxide into energy-rich compounds like glucose; they also play a role in the plant's color due to the pigments they store\n\n",
    "passage": "",
    "question_text": "The formation of cilia and flagella in living cells is carried out with the help of",
    "option_1_text": "ribosome",
    "option_1_image": "",
    "option_2_text": "lysosome",
    "option_2_image": "",
    "option_3_text": "centriole",
    "option_3_image": "",
    "option_4_text": "plastid",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Fat is the food nutrient with the highest energy value, providing 9 calories per gram, while carbohydrates and proteins provide 4 calories per gram. \n\nFat is the body's most concentrated source of energy, providing more than twice as much potential energy as carbohydrates or proteins.However, carbohydrates burn fastest in metabolism. Fats are a type of lipid. Lipids are a group of organic compounds that are insoluble in water but soluble in organic solvents. Fats are solid at room temperature, while oils are liquid at room temperature. \n\nTherefore, the correct answer is option C.",
    "passage": "",
    "question_text": "The food nutrient with the highest energy value is",
    "option_1_text": "protein",
    "option_1_image": "",
    "option_2_text": "carbohydrate",
    "option_2_image": "",
    "option_3_text": "lipid",
    "option_3_image": "",
    "option_4_text": "minerals",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q6.png",
    "explanation_image": "",
    "explanation_text": "\nThe chemical reaction represents photosynthesis, a process through which green plants manufacture their food in the presence of sunlight, making use of Carbon(IV) oxide and Water.\n\n",
    "passage": "",
    "question_text": "Use the diagram above to answer question that follows\nThe part labelled I is",
    "option_1_text": "enzyme",
    "option_1_image": "",
    "option_2_text": "water",
    "option_2_image": "",
    "option_3_text": "sunlight",
    "option_3_image": "",
    "option_4_text": "chemical",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Nematodes are bilaterally symmetrical. Bilaterally symmetrical means that an organism can be divided lengthwise into two identical halves that are mirror images of each other. Nematodes have two openings: a mouth and an anus. This is because they have a complete digestive system, also known as an alimentary canal. \n\nHere are some other characteristics of nematodes:\n\nBilateral symmetry: Nematodes have identical right and left halves. \nCylindrical shape: Nematodes have a cylindrical body shape. \nSexually dimorphic: Most species of nematodes have both males and females. \nNo circulatory system: Nematodes don't have a circulatory system, so they transfer nutrients and oxygen to their cells through diffusion. Hydra is not bilaterally symmetrical; it exhibits radial symmetry, meaning its body can be divided into equal halves along any plane through its central axis. Protozoans are single-celled organisms that lack a true mouth and anus, instead they have a single opening that serves both the entrance and exit point for nutrients, wastes and other materials. E.g Amoeba, paramecium etc. Protists also have a single opening, though certain types of algae or protozoans with complex cell structures might have multiple openings for feeding, reproduction etc(dinoflagellates, ciliates like paramecium), but generally, protists don't have double openings in the classical sense.\n",
    "passage": "",
    "question_text": "Bilateral symmetry,cylindrical bodies and double openings are characteristic features of",
    "option_1_text": "nematodes",
    "option_1_image": "",
    "option_2_text": "hydra",
    "option_2_image": "",
    "option_3_text": "protozoa",
    "option_3_image": "",
    "option_4_text": "protists",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The housefly has a sponging and sucking type of mouthpart, meaning it absorbs liquid food by essentially \"lapping\" it up with its spongy labellum, not piercing to suck like a mosquito does. \n\nGrasshopper has a biting and chewing type of mouthpart, which is used to process solid foods like grass and leaves. \n\nPiercing and sucking mouth parts are found in insects such as mosquitoes, lice, fleas, bedbugs, and stinkbugs.These insects have mouth parts that are adapted for piercing the skin of animals and plants to suck up blood and plant juice. \n\nMajor insect groups that have chewing mouthparts include the cockroaches and grasshoppers, most wasps, beetles, termites and caterpillars. Insects with piercing-sucking mouthparts include some flies (think mosquitoes), fleas, true bugs and their relatives.\n\n ",
    "passage": "",
    "question_text": "Mouth part adapted for piercing and sucking is found in",
    "option_1_text": "housefly",
    "option_1_image": "",
    "option_2_text": "grasshopper",
    "option_2_image": "",
    "option_3_text": "mosquito",
    "option_3_image": "",
    "option_4_text": "cockroach",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The webbed feet of frogs and toads help them swim and move through water.The thin layer of skin that connects the toes of frogs and toads increases the surface area of their feet, allowing them to push against the water more effectively. This helps them move quickly through the water to chase food or escape predators. ",
    "passage": "",
    "question_text": "The web-feet of frogs and toads is basically for",
    "option_1_text": "leaping",
    "option_1_image": "",
    "option_2_text": "walking",
    "option_2_image": "",
    "option_3_text": "swimming",
    "option_3_image": "",
    "option_4_text": "mating",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The sacculus is a sensory organ located in the inner ear that primarily functions to detect vertical linear acceleration, meaning it senses movement in the up and down direction, like when you're in an elevator, and helps maintain balance by providing information about your head's position relative to gravity; essentially, it tells your brain if your head is tilting forward or backward. \n\nThe cochlea is the part of the inner ear that is responsible for hearing.\n\nThe cochlea is a snail-shaped organ filled with fluid that contains the organ of Corti, which is made up of tiny hair cells that line the cochlea. When sound enters the ear, it causes the fluid in the cochlea to vibrate, which makes the hair cells vibrate and send electrical impulses to the brain. The brain perceives these electrical signals as sound. \n\nThe utriculus, located in the inner ear, functions as a sensory organ that detects linear acceleration and head position in the horizontal plane, essentially sensing side-to-side tilting movements of the head, contributing to our sense of balance by providing information about static equilibrium.The inner ear also contains the semicircular canals, which are responsible for balance. The semicircular canals are filled with fluid and have calcium crystals embedded in their lining.\n\nThe function of the ampullae in the ear is to detect head rotation by sensing the movement of fluid within the semicircular canals, sending signals to the brain regarding angular acceleration and deceleration of the head, essentially contributing to balance perception.",
    "passage": "",
    "question_text": "The part of the inner ear that is responsible for hearing is",
    "option_1_text": "sacculus",
    "option_1_image": "",
    "option_2_text": "cochlea",
    "option_2_image": "",
    "option_3_text": "utriculus",
    "option_3_image": "",
    "option_4_text": "ampullae",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Human evolution is the process by which humans evolved from ape-like ancestors over millions of years. This process resulted in the development of physical and behavioral traits that all humans share today. \n\nOrganic evolution is the theory that all living organisms have evolved from pre-existing species, and that the differences between organisms are due to changes in their genetic makeup over generations. Organic evolution, also known as biological evolution, is the gradual process by which living organisms change over time. It's the theory that all species are descended from common ancestors, and that the differences between them are due to changes in their genetic makeup over generations. \n\nPhysical evolution\" refers to the process by which the physical characteristics of an organism change over generations, primarily due to changes in its genetic makeup, resulting in adaptations to its environment, often manifested in alterations to body shape, size, and function of different body parts; essentially, it's the observable physical manifestation of biological evolution at the organism level. ",
    "passage": "",
    "question_text": "The changes of living organisms over generation is referred to as",
    "option_1_text": "human evolution",
    "option_1_image": "",
    "option_2_text": "organic evolution",
    "option_2_image": "",
    "option_3_text": "physical evolution",
    "option_3_image": "",
    "option_4_text": "chemical evolution",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "By crossing  Rr  x  rr\n\nWe obtain  Rr , rr , rr , Rr\n\nâ‡’ 50% = 1/2",
    "passage": "",
    "question_text": "In a cross involving a heterozygous red flower plant (Rr) and a white flowered plant (rr). What is the probability that the offspring will be Rr?",
    "option_1_text": "1/2",
    "option_1_image": "",
    "option_2_text": "1",
    "option_2_image": "",
    "option_3_text": "2",
    "option_3_image": "",
    "option_4_text": "4566100.00%",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Inbreeding is the mating of organisms that are more closely related than would normally occur in nature. This can include mating between siblings, parents and children, or first cousins. Studies have confirmed an increase in several genetic disorders due to inbreeding such as blindness, hearing loss, neonatal diabetes, limb malformations, disorders of sex development, schizophrenia and several others. In adults, inbreeding can lead to deafness, visual impairment, and mental deficiency.",
    "passage": "",
    "question_text": "Inbreeding is highly discouraged in humans because it may",
    "option_1_text": "increase the death rate of new born",
    "option_1_image": "",
    "option_2_text": "lead to the birth of dwarfs",
    "option_2_image": "",
    "option_3_text": "lead to high rate of competition among offspring",
    "option_3_image": "",
    "option_4_text": "lead to outbreak of hereditary diseases",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A savanna is a hot, dry ecosystem with a mix of grasslands and woodland.Trees in savannas often have thick bark to protect them from fire damage. Savannas are usually found near the equator, where there is more direct sunlight and warm temperatures all year.Some common trees found in savannas include acacia, combretum, baobabs, borassus, and euphorbia.",
    "passage": "",
    "question_text": "One main feature of trees in the savanna habitat is the possession of",
    "option_1_text": "large, leathery leaves",
    "option_1_image": "",
    "option_2_text": "straight slender stems with branches near the top",
    "option_2_image": "",
    "option_3_text": "thin, smooth barks",
    "option_3_image": "",
    "option_4_text": "thick, corky bark",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q15.png",
    "explanation_image": "",
    "explanation_text": "The supra-tidal zone, also known as the splash zone or spray zone, is the area of a coastline or estuary that is above the spring high tide line and is regularly splashed by ocean water but never submerged. The supra-tidal zone is only flooded during storms or spring tides. \n\nThe pelagic zone is the open water column of an ocean or lake that is not close to the shore or the bottom.\n\nThe littoral zone is the area where the land meets the water in a lake, river, or sea, and is also known as the nearshore or littoral. It's a shallow, sloped area that stretches from the high-water mark to the shore, and into the water where sunlight reaches the bottom.\n\nThe benthic zone is the lowest ecological region of a body of water, such as a lake, ocean, or stream. It includes the sediment surface and some sub-surface layers.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe zone labelled II is called",
    "option_1_text": "supra-tidal zone",
    "option_1_image": "",
    "option_2_text": "pelagic zone",
    "option_2_image": "",
    "option_3_text": "littoral zone",
    "option_3_image": "",
    "option_4_text": "benthic zone",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Insects have a tracheal respiratory system in which oxygen and carbon dioxide travel primarily through air-filled tubes called tracheae.\n\nMalpighian tubules (MTs) are the primary excretory organs in most insects, and they have a number of uses, including excretion.They are responsible for producing primary urine and removing toxic compounds and excretion products.\n\nFlame cells are not used in insects, but they are used in other invertebrates, such as flatworms, rotifers, and nemerteans.",
    "passage": "",
    "question_text": "Which of the following structures enables the exchange of gases in insects?",
    "option_1_text": "skin",
    "option_1_image": "",
    "option_2_text": "tracheae",
    "option_2_image": "",
    "option_3_text": "Malpighian tubules",
    "option_3_image": "",
    "option_4_text": "flame cell",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Glycolysis is the process in which glucose is broken down to produce energy. It produces two molecules of pyruvate, ATP, NADH and water. Glycolysis is a two-phase process that begins in the cytoplasm of a cell. The first phase, called the investment phase, requires two ATP molecules to add phosphates to glucose. The net gain is two ATP molecules. The total number of ATP produced during glycolysis is two",
    "passage": "",
    "question_text": "The total number of ATP produced during glycolysis is",
    "option_1_text": "3 molecules",
    "option_1_image": "",
    "option_2_text": "2 molecules",
    "option_2_image": "",
    "option_3_text": "4 molecules",
    "option_3_image": "",
    "option_4_text": "6 molecules",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q18.png",
    "explanation_image": "q18_e.png",
    "explanation_text": "The circulatory system is a network of blood vessels, the heart, and blood that moves throughout the body. The circulatory system's main function is to transport nutrients, oxygen, and hormones to the body's cells, and remove waste products. \n\nThe reproductive system is a collection of organs in both males and females that work together to produce offspring, primarily consisting of the gonads (ovaries in females, testes in males) which create sex cells (eggs and sperm), and accessory organs that transport and nurture these cells to facilitate fertilization and potential pregnancy.\n\nThe nervous system is a complex network of nerves and nerve cells (neurons) that control bodily functions by sending signals between the brain and the rest of the body, allowing us to move, think, feel, and regulate internal processes; it consists of two main parts: the central nervous system (brain and spinal cord) and the peripheral nervous system\n\nThe urinary system helps the body maintain balance by removing waste products like urea, extra salt, and extra water. Urea is a waste product created when the body breaks down protein from foods like meat, poultry, and some vegetables. Its function is to remove waste from the body through urine bladder, urethra, kidneys and ureters.\n\nParts of the urinary system \n\nKidneys: Two bean-shaped organs located in the middle back, under the ribs. They filter blood to remove waste and extra water.\nUreters: Two tubes that carry urine from the kidneys to the bladder.\nBladder: A hollow organ in the pelvis that stores urine. When the bladder is full, it signals the body to urinate.\nUrethra: A small tube that carries urine from the bladder out of the body.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows",
    "option_1_text": "circulatory system",
    "option_1_image": "",
    "option_2_text": "reproductive system",
    "option_2_image": "",
    "option_3_text": "urinary system",
    "option_3_image": "",
    "option_4_text": "nervous system",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The gallbladder stores bile, a greenish-yellow digestive fluid that helps break down fats in food: \n\nThe gallbladder is a small, pear-shaped organ located beneath the liver. Bile is produced in the liver and travels through ducts to the gallbladder, where it's concentrated and stored. When food is eaten, the gallbladder contracts and releases bile into the duodenum to aid digestion. ",
    "passage": "",
    "question_text": "Bile is a greenish alkaline liquid which is stored in the",
    "option_1_text": "gall bladder",
    "option_1_image": "",
    "option_2_text": "liver",
    "option_2_image": "",
    "option_3_text": "stomach",
    "option_3_image": "",
    "option_4_text": "pancreas",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Loamy Soil is the mixture of clay, sand and silt soil which consists of additional organic matter and is very fertile compared to other types of soil. It is a mixture of sand, silt, and clay, loamy soil is characterized by a significant amount of organic matter, which is decomposed plant and animal material. Loamy soil is fertile and well-suited for cultivation because it provides plants with the nutrients and water they need to grow.\n\nHumus on the other hand is a well-broken down soil organic matter, humus has a high cation exchange capacity (CEC). Soils with low CEC are more likely to acidify quickly and develop deficiencies in potassium, magnesium, and other cations.",
    "passage": "",
    "question_text": "A medium texture soil with high organic matter is",
    "option_1_text": "clay",
    "option_1_image": "",
    "option_2_text": "loamy",
    "option_2_image": "",
    "option_3_text": "humus",
    "option_3_image": "",
    "option_4_text": "sandy",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Discontinuous variation is when individuals fall into distinct categories or classes, and there are no values in between. Blood group is an example of discontinuous variation. In the ABO blood group system, there are only four possible blood groups: A, B, AB, or O. You can't have a blood group in between these four groups.",
    "passage": "",
    "question_text": "One of the following is an example of discontinuous variation",
    "option_1_text": "shape of the head",
    "option_1_image": "",
    "option_2_text": "blood group",
    "option_2_image": "",
    "option_3_text": "body complexion",
    "option_3_image": "",
    "option_4_text": "pointed nose",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Continuous variation is a type of variation where there are no clear differences between two extreme individuals, and instead there is a gradual change from one extreme to another.\n\nMorphological variations are changes in the physical appearance of individuals of the same species. e.g height, weight, eye colour etc\n\nPhysiological variation refers to the differences in physiological function between individuals of the same species. e.g taste, rolling of the tongues, blood type etc",
    "passage": "",
    "question_text": "The type of variation where there are no remarkable differences between the two extreme individuals is called",
    "option_1_text": "continuous variation",
    "option_1_image": "",
    "option_2_text": "morphological variation",
    "option_2_image": "",
    "option_3_text": "physiological variation",
    "option_3_image": "",
    "option_4_text": "discontinuous variation",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cockroaches can transmit diseases through food contamination, which is an economic concern.",
    "passage": "",
    "question_text": "The transmission of diseases through contamination of food is an economic importance of",
    "option_1_text": "mosquitoes",
    "option_1_image": "",
    "option_2_text": "cockroaches",
    "option_2_image": "",
    "option_3_text": "butterflies",
    "option_3_image": "",
    "option_4_text": "bees",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Bryophytes are sometimes referred to as an intermediate group between algae and vascular plants(Pteridophytes). \n\nBryophytes: A small group of land plants that includes liverworts, hornworts, and mosses. They are considered the most primitive group of Embryophyta, and are thought to be the first land plants. They lack vascular tissues and seeds, but produce embryos while the algae is a a group of organisms with cell walls made of cellulose, similar to bryophytes. However, algae do not divide their plant body internally into photosynthetic and storage zones, unlike bryophytes. Bryophytes produce embryos but lack seeds and vascular tissues. They are the most simple and primitive group of Embryophyta.",
    "passage": "",
    "question_text": "Bryophyte is an intermediate group between higher algae and",
    "option_1_text": "thallophyte",
    "option_1_image": "",
    "option_2_text": "pteridophyte",
    "option_2_image": "",
    "option_3_text": "spermatophyte",
    "option_3_image": "",
    "option_4_text": "tracheophyte",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Ecological succession is a gradual process that occurs when an ecosystem changes in species composition and community structure over time after a disturbance.",
    "passage": "",
    "question_text": "Ecological succession can result from",
    "option_1_text": "newly formed habitat",
    "option_1_image": "",
    "option_2_text": "habitat with abundant food",
    "option_2_image": "",
    "option_3_text": "habitat with space and light",
    "option_3_image": "",
    "option_4_text": "population of plants on a fertile land",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "population of plants on a fertile land",
    "option_1_text": "terrestrial",
    "option_1_image": "",
    "option_2_text": "arboreal",
    "option_2_image": "",
    "option_3_text": "aquatic",
    "option_3_image": "",
    "option_4_text": "desert",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "All seeds need water, oxygen, and proper temperature in order to germinate. Experiment has shown that germinating seeds produce heat. \n\nThe correct answer is B - Heat and water.\n\nFor a seed to germinate in a laboratory setup, two essential factors are required:\n\n1. Water: Seeds need water to rehydrate and initiate metabolic processes.\n\n2. Heat (or optimal temperature): Seeds require a specific temperature range to break dormancy and germinate.\n\nThe other options are not essential for seed germination:\n\nA. Microbes: While microbes can influence seed germination, they are not a required factor.\n\nC. Soil and manure: Seeds can germinate in a laboratory setup without soil and manure.\n\nD. Heat and microbe: Microbes are not a necessary factor for seed germination.",
    "passage": "",
    "question_text": "Which of these pair of substances must be present for a seed to germinate in a laboratory set-up?",
    "option_1_text": "microbes and water",
    "option_1_image": "",
    "option_2_text": "heat and water",
    "option_2_image": "",
    "option_3_text": "soil and manure",
    "option_3_image": "",
    "option_4_text": "heat and microbe",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A simple fruit is a fruit that develops from a single flower with one ovary or multiple fused carpels. The ovary wall ripens into a single fruit, separate from other ovaries.E.g Apples, Oranges, peaches, Lemon, melon etc\n\nA multiple fruit is a type of fruit that develops from the ovaries of many flowers growing in a cluster or that are fused together into a larger fruit. E.g Pineapple\n\nA fruit that develops from a single flower with multiple carpels is called an aggregate fruit. Examples include Raspberry, strawberry, and Blackberry.\n\nA false fruit is a fruit that develops from parts of a flower other than the ovary. False fruits are also known as pseudo fruits or accessory fruits.E.g Pear, Cashew",
    "passage": "",
    "question_text": "A fruit formed from one flower with many carpels is referred to as",
    "option_1_text": "simple",
    "option_1_image": "",
    "option_2_text": "multiple",
    "option_2_image": "",
    "option_3_text": "aggregate",
    "option_3_image": "",
    "option_4_text": "FALSE",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Liverworts are found in the ground layer of a tropical rainforest, along with other plants like ferns, wildflowers, moss, and sedges. Liverworts are non-vascular plants, meaning they don't have roots or vascular tissue, and instead absorb nutrients and water from the air through their leaves.",
    "passage": "",
    "question_text": "Which of the following plant is found in the ground layer of a tropical rainforest in Nigeria?",
    "option_1_text": "obeche",
    "option_1_image": "",
    "option_2_text": "liverwort",
    "option_2_image": "",
    "option_3_text": "mahogany",
    "option_3_image": "",
    "option_4_text": "oil palm",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q30.png",
    "explanation_image": "q30_e.png",
    "explanation_text": "The pituitary gland is located at the base of the brain, in the sella turcica, an indent in the sphenoid bone. It's directly below the hypothalamus, and behind the bridge of the nose. ",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\nThe endocrine gland that is located in the part labelled I is",
    "option_1_text": "thyroid",
    "option_1_image": "",
    "option_2_text": "adrenal",
    "option_2_image": "",
    "option_3_text": "parathyroid",
    "option_3_image": "",
    "option_4_text": "pituitary",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Combustion is a process that takes place in the carbon cycle, while transpiration is not.\n\nCombustion is the process of burning organic materials, such as fossil fuels, wood, paper, plastics, and cloth, in the presence of oxygen. This releases carbon dioxide and water vapor into the atmosphere.\n\nNitrification is a biological process that converts ammonia (NH3)into nitrite (NO2) and then nitrate (NO3).",
    "passage": "",
    "question_text": "Which of the following processes takes place in the carbon cycle?",
    "option_1_text": "evaporation",
    "option_1_image": "",
    "option_2_text": "nitrification",
    "option_2_image": "",
    "option_3_text": "combustion",
    "option_3_image": "",
    "option_4_text": "transpiration",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Combustion is a process that takes place in the carbon cycle, while transpiration is not.\n\nCombustion is the process of burning organic materials, such as fossil fuels, wood, paper, plastics, and cloth, in the presence of oxygen. This releases carbon dioxide and water vapor into the atmosphere.\n\nNitrification is a biological process that converts ammonia (NH3)into nitrite (NO2) and then nitrate (NO3).",
    "passage": "",
    "question_text": "Which of the following plants shows hypogeal germination?",
    "option_1_text": "castor oi",
    "option_1_image": "",
    "option_2_text": "groundnut",
    "option_2_image": "",
    "option_3_text": "maize",
    "option_3_image": "",
    "option_4_text": "orange",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In vascular plants, xylem tissue is responsible for transporting water and dissolved minerals from the roots to the leaves. Xylem is a vascular tissue, along with phloem, which is the other main transport system in plants.",
    "passage": "",
    "question_text": "In vascular plants, xylem tissue is responsible for",
    "option_1_text": "transportation of water",
    "option_1_image": "",
    "option_2_text": "translocation of food",
    "option_2_image": "",
    "option_3_text": "transportation of hormones",
    "option_3_image": "",
    "option_4_text": "storage of sugar",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The causative agent of tuberculosis (TB) is the bacterium Mycobacterium tuberculosis. TB is a contagious disease that spreads through the air when people with active TB in their lungs cough, sneeze, or spit. ",
    "passage": "",
    "question_text": "The causative agent of tuberculosis is",
    "option_1_text": "virus",
    "option_1_image": "",
    "option_2_text": "bacteria",
    "option_2_image": "",
    "option_3_text": "protozoa",
    "option_3_image": "",
    "option_4_text": "fungi",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The lungs are the respiratory organ in mammals.They are the primary respiratory organs in mammals. They are located in the thorax, on either side of the mediastinum. The lungs take in oxygen from the air and release carbon dioxide, which oxygenates the blood.",
    "passage": "",
    "question_text": "Which of these is a respiratory organ in mammals?",
    "option_1_text": "skin",
    "option_1_image": "",
    "option_2_text": "mouth",
    "option_2_image": "",
    "option_3_text": "heart",
    "option_3_image": "",
    "option_4_text": "lungs",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q36_e.png",
    "explanation_text": "The Guinea savanna is a vegetation zone in Nigeria that covers more than half of the country's land area. It's characterized by short trees and tall grasses. Kwara State is located in the Northern Guinea savanna, at the southern border of the Niger River. ",
    "passage": "",
    "question_text": "Which of the Nigeria states is Northern guinea savanna located?",
    "option_1_text": "Borno",
    "option_1_image": "",
    "option_2_text": "Kano",
    "option_2_image": "",
    "option_3_text": "Oyo",
    "option_3_image": "",
    "option_4_text": "Kwara",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Jean-Baptiste Lamarck proposed the theory of use and disuse of organs, also known as Lamarckism\n\nDarwin's theory of evolution, also known as Darwinism, explains how species evolve over time through natural selection.\n\nJean-Baptiste Lamarck repeated the ancient folk wisdom of the inheritance of acquired characteristics.\n\nDe Vries held that new species arrive suddenly and without prior precedent through the process of mutation. The mutation Theory of Evolution was proposed by Hugo de Vries.",
    "passage": "",
    "question_text": "Darwin's theory of evolution is based on the principle of",
    "option_1_text": "use and disuse of organ",
    "option_1_image": "",
    "option_2_text": "natural selection",
    "option_2_image": "",
    "option_3_text": "acquired characteristics",
    "option_3_image": "",
    "option_4_text": "mutation",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Similar structures that are modified to work in different ways in different organisms are called homologous structures.\n\nHomologous structures are physical features that are similar in organisms that share a common ancestor, but have different functions. For example, the limbs of humans, cats, whales, and bats are homologous structures.",
    "passage": "",
    "question_text": "Similar structures that are modified to work in different ways in different organisms are referred to as",
    "option_1_text": "homologous structures",
    "option_1_image": "",
    "option_2_text": "analogous structures",
    "option_2_image": "",
    "option_3_text": "divergent structures",
    "option_3_image": "",
    "option_4_text": "convergent structures",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Schistosomiasis, also known as bilharzia or snail fever, is a parasitic disease caused by blood flukes that live in freshwater snails. The larval form of the parasite, called cercariae, emerges from the snail and contaminates water. People become infected when their skin comes into contact with the contaminated water. Treating water sources with chemicals to kill snails (molluscicides) can reduce the number of infective larvae.This will help control the snails.",
    "passage": "",
    "question_text": "One of the ways of controlling Schistosomiasis is by",
    "option_1_text": "destroying water snails and water weeds",
    "option_1_image": "",
    "option_2_text": "clearing the bushes around the house",
    "option_2_image": "",
    "option_3_text": "washing hands after using the toilet",
    "option_3_image": "",
    "option_4_text": "properly washing fruits before eating them",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The central nervous system (CNS) is made up of the brain and spinal cord:\n\nBrain: Controls how we think, feel, move, and learn.\nSpinal cord: Carries messages between the brain and the nerves that run throughout the body. ",
    "passage": "",
    "question_text": "The central nervous system comprises of",
    "option_1_text": "brain and somatic",
    "option_1_image": "",
    "option_2_text": "brain and spinal cord",
    "option_2_image": "",
    "option_3_text": "spinal cord and somatic",
    "option_3_image": "",
    "option_4_text": "brain only",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q41.png",
    "explanation_image": "",
    "explanation_text": "I - Paramylum granules\n\nII - Contractile vacuole\n\nIII- Chloroplasts\n\nIV- Nucleus\n\nThe chloroplasts is the plant-like feature of euglena, which enables it to carryout photosynthesis.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe organelle that shows the organism has plant characteristics is",
    "option_1_text": "I",
    "option_1_image": "",
    "option_2_text": "II",
    "option_2_image": "",
    "option_3_text": "III",
    "option_3_image": "",
    "option_4_text": "IV",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The type of reproduction in Paramecium is asexual binary fission in which a fully grown organism divides into two daughter cells. Paramecium also exhibits several types of sexual processes",
    "passage": "",
    "question_text": "Reproduction in paramecium is by",
    "option_1_text": "binary fission",
    "option_1_image": "",
    "option_2_text": "budding",
    "option_2_image": "",
    "option_3_text": "spore formation",
    "option_3_image": "",
    "option_4_text": "fragmentation",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The formula for population density is Dp = N/A\n\n, where:   Dp = The population density\n\n                  N = The total number of individuals in the population\n\n                  A = The area, which can be measured in any land area unit, such as acres, meters, centimeters, or miles\n\nGiven: N = 2,310,000people ,  A = 2,310 km2\n\n          Dp = N/A\n = Dp = 2,310,000/2,310\n\n                                         = 1,000",
    "passage": "",
    "question_text": "A community with a population of two million three hundred and ten thousand people living in an area of two thousand three hundred and ten square kilometres has a population density of",
    "option_1_text": "10000",
    "option_1_image": "",
    "option_2_text": "10",
    "option_2_image": "",
    "option_3_text": "100",
    "option_3_image": "",
    "option_4_text": "100000.00%",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Primary succession is the ecological succession that occurs in an area where there is no pre-existing community. Primary succession is the process of colonization that begins when an area has no plant life, such as after a volcanic eruption or glacial retreat.",
    "passage": "",
    "question_text": "A succession that occurs in an area where there are no pre-existing community is called",
    "option_1_text": "tertiary succession",
    "option_1_image": "",
    "option_2_text": "primary succession",
    "option_2_image": "",
    "option_3_text": "post-primary succession",
    "option_3_image": "",
    "option_4_text": "secondary succession",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Photosynthesis is the process that releases oxygen into the atmosphere.\n\nPhotosynthesis is a process that uses light energy from the sun to convert water and carbon dioxide into oxygen and organic compounds. This process is performed by green plants and certain other organisms, including phytoplankton in the oceans. ",
    "passage": "",
    "question_text": "Which of the following processes releases oxygen to the atmosphere?",
    "option_1_text": "Respiration",
    "option_1_image": "",
    "option_2_text": "Combustion",
    "option_2_image": "",
    "option_3_text": "Decomposition",
    "option_3_image": "",
    "option_4_text": "photosynthesis",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q46_e.png",
    "explanation_text": "The depressed side of a paramecium that is lined with cilia leads to a tube-like structure called the buccal cavity, also known as the gullet.\n\n",
    "passage": "",
    "question_text": "The depressed side of paramecium which is lined with cilia leads to a tube-like structure called",
    "option_1_text": "anal pore",
    "option_1_image": "",
    "option_2_text": "oral groove",
    "option_2_image": "",
    "option_3_text": "gullet",
    "option_3_image": "",
    "option_4_text": "food vacuole",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q47_e.png",
    "explanation_text": "The rhizoids of liverworts are unicellular and unbranched. Rhizoids are root-like structures that anchor liverworts to the ground. \n\nIn contrast, mosses have multicellular rhizoids. In vascular plants, rhizoids are often called root hairs and can be unicellular or multicellular. ",
    "passage": "",
    "question_text": "The rhizoid of liverwort is",
    "option_1_text": "unicellular and unbranched",
    "option_1_image": "",
    "option_2_text": "multicellular and branched",
    "option_2_image": "",
    "option_3_text": "unicellular and branched",
    "option_3_image": "",
    "option_4_text": "multicellular and unbranched",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Glycolysis is the first step in cellular respiration and occurs in the cytoplasm of cells. It's a series of ten enzymatic reactions that break down glucose into pyruvic acid. In glycolysis, glucose is broken down through a series of enzyme-catalyzed reactions to produce pyruvate, ATP, and NADH\n\n",
    "passage": "",
    "question_text": "In glycolysis, glucose is broken down through series of reactions in the presence of enzyme and absence of oxygen to produce",
    "option_1_text": "Acetyl-coenzyme + ATP",
    "option_1_image": "",
    "option_2_text": "Phosphorylated glucose",
    "option_2_image": "",
    "option_3_text": "pyruvic acid + ATP",
    "option_3_image": "",
    "option_4_text": "Amino acid",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In unicellular organisms such as amoeba and paramecium exchange of gases takes place through plasma membrane(also known as the cell membrane, the plasma membrane is found in all cells and separates the cell's interior from the outside environment) by simple diffusion. In earthworm, leech and frogs exchange of gases takes place through their moist skin.\n\nFlatworms are small, simple organisms that lack specialized circulatory and respiratory systems. Their flat shape and moist cells allow for quick diffusion of gases across their outer membrane(the outer membrane is made up of phospholipids, proteins). This process is called direct diffusion.\n\nGaseous exchange in earthworms takes place through their moist skin and capillaries, not through the plasma membrane.  Earthworms don't have respiratory organs, so they exchange gases through their skin in a process called cutaneous respiration. The skin is covered with a thin layer of mucus that keeps the body moist and creates an environment for gas exchange.",
    "passage": "",
    "question_text": "Gaseous exchange takes place through the plasma membrane in",
    "option_1_text": "hydra",
    "option_1_image": "",
    "option_2_text": "paramecium",
    "option_2_image": "",
    "option_3_text": "flatworm",
    "option_3_image": "",
    "option_4_text": "earthworm",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Secondary succession is a natural ecological process that occurs when an area is disrupted, but some plants and animals still survive. A characteristic of secondary succession is that it starts on an already colonized surface. It may start with fairly complex organisms and it takes a shorter time or duration to reach a climax community.",
    "passage": "",
    "question_text": "One of the characteristics of secondary succession is that it",
    "option_1_text": "starts on a bare surface",
    "option_1_image": "",
    "option_2_text": "takes longer time to reach climax",
    "option_2_image": "",
    "option_3_text": "starts on already colonized surface",
    "option_3_image": "",
    "option_4_text": "starts with low organism",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q51_e.png",
    "explanation_text": "One of the components of xylem tissue is tracheids. Tracheids are Long, tube-like cells with lignified walls and tapering ends that overlap with adjacent cells. Tracheids are dead and non-protoplasmic. \n\nCompanion cells are living cells in plants that are associated with sieve tube members in the phloem. They are responsible for loading and unloading sugars, and transporting macromolecules and signaling molecules.They are not found in Xylem tissue but exclusively in phloem. Also, sieve tubes are found in phloem while Xylem and phloem is a vascular tissue and an example of complex tissues, and not epidermal tissue.\n\n",
    "passage": "",
    "question_text": "One of the components of xylem tissue is",
    "option_1_text": "companion cell",
    "option_1_image": "",
    "option_2_text": "tracheid",
    "option_2_image": "",
    "option_3_text": "sieve tube",
    "option_3_image": "",
    "option_4_text": "epidermal",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Natural selection is also known as \"survival of the fittest\".The theory explains how populations adapt and evolve through the process of organisms with better adaptations surviving and reproducing more successfully. It explains how populations change over time. Organisms with traits that are better suited to their environment are more likely to survive and reproduce, passing on those traits to their offspring. \n\nThe statement that \"organisms that are more adapted to their environment are more likely to survive and pass on their genes\" better explains the theory of natural selection. ",
    "passage": "",
    "question_text": "Which of the following statements explains the theory of natural selection?",
    "option_1_text": "There is no struggle for existence",
    "option_1_image": "",
    "option_2_text": "New species get better adaptation",
    "option_2_image": "",
    "option_3_text": "The weaker offspring are eliminated",
    "option_3_image": "",
    "option_4_text": "Unused structures disappear later",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Climatic factors are environmental conditions that affect the climate of a region, such as temperature, precipitation, and solar radiation.\n\nTopographic factors are the features of the Earth's surface, such as its elevation, slope, and curvature.\n\nThe chemical and physical composition of soil is an example of an edaphic factor. Edaphic factors are abiotic factors that relate to the chemical or physical composition of soil in a specific area. E.g texture, porosity, bulk density etc\n\nChemical factors of soil include the concentrations of chemicals in the soil, the pH level, and the soil's cation exchange capacity.",
    "passage": "",
    "question_text": "The chemical and physical composition of soil is an example of",
    "option_1_text": "climatic factor",
    "option_1_image": "",
    "option_2_text": "topographic factor",
    "option_2_image": "",
    "option_3_text": "Edaphic factor",
    "option_3_image": "",
    "option_4_text": "chemical factor",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Abiotic factors are non-living, physical, and chemical elements that influence ecosystems and the communities of organisms within them. E.g temperature, water, soil,sunlight, rainfall etc",
    "passage": "",
    "question_text": "The abiotic factor that affect the population growth of an organism is",
    "option_1_text": "predator",
    "option_1_image": "",
    "option_2_text": "rain fall",
    "option_2_image": "",
    "option_3_text": "food shortage",
    "option_3_image": "",
    "option_4_text": "disease",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The cells that transmit messages to effectors are motor neurons, also known as efferent neurons. They Transmit impulses from the central nervous system (CNS) to effectors, such as muscles and glands. Motor neurons typically have long axons and short dendrites. while the sensory neutrons transmit impulses from sense organs to the CNS. When a stimulus is detected, the information is converted to an electrical signal and sent through a sensory neuron.\n\nHair cells are sensory cells that convert mechanical force into electrical signals. They are found in the inner ear and are responsible for hearing and balance. \n\nRelay neurons are neurons in the central nervous system (CNS) that connect sensory neurons to motor neurons. They are found in the brain and spinal cord. ",
    "passage": "",
    "question_text": "The cells responsible for transmitting messages to the effectors are",
    "option_1_text": "motor neurons",
    "option_1_image": "",
    "option_2_text": "sensory neurons",
    "option_2_image": "",
    "option_3_text": "hair cells",
    "option_3_image": "",
    "option_4_text": "relay neurons",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "\nOxygen transported to all parts of the body during blood circulation is used to release energy from food. When the red blood cells reach tissues that need oxygen, the oxygen is released from the haemoglobin and diffuses into the cells where it is used to make energy. All the systems in our body rely on oxygen to make energy.",
    "passage": "",
    "question_text": "The oxygen transported to all parts of the body during blood circulation is used for the",
    "option_1_text": "growth and development of cells",
    "option_1_image": "",
    "option_2_text": "removal of waste products",
    "option_2_image": "",
    "option_3_text": "release of energy from food",
    "option_3_image": "",
    "option_4_text": "formation of carboxyl haemoglobin",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "After fertilization in plants, the zygote develops into an embryo, which is contained in the seed. \n\nAfter fertilization in plants, the zygote develops into an embryo, not a seed: \n\nFertilization: A sperm cell fuses with an egg cell to form a zygote. \nZygote division: The zygote's cells divide, and the zygote develops into an embryo. \nEmbryo storage: The embryo is stored in a seed capsule until environmental conditions are right for it to develop into a new plant.\nSeed development: The ovule develops into a seed, and the ovary develops into a fruit. \nSeed germination: When conditions are favorable, the embryo in the seed gives rise to a new plant.",
    "passage": "",
    "question_text": "After fertilization in plants, the zygote develops in to",
    "option_1_text": "fruit",
    "option_1_image": "",
    "option_2_text": "an embryo",
    "option_2_image": "",
    "option_3_text": "seed",
    "option_3_image": "",
    "option_4_text": "an endosperm",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q58.png",
    "explanation_image": "",
    "explanation_text": "The kidneys' primary function is osmoregulation, which is the process of regulating the balance of water and electrolytes in the body. The kidneys also produce urine, filter blood, and remove waste.\n\nVasoconstriction is narrowing or constriction of the blood vessels. It happens when smooth muscles in blood vessel walls tighten, which increases blood pressure.\n\nThe brain, liver, heart, skeletal muscles, and other organs produce heat in the body. The kidneys don't produce heat, but they do play a role in regulating body temperature. When the body is exposed to heat stress, the kidneys respond by redirecting blood flow to the skin to help the body lose heat. However, heat stress can also damage the kidneys.\n\nHormones are produced by endocrine glands, which are groups of cells located throughout the body. Yes, healthy kidneys produce hormones that help regulate many bodily functions, including blood pressure, bone health, and red blood cell production, but it's major function is osmoregulation - regulating the balancing of water and electrolytes in the body.\n\n",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe organ is resposible for",
    "option_1_text": "production of heat",
    "option_1_image": "",
    "option_2_text": "osmoregulation",
    "option_2_image": "",
    "option_3_text": "vasoconstriction",
    "option_3_image": "",
    "option_4_text": "production of hormones",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Scientists can roughly date fossils using radiometric dating, a process that measures the radioactive decay of certain elements. Fossils document the existence of now-extinct species, showing that different organisms have lived on Earth during different periods of the planet's history.",
    "passage": "",
    "question_text": "Which of the following evidences of evolution employs the use of radio-isotope dating?",
    "option_1_text": "comparative anatomy",
    "option_1_image": "",
    "option_2_text": "Embryology",
    "option_2_image": "",
    "option_3_text": "Fossil records",
    "option_3_image": "",
    "option_4_text": "vestigial organs",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A pentadactyl forelimb in vertebrates, meaning a forelimb with five digits, serves a variety of functions depending on the animal's environment, showcasing how a single basic structure can be adapted through evolution to suit different needs, like swimming, flying, running, or grasping, all while maintaining the underlying five-digit pattern as a result of shared ancestry. \n\nPhysiological evidence is an evidence of evolution that deals with the functions of body parts among different species. For example, analogous structures are body parts of different species that have a similar function but can look different.\n\nMoreover, physiological evidence focuses on the specific functional mechanisms and processes that underline the pentadactyl limb's operation while comparative anatomy addresses the evolutionary and anatomical origins of the pentadactyl plan. In other words, Anatomy is the study of the body's physical structure, while physiology is the study of how the body functions.\n\nWhile both comparative anatomy and physiological evidence can support the concept of the pentadactyl forelimb in vertebrates, the key difference lies in the focus of study: comparative anatomy examines the structural similarities in bone arrangement across different species, whereas physiological evidence investigates how the limb functions and adapts to different behaviours in each species; essentially, comparative anatomy looks at the \"blueprint\" of the limb, while physiology examines how that structure is used in different contexts. \n\nEmbryological evidence of the pentadactyl forelimb of vertebrates includes the regulation of gene expression during limb development. \n\nThe fossil record of pentadactyl forelimbs shows that many vertebrates have a similar bone structure, even though their limbs look different on the outside. ",
    "passage": "",
    "question_text": "Pentadactyl forelimb of vertebrate function due to differences in environment is",
    "option_1_text": "comparative anatomy",
    "option_1_image": "",
    "option_2_text": "physiological evidence",
    "option_2_image": "",
    "option_3_text": "embryological evidence",
    "option_3_image": "",
    "option_4_text": "fossil records",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The relationship between ruminants and the bacteria in their digestive tract is symbiotic and mutualistic, meaning both organisms benefit from the interaction. The ruminant provides the bacteria with a warm, moist environment, a constant food supply, and a safe habitat, while the bacteria produce enzymes that break down complex compounds into simpler molecules that the ruminant's intestines can absorb. The bacteria also provide a protein source for the ruminant. ",
    "passage": "",
    "question_text": "The feeding relationship between ruminants and the bacteria in their digestive tract is",
    "option_1_text": "saprophytic",
    "option_1_image": "",
    "option_2_text": "parasitic",
    "option_2_image": "",
    "option_3_text": "symbiotic",
    "option_3_image": "",
    "option_4_text": "heterotrophic",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The green plants which obtain their food partly from insects are called insectivorous plants. Example -Pitcher plant, Sundew plant, venus fly-trap plant etc.\n\nInsectivorous plants are carnivorous plants that eat insects. They are green and can photosynthesize to produce some of their food, but they also eat insects to obtain nitrogen for growth. Nitrogen is a key component of proteins, nucleic acids, and chlorophyll, which plants use for photosynthesis. ",
    "passage": "",
    "question_text": "A photosynthetic carnivorous plant which feeds on insects is",
    "option_1_text": "parasitic",
    "option_1_image": "",
    "option_2_text": "saprophytic",
    "option_2_image": "",
    "option_3_text": "herbivorous",
    "option_3_image": "",
    "option_4_text": "insectivorous",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Xerophytes are plants that have adapted to survive in environments with little water, such as deserts, windy areas, or saline soil. Xerophytes are plants that are found in dry habitats like the desert. They have special adaptations that help them survive in extreme dry conditions.\n\n",
    "passage": "",
    "question_text": "Xerophytes are mostly found in the",
    "option_1_text": "arid land",
    "option_1_image": "",
    "option_2_text": "tropical rainforest",
    "option_2_image": "",
    "option_3_text": "montane forest",
    "option_3_image": "",
    "option_4_text": "Sudan savanna",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q4_e.png",
    "explanation_text": "Organisms in the intertidal zone of the marine habitat require adaptations for attachment.\n\nThe intertidal zone is the area of the marine biome that's between the land and the open sea. Organisms in this zone need to be able to adapt to alternating wet and dry conditions as the tides come in and recede. \n\nIntertidal zone, also known as the littoral zone, organisms in this zone must adapt to alternating wet and dry conditions as tides come in and recede. They must also be able to withstand the damage caused by waves. ",
    "passage": "",
    "question_text": "In which zone of the marine habitat does the organisms require adaptation for attachment?",
    "option_1_text": "Supratidal",
    "option_1_image": "",
    "option_2_text": "Subtidal",
    "option_2_image": "",
    "option_3_text": "intertidal",
    "option_3_image": "",
    "option_4_text": "abyssal zone",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Energy transfer in plants and animals occurs in the form of chemical energy, adenosine triphosphate (ATP), and heat.",
    "passage": "",
    "question_text": "Energy transfer in plants and animals are in the form of",
    "option_1_text": "DNA",
    "option_1_image": "",
    "option_2_text": "ATP",
    "option_2_image": "",
    "option_3_text": "GTP",
    "option_3_image": "",
    "option_4_text": "RNA",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Plasma is a liquid component of blood that carries blood cells and other vital substances throughout the body. It's also a state of matter, like solids, liquids, and gases. It is a light yellow liquid that contains water, salts, enzymes, and proteins. It contains clotting factors that help blood clot. It also contains antibodies that help fight infection. \n\nHemoglobin is the pigment that carries oxygen in the blood. Hemoglobin is a protein found in red blood cells (RBCs) that carries oxygen. It's also the reason why blood appears red. It picks up oxygen in the lungs and drops it off in other parts of the body.\n\nErythrocytes, also known as red blood cells (RBCs), are the most common type of blood cell in vertebrates. They are responsible for transporting oxygen and nutrients throughout the body. ",
    "passage": "",
    "question_text": "The pigment carrying oxygen in the blood is",
    "option_1_text": "plasma",
    "option_1_image": "",
    "option_2_text": "haemoglobin",
    "option_2_image": "",
    "option_3_text": "oxyhaemoglobin",
    "option_3_image": "",
    "option_4_text": "erythrocytes",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cross-pollination is a type of pollination that produces healthier offspring, viable seeds, and new varieties.\n\nCross-pollination involves the transfer of pollen from the anther of one flower to the stigma of a different flower. In contrast, self-pollination is when pollen is transferred within a flower or between flowers on the same plant. Self-pollination is effective in a stable environment, but it can lead to weak offspring that are less adapted to the environment",
    "passage": "",
    "question_text": "Production of healthier offspring, viable seeds and formation of new varieties are good characteristics",
    "option_1_text": "self pollination",
    "option_1_image": "",
    "option_2_text": "cross pollination",
    "option_2_image": "",
    "option_3_text": "wind pollination",
    "option_3_image": "",
    "option_4_text": "insect pollination",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Courtship behavior is a series of actions that animals perform to find a mate and reproduce. Animals may display their beauty or strength to attract a mate. ",
    "passage": "",
    "question_text": "One of the following is a courtship behaviour in animals",
    "option_1_text": "fighting",
    "option_1_image": "",
    "option_2_text": "display",
    "option_2_image": "",
    "option_3_text": "hibernation",
    "option_3_image": "",
    "option_4_text": "feeding",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A patient with type AB blood can receive red blood cells from any blood type( A, B,AB or O), making them sometimes known as universal recipients. This is because people with type AB blood do not produce anti-A or anti-B antibodies. ",
    "passage": "",
    "question_text": "In blood transfusion, a patient with group AB receives",
    "option_1_text": "Group A, B, AB",
    "option_1_image": "",
    "option_2_text": "Group O, A, B",
    "option_2_image": "",
    "option_3_text": "Group O, B, AB",
    "option_3_image": "",
    "option_4_text": "Group O, A, B, AB",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "\nA dominant allele is a trait that is always expressed in an organism's phenotype, as long as at least one copy of the allele is present. An organism's observable traits are called its phenotype, while its underlying genetic makeup is called its genotype. A person's phenotype is determined by both their genotype and environmental factors.",
    "passage": "",
    "question_text": "A trait that is always expressed during crossing of hereditary characteristics is",
    "option_1_text": "recessive trait",
    "option_1_image": "",
    "option_2_text": "dominant trait",
    "option_2_image": "",
    "option_3_text": "homozygous trait",
    "option_3_image": "",
    "option_4_text": "heterozygous trait",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "People with type AB blood are considered universal recipients because they can receive blood from all blood groups A, B, or O without the risk of adverse effects. This is because people with type AB blood have both A and B antigens on their red blood cells, but no antibodies in their plasma. ",
    "passage": "",
    "question_text": "Blood group AB is considered as universal recipient because they can receive blood from groups",
    "option_1_text": "A and O",
    "option_1_image": "",
    "option_2_text": "A and O",
    "option_2_image": "",
    "option_3_text": "AB and O",
    "option_3_image": "",
    "option_4_text": "A, B, AB and O",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Counter-shading is a form of camouflage that helps organisms blend into their surroundings. Counter-shading is a coloration pattern where the parts of an animal that are usually in shadow are lighter in colour, and the parts that are usually in light are darker. This makes the animal more difficult to detect by reducing the contrast between the animal and its background.",
    "passage": "",
    "question_text": "An example of organism that exhibits counter shading to escape from its predator is",
    "option_1_text": "grasshopper",
    "option_1_image": "",
    "option_2_text": "toad",
    "option_2_image": "",
    "option_3_text": "fish",
    "option_3_image": "",
    "option_4_text": "chameleon",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Hibernation is a natural behavior that allows animals to survive the winter by slowing down their metabolism and body temperature. Hibernating animals use stored fat for energy while they are inactive. \n\nAestivation is a state of dormancy that animals enter during hot and dry periods to conserve energy and avoid dehydration. It's similar to hibernation, but occurs in the summer instead of winter. \n\nCounter-shading is a camouflage technique where an animal's upper body is darker and its lower body is lighter. It is an adaptive feature that enables animals to remain undetected or unnoticed.\n\nAnimal migration is when animals move from one place to another in a regular pattern. Migrations can be seasonal, but other factors like rainfall can also influence them. ",
    "passage": "",
    "question_text": "A form of adaptive coloration that helps animals to remain unnoticed is",
    "option_1_text": "hibernation",
    "option_1_image": "",
    "option_2_text": "aestivation",
    "option_2_image": "",
    "option_3_text": "countershading",
    "option_3_image": "",
    "option_4_text": "migration",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q74.png",
    "explanation_image": "q74_e.png",
    "explanation_text": " - Pincers(maxillae)\n\nII - Head\n\nIII - Thorax\n\nIV - Abdomen\n\n(See diagram below)\n\n",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe part labelled III is",
    "option_1_text": "abdomen",
    "option_1_image": "",
    "option_2_text": "head",
    "option_2_image": "",
    "option_3_text": "maxillae",
    "option_3_image": "",
    "option_4_text": "thorax",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Jean-Baptiste Lamarck's theory of evolution, also known as Lamarckism, is based on the idea that organisms can pass on physical characteristics they acquire during their lifetime to their offspring. This is also known as the inheritance of acquired characteristics or soft inheritance.",
    "passage": "",
    "question_text": "Lamarck's theory of evolution is based on the idea of",
    "option_1_text": "the inheritance of acquired traits",
    "option_1_image": "",
    "option_2_text": "organisms' survival of the fittest",
    "option_2_image": "",
    "option_3_text": "organisms constantly struggling for existence",
    "option_3_image": "",
    "option_4_text": "plenty offspring produced by organisms",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Somatic cells are diploid, meaning they have two sets of chromosomes, one from the mother and one from the father. During mitosis, somatic cells replicate their DNA and divide to produce two daughter cells that each receive a complete copy of the genome.\n\nIf a somatic cell has 8 chromosomes, then the gamete will have 4 chromosomes. This is because gametes have half the number of chromosomes as somatic cells. \n\n",
    "passage": "",
    "question_text": "How many chromosomes will be present in a gamete if the somatic cell has 8 chromosomes?",
    "option_1_text": "16",
    "option_1_image": "",
    "option_2_text": "6",
    "option_2_image": "",
    "option_3_text": "4",
    "option_3_image": "",
    "option_4_text": "800.00%",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q77.png",
    "explanation_image": "",
    "explanation_text": "Since offsprings for F1\n  are  AA  AS  AS  SS\n\nPhenotypic ratio :     3: 1\n\nGenotypic ratio : 1 AA  : 2 AS : 1 SS  â‡’  1:  2: 1",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nWhat is the genotypic ratio of the offspring produced in F1\n generation?",
    "option_1_text": "2:01:01",
    "option_1_image": "",
    "option_2_text": "1:02:01",
    "option_2_image": "",
    "option_3_text": "2:2",
    "option_3_image": "",
    "option_4_text": "3:1",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The thalamus is a part of the brain that relays sensory and motor signals, and regulates consciousness, alertness, learning, and memory.\n\nThe hypothalamus, a part of the brain, regulates body temperature, thirst, and hunger. It produces hormones that control many bodily functions, including body temperature, heart rate, hunger, mood, and sleep. \n\nThe medulla oblongata controls vital functions like breathing, heart rate, and blood pressure.\n\nThe spinal cord acts as a communication pathway between the brain and the rest of the body, carrying sensory information from the body to the brain and motor commands from the brain to the muscles, while also coordinating reflexes independently of the brain. \n\n ",
    "passage": "",
    "question_text": "Body temperature, thirst and hunger are regulated by",
    "option_1_text": "thalamus",
    "option_1_image": "",
    "option_2_text": "hypothalamus",
    "option_2_image": "",
    "option_3_text": "medulla oblongata",
    "option_3_image": "",
    "option_4_text": "spinal cord",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cell division that involves the growth, development, repairs and replacement of worn out tissues is",
    "passage": "",
    "question_text": "Cell division that involves the growth, development, repairs and replacement of worn out tissues is",
    "option_1_text": "biosynthesis",
    "option_1_image": "",
    "option_2_text": "mitosis",
    "option_2_image": "",
    "option_3_text": "meiosis",
    "option_3_image": "",
    "option_4_text": "synthesis",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q80.png",
    "explanation_image": "",
    "explanation_text": "The flower is the reproductive organ of a plant. It is a plant organ, which is defined as a group of tissues that work together to perform a specific function. ",
    "passage": "",
    "question_text": "Use the diagram to answer the question that follows\n\nThe flower of plants belongs to part labelled",
    "option_1_text": "I",
    "option_1_image": "",
    "option_2_text": "II",
    "option_2_image": "",
    "option_3_text": "III",
    "option_3_image": "",
    "option_4_text": "IV",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The bacteria in the colon produce large amounts of vitamins B and K through fermentation. Vitamin K is a fat-soluble vitamin that helps blood clot and prevents excessive bleeding. Bacteria in the large intestine synthesize vitamins, not minerals, neither do they synthesize glucose but they do play a role in other processes that are important for the body.\n\nAlso, bacteria in the large intestine can synthesize amino acids. This process helps regulate the body's amino acid balance. ",
    "passage": "",
    "question_text": "The bacteria in the large intestine of man synthesizes",
    "option_1_text": "vitamins and minerals",
    "option_1_image": "",
    "option_2_text": "vitamins and glucose",
    "option_2_image": "",
    "option_3_text": "amino acids and vitamins",
    "option_3_image": "",
    "option_4_text": "amino acids and minerals",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The main excretory product of an earthworm is urea, with some ammonia gas also being released.\n\nEarthworm is an annelid whose major excretory products are: Urea ~ 50% , Ammonia ~ 20-40% , Creatinine and other nitrogenous compounds ~ 5%\n\nUric acid is the main excretory product of birds, reptiles, and some insects. ",
    "passage": "",
    "question_text": "The main excretory product of earthworm is",
    "option_1_text": "ammonia",
    "option_1_image": "",
    "option_2_text": "carbon dioxide",
    "option_2_image": "",
    "option_3_text": "urea",
    "option_3_image": "",
    "option_4_text": "uric acid",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Aestivation is a state of dormancy or reduced activity that animals enter to survive in hot, dry conditions or when food or water is scarce. \n\nDrought is a primary trigger for aestivation in animals, as it leads to water scarcity and increased temperatures.\n\nWhile strong winds can be uncomfortable for animals, they don't typically trigger aestivation.\n\nRain is often associated with cooler temperatures and increased water availability.\n\nCold temperatures are more likely to trigger hibernation not aestivation.\n\n",
    "passage": "",
    "question_text": "Which of the following conditions causes aestivation in animals?",
    "option_1_text": "Wind",
    "option_1_image": "",
    "option_2_text": "Drought",
    "option_2_image": "",
    "option_3_text": "Rain",
    "option_3_image": "",
    "option_4_text": "Cold",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Photometers measure the strength of electromagnetic radiation, including visible light, ultraviolet light, gamma rays, and x-rays. \n\nAn anemometer measures wind speed, wind direction, and the strength of gusts. \n\nA hygrometer measures the amount of water vapour, or humidity, in the air or another gas.",
    "passage": "",
    "question_text": "An instrument used for measuring the intensity of light",
    "option_1_text": "thermometer",
    "option_1_image": "",
    "option_2_text": "photometer",
    "option_2_image": "",
    "option_3_text": "anemometer",
    "option_3_image": "",
    "option_4_text": "hygrometer",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "White blood cells, also known as leukocytes, are a common component of both blood and lymph.\n\nWhite blood cells: These cells are made in the bone marrow and help the body fight infection. They are a key part of the immune system's reaction to foreign substances in the body. \n\nLymph: This fluid is similar in composition to blood plasma and is derived from it. It contains lymphocytes, which are a type of white blood cell. Lymph is part of the lymphatic system, which helps the body defend itself. ",
    "passage": "",
    "question_text": "A common component of blood and lymph is",
    "option_1_text": "fats",
    "option_1_image": "",
    "option_2_text": "plasma",
    "option_2_image": "",
    "option_3_text": "red blood cell",
    "option_3_image": "",
    "option_4_text": "white blood cell",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The glomerulus is a cluster of capillaries in the kidney that filters blood to remove waste and extra water. The filtered waste and water are then excreted from the body in urine. \n\nBowman's capsule is a cup-shaped sac in the kidney that filters blood to create urine. It's part of the nephron, which is the filtration structure in the kidney. \n\nSelective reabsorption of useful substances occurs in the proximal convoluted tubule, the loop of Henle and the collecting duct. The loop of Henle is a U-shaped tubule in the kidney's medulla that reabsorbs water and salt from the filtrate.\n\nThe urethra's main function is to allow urine to pass out of the body. It also allows semen to pass through in males. ",
    "passage": "",
    "question_text": "The part of the kidney where the selective reabsorption takes place is",
    "option_1_text": "glomerulus",
    "option_1_image": "",
    "option_2_text": "Bowman's capsule",
    "option_2_image": "",
    "option_3_text": "Henle's loop",
    "option_3_image": "",
    "option_4_text": "urethra",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Some parenchyma cells come from meristematic cells, but not all parenchyma cells are meristematic. ",
    "passage": "",
    "question_text": "The schlerenchyma tissues consist of",
    "option_1_text": "dead cell",
    "option_1_image": "",
    "option_2_text": "living cell",
    "option_2_image": "",
    "option_3_text": "tracheid cell",
    "option_3_image": "",
    "option_4_text": "meristematic cell",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The human vertebral column, also known as the spinal column or backbone, has 33 vertebrae:\n\nCervical: 7 vertebrae (neck region)\nThoracic: 12 vertebrae (Chest cavity)\nLumbar: 5 vertebrae (in the lower back, between the thoracic vertebrae and the pelvis)\nSacral: 5 vertebrae that fuse together to form the sacrum (at the base of the spine)\nCaudal: 4 vertebrae that fuse together to form the coccyx (in the tail region, posterior to the anus)",
    "passage": "",
    "question_text": "The number of vertebrae in the human vertebral column is",
    "option_1_text": "30",
    "option_1_image": "",
    "option_2_text": "33",
    "option_2_image": "",
    "option_3_text": "38",
    "option_3_image": "",
    "option_4_text": "3900.00%",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Swarming is a coordinated collective motion that can be seen in both animate and inanimate systems. For example, when ants get crowded, they coordinate waves of activity every 20 minutes. Social insects like ants and honey bees, as well as non-social insects like flies, moths, cockroaches, and locusts. Termites swarm after their original colony has reached a certain capacity level and is ready to expand",
    "passage": "",
    "question_text": "The organisms that adopt swarming as an adaptation to overcome overcrowding are",
    "option_1_text": "Agama lizard",
    "option_1_image": "",
    "option_2_text": "tilapia",
    "option_2_image": "",
    "option_3_text": "rats",
    "option_3_image": "",
    "option_4_text": "termites",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Loam soil is considered the \"friendliest\" soil to cultivate. It's also relatively resistant to drought, warms up early in the spring, and is moderately easy to work. Loamy soil has moderate porosity. Loam is a mixture of sand, silt, and clay in roughly equal amounts, which results in a soil that's airy and not too dry.\n\nSandy soil :Highly porous because it's made up of large granules and sometimes pebbles. Sandy soil loses moisture easily.\n\nClayey soil: Very low porosity because it's made up of very fine particles that are tightly packed together. Clayey soil is sticky and heavy.",
    "passage": "",
    "question_text": "Loamy soil is characterized by",
    "option_1_text": "low humus and high porosity",
    "option_1_image": "",
    "option_2_text": "high humus and high porosity",
    "option_2_image": "",
    "option_3_text": "moderate humus and low porosity",
    "option_3_image": "",
    "option_4_text": "high humus and moderate porosity",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cones in the retina of the eye are photoreceptor cells, which are responsible for colour vision, visual acuity, and daylight vision.\n\n",
    "passage": "",
    "question_text": "",
    "option_1_text": "cell",
    "option_1_image": "",
    "option_2_text": "tissue",
    "option_2_image": "",
    "option_3_text": "organ",
    "option_3_image": "",
    "option_4_text": "system",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The ovule, which is located inside the ovary of a flower, develops into a seed after fertilization. After fertilization, the ovary grows and matures into a fruit, which encloses the seeds.",
    "passage": "",
    "question_text": "The part of the flower that develops into seed is",
    "option_1_text": "ovule",
    "option_1_image": "",
    "option_2_text": "pedicel",
    "option_2_image": "",
    "option_3_text": "petal",
    "option_3_image": "",
    "option_4_text": "style",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cell Sap is a fluid transported in xylem cells (vessel elements or tracheids) or phloem sieve tube elements of a plant. These cells transport water and nutrients throughout the plant.",
    "passage": "",
    "question_text": "Which of these is a medium of transportation in plants?",
    "option_1_text": "cell sap",
    "option_1_image": "",
    "option_2_text": "Nucleus",
    "option_2_image": "",
    "option_3_text": "Mitochondrion",
    "option_3_image": "",
    "option_4_text": "Ribosome",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Measles is caused by the measles virus, a highly contagious RNA virus.It spreads through the air when an infected person breathes, coughs, or sneezes. It can also spread through direct contact with secretions.\n\nCholera is a bacterial infection of the intestines caused by the bacterium Vibrio cholerae.\n\nTyphoid fever is a bacterial infection that can be life-threatening if left untreated. It's caused by the Salmonella Typhi bacteria, which is related to the bacteria that cause salmonella food poisoning. ",
    "passage": "",
    "question_text": "Which of the following is a viral disease?",
    "option_1_text": "Syphilis",
    "option_1_image": "",
    "option_2_text": "Measles",
    "option_2_image": "",
    "option_3_text": "Cholera",
    "option_3_image": "",
    "option_4_text": "Typhoid",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q95.png",
    "explanation_image": "",
    "explanation_text": "The experiment is set up to determine the presence of starch. When Iodine is added to the parboiled leaf, a blue-black or brown colour is observed. This indicates the presence of starch and vice versa.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows\n\nThe experiment is set up to determine the presence of",
    "option_1_text": "chlorophyll",
    "option_1_image": "The cone in the retina of eye is an example of",
    "option_2_text": "starch",
    "option_2_image": "",
    "option_3_text": "oxygen",
    "option_3_image": "",
    "option_4_text": "pigment",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Arthropods and most molluscs have an open circulatory system.  In an open circulatory system, blood is pumped from the heart into a body cavity, called a hemocoel, instead of being enclosed in blood vessels. The blood, called hemolymph, mixes with interstitial fluid and circulates around the organs as the animal moves. The blood returns to the heart through small pores called ostia.\n\nA closed circulatory system is a system where blood flows through a network of vessels, or tubes, that are connected to each other. The heart pumps blood through the system in a continuous loop. Many animals have a closed circulatory system, including all mammals, birds, fish, reptiles, amphibians, and some invertebrates. \n\nA single circulatory system is a type of circulatory system where blood passes through the heart only once during each complete circuit of the body, meaning it only travels through the heart one time before returning to it. e.g fishes, invertebrates and some amphibians etc\n\nA double circulatory system is a system where blood passes through the heart twice during each circuit of the body. This system is found in mammals, including humans. ",
    "passage": "",
    "question_text": "The type of circulatory system found in arthropods and some molluscs is",
    "option_1_text": "open circulatory system",
    "option_1_image": "",
    "option_2_text": "closed circulatory system",
    "option_2_image": "",
    "option_3_text": "single circulatory system",
    "option_3_image": "",
    "option_4_text": "double circulatory system",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The main excretory products of plants during metabolism are carbon dioxide, excess water, and nitrogenous compounds.\n\nPlants produce carbon dioxide as a metabolic waste product during respiration, while oxygen is a metabolic waste product from photosynthesis. Excretion of gaseous waste in plants takes place through stomatal pores on leaves. Oxygen released during photosynthesis is used for respiration while carbon dioxide released during respiration is used for photosynthesis.",
    "passage": "",
    "question_text": "In plants, the main excretory product produced during metabolism is",
    "option_1_text": "oxygen",
    "option_1_image": "",
    "option_2_text": "alkaloids",
    "option_2_image": "",
    "option_3_text": "carbon(iv)oxide",
    "option_3_image": "",
    "option_4_text": "mucilage",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q98.png",
    "explanation_image": "q98_e.png",
    "explanation_text": "The oviduct is a muscular, J-shaped tube that carries eggs from the ovaries to the uterus. It's a vital part of the female reproductive system, and fertilization typically occurs in the oviduct. The tube that connects the ovary to the uterus is called the fallopian tube. There are two fallopian tubes, one on each side of the uterus. It is also called the oviduct. \n\nThe placenta is an organ that forms in the womb, also called the uterus, during pregnancy. The placenta is connected to a developing baby by a tube-like structure called the umbilical cord. Through the umbilical cord, the placenta provides oxygen and nutrients to a developing baby.",
    "passage": "",
    "question_text": "Use the diagram above to answer the questions that follow\n\nThe part labelled I is",
    "option_1_text": "oviduct",
    "option_1_image": "",
    "option_2_text": "placenta",
    "option_2_image": "",
    "option_3_text": "amnion",
    "option_3_image": "",
    "option_4_text": "uterus",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q99_e.png",
    "explanation_text": "Comparative anatomy is the study of similarities and differences in the anatomy of different species. It indicates that organisms share a common ancestor. Pentadactyl forelimb of vertebrate \n\n(see diagram above)",
    "passage": "",
    "question_text": "Comparative anatomy to study evidence for evolution depends on",
    "option_1_text": "four fingered",
    "option_1_image": "",
    "option_2_text": "three fingered",
    "option_2_image": "",
    "option_3_text": "two fingered",
    "option_3_image": "",
    "option_4_text": "five fingered",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Iron is a key component in the production of chlorophyll, which is essential for photosynthesis. It serves as a component of many vital enzymes such as cytochromes of the electron transport chain, and it is thus required for a wide range of biological functions. In plants, iron is involved in the synthesis of chlorophyll, and it is essential for the maintenance of chloroplast structure and function.",
    "passage": "",
    "question_text": "Iron is an essential nutrient in plants because it",
    "option_1_text": "aids in the formation of chlorophyll and proteins",
    "option_1_image": "",
    "option_2_text": "helps in cell division",
    "option_2_image": "",
    "option_3_text": "protects the plants from pest attack",
    "option_3_image": "",
    "option_4_text": "fastens fruits maturation",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The pituitary gland is known as the \"master gland\" because it controls the functions of many other endocrine glands in the body. The pituitary gland is a small, pea-sized gland located at the base of the brain, in line with the top of the nose.\n\n",
    "passage": "",
    "question_text": "The endocrine gland that is called the master gland is the",
    "option_1_text": "thyroid gland",
    "option_1_image": "",
    "option_2_text": "pancreas",
    "option_2_image": "",
    "option_3_text": "pituitary gland",
    "option_3_image": "",
    "option_4_text": "adrenal gland",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Both living and non-living things are matters. Matters are defined to be anything (living nad non-living things) that has mass and occupies space.",
    "passage": "",
    "question_text": "Which of the following characteristics is possessed by both living and non-living things?",
    "option_1_text": "Both age and die",
    "option_1_image": "",
    "option_2_text": "Both have life",
    "option_2_image": "",
    "option_3_text": "Both have weight",
    "option_3_image": "",
    "option_4_text": "Both have no shape",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Infectious diseases are diseases caused by microorganisms like bacteria, viruses, fungi, or parasites that enter the body and multiply, damaging cells and causing an infection.",
    "passage": "",
    "question_text": "Infectious diseases are caused by",
    "option_1_text": "bacteria",
    "option_1_image": "",
    "option_2_text": "protists",
    "option_2_image": "",
    "option_3_text": "Amoeba",
    "option_3_image": "",
    "option_4_text": "Amoeba",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Centrioles are organelles that help organize microtubules, cell division, and the assembly of cilia and flagella. \n\nVacuoles are organelles that help cells store, transport, and manage waste. They are found in plant, animal, fungal, and protist cells. \n\nPlastids are organelles in plant cells that perform a variety of functions, including photosynthesis, storage, and biosynthesis. \n\nRibosomes are organelles in cells that synthesize proteins by reading messenger RNA (mRNA) and translating the genetic code into amino acids.",
    "passage": "",
    "question_text": "The cell organelle responsible for the synthesis of protein is the",
    "option_1_text": "centriole",
    "option_1_image": "",
    "option_2_text": "vacuole",
    "option_2_image": "",
    "option_3_text": "plastid",
    "option_3_image": "",
    "option_4_text": "ribosome",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q105.png",
    "explanation_image": "",
    "explanation_text": "Thigmotropism is a directional growth movement which occurs as a mechanosensory response to a touch stimulus. Mechanosensory responses in plants are the ways that plants move or change shape in response to touch, wind, or other mechanical stimuli. \n\nPhototropism is the ability of plants to grow towards or away from light, which is a vital adaptive process for plants.\n\nGeotropism is the growth of the parts of plants in response to the force of gravity.\n\nHydrotropism is a plant's growth response in which the direction of growth is determined by a stimulus or gradient in water concentration. It is the growth or turning of plant roots towards or away from moisture.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows",
    "option_1_text": "thigmotropism",
    "option_1_image": "",
    "option_2_text": "phototropism",
    "option_2_image": "",
    "option_3_text": "geotropism",
    "option_3_image": "",
    "option_4_text": "hydrotropism",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "High natality, also known as a high birth rate, is when a population has a high number of births per person in a given amount of time. It's usually measured in relation to the population size, such as the number of births per 1,000 people in a year.\n\nHigh natality, or fertility rate, can lead to overcrowding if the population outgrows the available resources.",
    "passage": "",
    "question_text": "Which of the following factors can lead to overcrowding?",
    "option_1_text": "Emigration",
    "option_1_image": "",
    "option_2_text": "Competition",
    "option_2_image": "",
    "option_3_text": "High natality",
    "option_3_image": "",
    "option_4_text": "High mortality",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q107_e.png",
    "explanation_text": "Raffia palm and Coconut are  common features in tropical rainforests.\n\nDesert plants are adapted to survive in regions with high temperature and less moisture content in the soil. Cactus, baobao and acacia trees are examples of desert plants. \n\nWhite and red Mangrove grow mainly at tropical and subtropical latitudes because mangrove trees cannot withstand freezing temperatures.\n\nIsoberlinia doka is a hardwood tree native to African tropical savannas and Guinean forest-savanna",
    "passage": "",
    "question_text": "The common examples of trees found in the desert are",
    "option_1_text": "raffia palm and coconut",
    "option_1_image": "",
    "option_2_text": "baobab and cacti",
    "option_2_image": "",
    "option_3_text": "white and red mangrove",
    "option_3_image": "",
    "option_4_text": "shea-butter and isobelina",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q108_e.jpeg",
    "explanation_text": "Self-pollination is the transfer of pollen grains from the anther to the stigma of the same flower. If the F1 generation self-pollinates, the genotypic ratio of the offspring will depend on the genotype of the F1 generation. The genotypic ratio is 1:2:1 ",
    "passage": "",
    "question_text": "If the F1 generation allows for self-pollination, what will be the genotypic ratio of the offspring?",
    "option_1_text": "1 : 2 : 1",
    "option_1_image": "",
    "option_2_text": "2 : 2",
    "option_2_image": "",
    "option_3_text": "3 : 1",
    "option_3_image": "",
    "option_4_text": "2 : 1 : 1",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Mimicry is a biological phenomenon where organisms that are not closely related resemble each other. This resemblance can be between different species or between individuals of the same species.\n\nWhen an organism resembles another organism to improve its chances of survival, it's called mimicry.",
    "passage": "",
    "question_text": "The resemblance of an organism to another organism as means of enhancing it's chances of survival in its habitat is known as",
    "option_1_text": "counter shading",
    "option_1_image": "",
    "option_2_text": "protective colouration",
    "option_2_image": "",
    "option_3_text": "mimicry",
    "option_3_image": "",
    "option_4_text": "warning",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The urinary tubules open into a proximal convoluted tubule to form a U-shaped loop called the loop of Henle. The loop of Henle transfers fluid from the proximal to the distal tubule. The loop of Henle's two main functions are to dilute urine and establish an osmotic gradient.",
    "passage": "",
    "question_text": "The urinary tubules opens into a proximal convoluted tubule coils to form distal by making a",
    "option_1_text": "Z- shaped loop",
    "option_1_image": "",
    "option_2_text": "L- shaped loop",
    "option_2_image": "",
    "option_3_text": "U- shaped loop",
    "option_3_image": "",
    "option_4_text": "I- shaped loop",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Continuous variation refers to a characteristic within a species that can vary gradually across a range of values, like height or weight, where individuals can fall anywhere along a spectrum.Discontinuous variation is when a characteristic has a limited number of possible values, and individuals fall into distinct categories. For example, Blood type(People can only have one of the four blood types: A, B, AB, or O), Gender (People are either male or female) , Eye colour (Eyes can only be a certain colour) etc \n\nFingerprints are a type of discontinuous morphological variation, which means that the differences between variants are more qualitative than quantitative. Morphological variations are variations in physical traits or outward appearances. Fingerprints are an important method of forensic science, and recovering partial fingerprints from a crime scene is a common technique\n\n",
    "passage": "",
    "question_text": "A discontinuous morphological variation often used in crime detection is the",
    "option_1_text": "skin colour",
    "option_1_image": "",
    "option_2_text": "blood group",
    "option_2_image": "",
    "option_3_text": "finger prints",
    "option_3_image": "",
    "option_4_text": "eye colour",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A \"blood buffer\" refers to a chemical system within the blood, that helps maintain a stable pH level by neutralizing added acids or bases, ensuring proper bodily functions can occur; \n\nPlasma is the liquid component of blood, in which the red blood cells, white blood cells, and platelets are suspended. Plasma is the component of blood that acts as the major buffer, maintaining a normal pH level that supports cell function.",
    "passage": "",
    "question_text": "The component that serves as major buffer in blood is",
    "option_1_text": "plasma",
    "option_1_image": "",
    "option_2_text": "erythrocytes",
    "option_2_image": "",
    "option_3_text": "leucocytes",
    "option_3_image": "",
    "option_4_text": "lymph",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "DNA is the material that contains genes and is the building block of the human body. DNA is made up of two strands that twist into a spiral ladder called a helix.\n\nDNA is packaged into chromosomes to protect it and to regulate which genes are accessed and when. Chromosomes are not visible in the cell's nucleus when the cell is not dividing, but they become more tightly packed and visible during cell division. ",
    "passage": "",
    "question_text": "DNA carries the genetic information and are generally found in the",
    "option_1_text": "ribosomes",
    "option_1_image": "",
    "option_2_text": "chromosomes",
    "option_2_image": "",
    "option_3_text": "blood",
    "option_3_image": "",
    "option_4_text": "enzymes",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q114.jpeg",
    "explanation_image": "",
    "explanation_text": "During prophase I, homologous chromosomes from each parent pair up and exchange genetic material, a process known as crossing over. This process creates new combinations of genes in the resulting gametes. When two gametes unite during fertilization, the offspring will have a unique combination of DNA.\n\nGenetic recombination during fertilization takes place in the prophase I stage of meiosis ( part labelled III)",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows:\n\nRecombination of genes at fertilization is represented by the part labelled",
    "option_1_text": "I",
    "option_1_image": "",
    "option_2_text": "II",
    "option_2_image": "",
    "option_3_text": "III",
    "option_3_image": "",
    "option_4_text": "IV",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Hemophilia is a rare, genetic blood disorder that happens when your blood doesn't clot and make your bleeding slow down or stop.Most people who have hemophilia are born with it. It is inherited (passed down) from a parent to a child.It is a chromosomally linked recessive disorder, the result of a mutated gene on the X chromosome. Because those assigned male at birth only have one X chromosome, they can develop hemophilia if they inherit the altered gene.\n\nThe X-linked recessive inheritance pattern explains why hemophilia is more common in males than females. Females can be carriers of the mutated gene, but they are less likely to develop the disorder themselves. In summary, hemophilia in humans controlled by recessive genes.",
    "passage": "",
    "question_text": "Hemophilia in humans is controlled by the",
    "option_1_text": "blood group",
    "option_1_image": "",
    "option_2_text": "dominant gene",
    "option_2_image": "",
    "option_3_text": "rhesus factor",
    "option_3_image": "",
    "option_4_text": "recessive gene",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The Olfactory lobe is the portion of the cerebral cortex concerned with the sense of smell. It is part of the Cerebrum. It is a structurally distinct cortical region on the ventral surface of the forebrain, composed of several areas.\n\nThe medulla oblongata controls vital functions like breathing, heart rate, and blood pressure.\n\nThe cerebrum, the largest part of the brain, is responsible for controlling conscious thought, actions, emotions, memory, language, reasoning, and sensory perception, essentially acting as the center for higher-level cognitive functions like thinking, learning, and problem-solving;\n\nThe cerebellum's primary function is to coordinate movement, maintain balance and posture, regulate muscle tone, and facilitate motor learning, essentially ensuring smooth and precise muscle control by processing information from other brain areas and sensory receptors;",
    "passage": "",
    "question_text": "The part of the brain that receives sensory impulses of smell is the",
    "option_1_text": "olfactory lobe",
    "option_1_image": "",
    "option_2_text": "medulla oblongata",
    "option_2_image": "",
    "option_3_text": "cerebrum",
    "option_3_image": "",
    "option_4_text": "Cerebellum",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "q117.png",
    "explanation_image": "",
    "explanation_text": "Marchantia is a member of the Marchantiaceae, the Marchantia family. This family is one of many thalloid liverwort families or bryophyta. A thalloid liverwort is strap-like and often forms large colonies on the surface on which it grows. A liverwort is non-vascular green plant. \n\nSpirogyra is a green algae that is a member of the Thallophyta division. It is also known as water silk, mermaid's tresses, and blanket weed. \n\nDryopteris, also known as wood ferns, male ferns, or buckler ferns, is a genus of ferns in the Dryopteridaceae family, of pteridophyta.\n\nCycads are part of the order Cycadales and the division Cycadophyta, which are both groups of gymnosperms.\n\nMaize belongs to the group angiosperms. Angiosperms are plants that have a well-developed vascular system \n\nOnly bryophytes(Marchantia) -  I and Thallophytes (Spirogyra) - II are non- vascular, others have vascular systems. Therefore option A is the correct answer.",
    "passage": "",
    "question_text": "Use the diagram above to answer the question that follows.\nExamples of non-vascular plants are labelled",
    "option_1_text": "I and II",
    "option_1_image": "",
    "option_2_text": "I and III",
    "option_2_image": "",
    "option_3_text": "II and III",
    "option_3_image": "",
    "option_4_text": "II and IV",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following organisms contains Chlorophyll in its cells?",
    "option_1_text": "Caterpillar",
    "option_1_image": "",
    "option_2_text": "Paramecium",
    "option_2_image": "",
    "option_3_text": "Euglena",
    "option_3_image": "",
    "option_4_text": "Grasshopper",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Species are groups of organisms that",
    "option_1_text": "are of different origins and are always found together",
    "option_1_image": "",
    "option_2_text": "are of common origin but cannot interbreed freely",
    "option_2_image": "",
    "option_3_text": "have similar features and can interbreed freely",
    "option_3_image": "",
    "option_4_text": "resemble each other and occupy different niches",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "A plant with short, vertical underground stem is a",
    "option_1_text": "bulb",
    "option_1_image": "",
    "option_2_text": "corm",
    "option_2_image": "",
    "option_3_text": "rhizome",
    "option_3_image": "",
    "option_4_text": "tuber",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The diagram above is an illustration of a reproductive process in an organism. Study it and answer ques tions 4 and 5.\n\nThe type of reproduction illustrated is",
    "option_1_text": "budding",
    "option_1_image": "",
    "option_2_text": "binary fission",
    "option_2_image": "",
    "option_3_text": "grafting",
    "option_3_image": "",
    "option_4_text": "vegetative propagation",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The illustrated organism is capable of reproducing by",
    "option_1_text": "sexual means only",
    "option_1_image": "",
    "option_2_text": "asexual means only",
    "option_2_image": "",
    "option_3_text": "vegetative propagation only",
    "option_3_image": "",
    "option_4_text": "sexual and asexual means",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following organisms consists of unicellular cells joined to form a filament?",
    "option_1_text": "Amoeba",
    "option_1_image": "",
    "option_2_text": "Spirogyra",
    "option_2_image": "",
    "option_3_text": "Euglena",
    "option_3_image": "",
    "option_4_text": "Chlamydomonas",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The structure in the cell that controls the movement of substances in and out of the cell is the",
    "option_1_text": "cytoplasmic membrane",
    "option_1_image": "",
    "option_2_text": "nuclear membrane",
    "option_2_image": "",
    "option_3_text": "protoplasm",
    "option_3_image": "",
    "option_4_text": "endoplasm",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The bursting of a red blood cell placed in a hypotonic solution is called",
    "option_1_text": "crenation",
    "option_1_image": "",
    "option_2_text": "haemolysis",
    "option_2_image": "",
    "option_3_text": "plasmolysis",
    "option_3_image": "",
    "option_4_text": "cytolysis",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The function of the root hair in plants is to",
    "option_1_text": "absorb soil water by the process of osmosis.",
    "option_1_image": "",
    "option_2_text": "excrete water and mineral salts by simple diffusion.",
    "option_2_image": "",
    "option_3_text": "purify the soil for the plant.",
    "option_3_image": "",
    "option_4_text": "translocate manufactured food",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "If a germinating seed is attached horizontally to a revolving klinostat, what would be the effect on the seedling after three days? The",
    "option_1_text": "plumule will curve vertically upward while the radicle will not show any curvature",
    "option_1_image": "",
    "option_2_text": "radicle will curve towards the ground while the plumule will not show any curvature.",
    "option_2_image": "",
    "option_3_text": "plumule and radicle will not show any curvature.",
    "option_3_image": "",
    "option_4_text": "plumule will curve vertically upwards while the radicle will curve towards the ground",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The lumbar vertebra differs from the thoracic vertebra because it possesses a",
    "option_1_text": "longer neural spine.",
    "option_1_image": "",
    "option_2_text": "wider neural canal.",
    "option_2_image": "",
    "option_3_text": "thicker centrum.",
    "option_3_image": "",
    "option_4_text": "shorter transverse process.",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following blood vessels carries oxygenated blood into the heart?",
    "option_1_text": "Pulmonary artery",
    "option_1_image": "",
    "option_2_text": "Anterior vena cava",
    "option_2_image": "",
    "option_3_text": "Pulmonary vein",
    "option_3_image": "",
    "option_4_text": "Posterior vena cava",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Filtrates in the Bowman's capsule contain vitamins because",
    "option_1_text": "they have low molecular weight.",
    "option_1_image": "",
    "option_2_text": "most of them are fat soluble.",
    "option_2_image": "",
    "option_3_text": "they cannot be reabsorbed into the blood.",
    "option_3_image": "",
    "option_4_text": "little amount is required by the blood.",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The structures that contain grey matter and white matter are found in the",
    "option_1_text": "reproductive system.",
    "option_1_image": "",
    "option_2_text": "nervous system.",
    "option_2_image": "",
    "option_3_text": "respiratory system.",
    "option_3_image": "",
    "option_4_text": "digestive system.",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following events does not occur in the light reaction stage of photosynthesis?",
    "option_1_text": "Which of the following events does not occur in the light reaction stage of photosynthesis?",
    "option_1_image": "",
    "option_2_text": "Carbon (IV) oxide combines with hydrogen",
    "option_2_image": "",
    "option_3_text": "Photolysis of water occurs",
    "option_3_image": "",
    "option_4_text": "Hydroxyl ions are produced",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The rate of photosynthesis decreases in a wilted herbaceous plant because the",
    "option_1_text": "enzymes in the leaf were denatured",
    "option_1_image": "",
    "option_2_text": "chlorophyll in the leaves was not broken down",
    "option_2_image": "",
    "option_3_text": "amount of light reaching the plant was reduced",
    "option_3_image": "",
    "option_4_text": "amount of carbon dioxide entering the leaf decrease.",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The element required for chlorophyll formation in plants is",
    "option_1_text": "Iron",
    "option_1_image": "",
    "option_2_text": "Calcium",
    "option_2_image": "",
    "option_3_text": "Phosphorus",
    "option_3_image": "",
    "option_4_text": "Sulphur",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The process of food digestion in mammals would",
    "option_1_text": "make energy immediately available to the body",
    "option_1_image": "",
    "option_2_text": "promote growth and repair of tissues",
    "option_2_image": "",
    "option_3_text": "provide sufficient food materials within the body",
    "option_3_image": "",
    "option_4_text": "render food substances soluble and absorbable",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following food substances would give a negative reaction with Benedict's reagent?",
    "option_1_text": "Fructose",
    "option_1_image": "",
    "option_2_text": "Glucose",
    "option_2_image": "",
    "option_3_text": "Galactose",
    "option_3_image": "",
    "option_4_text": "Sucrose",
    "option_4_image": "",
    "answer": 4,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Sunlight is the major source of",
    "option_1_text": "Vitamin D",
    "option_1_image": "",
    "option_2_text": "vitamin C",
    "option_2_image": "",
    "option_3_text": "vitamin B",
    "option_3_image": "",
    "option_4_text": "vitamin A",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Discouraging the use of poison to kill fish in a large water body is a way of",
    "option_1_text": "impoverishing the people.",
    "option_1_image": "",
    "option_2_text": "conserving the fish species.",
    "option_2_image": "",
    "option_3_text": "allowing the fittest organism to survive",
    "option_3_image": "",
    "option_4_text": "making the fish adapt to their environment",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The pathway through which nutrient are replenished and circulated in an ecosystem is called a",
    "option_1_text": "cycle",
    "option_1_image": "",
    "option_2_text": "pyramid of energy",
    "option_2_image": "",
    "option_3_text": "pyramid of numbers",
    "option_3_image": "",
    "option_4_text": "Food chain",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The illustration below is a food chain. Study it and answer questions 29 and 30.\nGrasses â†’ Grasshoppers â†’ Lizards â†’ Hawks\nWhich of the following statements is not correct about the food chain? The number of",
    "option_1_text": "grasses eaten by grasshoppers is greater than the number of grasshoppers.",
    "option_1_image": "",
    "option_2_text": "grasses eaten by grasshoppers is fewer than the number of grasshoppers.",
    "option_2_image": "",
    "option_3_text": "grasshoppers eaten by lizards is greater than the number of lizards.",
    "option_3_image": "",
    "option_4_text": "lizards eaten by hawks is greater than the number of hawks.",
    "option_4_image": "",
    "answer": 2,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "If the individual species of organisms in the food chain 1 are counted and arranged as a pyramid, the result would be a pyramid of",
    "option_1_text": "numbers",
    "option_1_image": "",
    "option_2_text": "energy",
    "option_2_image": "",
    "option_3_text": "biomass",
    "option_3_image": "",
    "option_4_text": "biomes",
    "option_4_image": "",
    "answer": 1,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following gases is released during the decomposition of organic matter?",
    "option_1_text": "Carbon(II) oxide",
    "option_1_image": "",
    "option_2_text": "Sulphur (IV) oxide",
    "option_2_image": "",
    "option_3_text": "Hydrogen Sulphide",
    "option_3_image": "",
    "option_4_text": "Nitrous oxide",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A disease vector is an organism that transmits disease-causing pathogens from one host to another. Female Anopheles mosquitoes can carry and transmit the Plasmodium parasite, which causes malaria. When an infected mosquito bites a person, it injects the parasite into the bloodstream, leading to the transmission of the disease.",
    "passage": "",
    "question_text": "Which of the following is an example of a microorganism in action as a disease vector?",
    "option_1_text": "Fungi decomposing dead plant material",
    "option_1_image": "",
    "option_2_text": "Mosquito transmitting malaria",
    "option_2_image": "",
    "option_3_text": "Bacteria causing food poisoning",
    "option_3_image": "",
    "option_4_text": "Algae producing oxygen through photosynthesis",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Irritability, also known as responsiveness or excitability, refers to the ability of cells to detect and respond to various stimuli or changes in their environment.",
    "passage": "",
    "question_text": "Which of the following is a characteristic of cells related to irritability?",
    "option_1_text": "Ability to respond to stimuli",
    "option_1_image": "",
    "option_2_text": "Ability to synthesize proteins",
    "option_2_image": "",
    "option_3_text": "Ability to generate energy",
    "option_3_image": "",
    "option_4_text": "Ability to replicate DNA",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The membrane around the vacuole is known as Tonoplast. The tonoplast is the cytoplasmic membrane surrounding a vacuole, separating the vacuolar contents from the cell's cytoplasm. It is also known as Vacuolar membrane.",
    "passage": "",
    "question_text": "The membrane around the vacuole is known as",
    "option_1_text": "Elaioplast",
    "option_1_image": "",
    "option_2_text": "Amyloplast",
    "option_2_image": "",
    "option_3_text": "Tonoplast",
    "option_3_image": "",
    "option_4_text": "Cytoplast",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "All the options provided are evidence of evolution, which supports the idea that species have evolved and changed over time.",
    "passage": "",
    "question_text": "Which of the following is evidence of evolution?",
    "option_1_text": "All of the above.",
    "option_1_image": "",
    "option_2_text": "Similarities in embryonic development",
    "option_2_image": "",
    "option_3_text": "Fossils of extinct organisms",
    "option_3_image": "",
    "option_4_text": "Homologous structures in different species",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Social insects, such as ants, bees, wasps, and termites, exhibit complex social structures and behaviors that contribute to their survival and success as a colony. ocial insects organize themselves into specialized groups or castes, each with specific roles and functions. These castes can include workers, soldiers, drones, and queens. This division of labor and specialization enhances the efficiency of tasks within the colony, promoting survival and reproductive success.\n\nThere is an explanation video available below.",
    "passage": "",
    "question_text": "Which of the following is an example of an adaptation for survival in social insects?",
    "option_1_text": "Migration to warmer climates",
    "option_1_image": "",
    "option_2_text": "Production of venom for defense",
    "option_2_image": "",
    "option_3_text": "Formation of complex caste systems",
    "option_3_image": "",
    "option_4_text": "Hibernation during winter months",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The alimentary canal, also known as the digestive tract, is a long tube that extends from the mouth to the anus and is responsible for the digestion and absorption of food. The organs that are part of the alimentary canal include the mouth, esophagus, stomach, small intestine, and large intestine. The liver produces bile, which aids in the digestion and absorption of fats, but its location is outside of the alimentary canal.",
    "passage": "",
    "question_text": "Which of the following is NOT a part of the alimentary canal?",
    "option_1_text": "Oesophagus",
    "option_1_image": "",
    "option_2_text": "Large intestine",
    "option_2_image": "",
    "option_3_text": "Liver",
    "option_3_image": "",
    "option_4_text": "Small intestine",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Evolutionary trends generally involve changes that occur over time in a population or species. One commonly observed trend is an increase in genetic diversity within populations. Genetic diversity refers to the variety of genetic traits and variations present within a population. Increased genetic diversity can provide a population with a greater potential to adapt to changes in the environment, as it provides a wider range of genetic material for natural selection to act upon.",
    "passage": "",
    "question_text": "Which of the following is an evolutionary trend commonly observed in organisms?",
    "option_1_text": "Decreased complexity over time",
    "option_1_image": "",
    "option_2_text": "Increased dependence on external resources",
    "option_2_image": "",
    "option_3_text": "Increased genetic diversity within populations",
    "option_3_image": "",
    "option_4_text": "Decreased adaptation to the environment",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Kingdom Plantae is characterized by the presence of chloroplasts. Chloroplasts are the site of photosynthesis in plant cells, where light energy is converted into chemical energy. This is not to say that all organisms with chloroplasts belong to the Plantae kingdom, but it is a common feature of this kingdom.",
    "passage": "",
    "question_text": "Which of the following is a characteristic feature of Kingdom Plantae?",
    "option_1_text": "Presence of chloroplasts",
    "option_1_image": "",
    "option_2_text": "Ability to perform photosynthesis",
    "option_2_image": "",
    "option_3_text": "Lack of cell walls",
    "option_3_image": "",
    "option_4_text": "Heterotrophic mode of nutrition",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A biome characterized by hot summer, warm winter and treeless vegetation is the Steppe grassland. Steppe grasslands are characterized by grassy plains without trees apart from those near rivers and lakes. The summers can be hot, sometimes 40 Â°C (104 Â°F) or more, but winters are cold, with temperatures often falling below freezing.",
    "passage": "",
    "question_text": "A biome characterized by hot summer, warm winter and treeless vegetation is",
    "option_1_text": "Steppe grasslands",
    "option_1_image": "",
    "option_2_text": "Temperate deserts",
    "option_2_image": "",
    "option_3_text": "Savannah grassland",
    "option_3_image": "",
    "option_4_text": "Tropical deserts",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Physiological variation refers to differences in physiological traits or functions among individuals within a species. Blood pressure is a physiological parameter that can vary among individuals based on factors such as genetics, health conditions, lifestyle, and environmental influences. Physiological variation encompasses variations in functions, processes, and internal characteristics of organisms, such as metabolic rates, hormone levels, enzyme activities, blood parameters, and other physiological traits.",
    "passage": "",
    "question_text": "Which of the following is an example of physiological variation in organisms?",
    "option_1_text": "Variation in blood pressure among individuals",
    "option_1_image": "",
    "option_2_text": "Variation in beak shape among finches",
    "option_2_image": "",
    "option_3_text": "Differences in fur color in rabbits",
    "option_3_image": "",
    "option_4_text": "Variation in leaf shape in plants",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The skeletal system in humans is composed of bones and joints. Bones and joints are the primary components of the human skeletal system.",
    "passage": "",
    "question_text": "Which of the following are components of the skeletal system in humans?",
    "option_1_text": "Cartilage and blood vessels",
    "option_1_image": "",
    "option_2_text": "Ligaments and tendons",
    "option_2_image": "",
    "option_3_text": "Muscles and nerves",
    "option_3_image": "",
    "option_4_text": "Bones and joints",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Ecological management and conservation involve strategies and practices aimed at preserving and protecting natural ecosystems and their biodiversity. Among the options provided, the establishment of marine protected areas is an example of such management and conservation through a biological association.",
    "passage": "",
    "question_text": "Which of the following represents an example of ecological management and conservation through a biological association?",
    "option_1_text": "Construction of a dam for hydroelectric power",
    "option_1_image": "",
    "option_2_text": "Introduction of an invasive species for pest control",
    "option_2_image": "",
    "option_3_text": "Clear-cutting of a forest for timber extraction",
    "option_3_image": "",
    "option_4_text": "Establishment of marine protected areas",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The term cell was given by Robert Hooke. The term cell was coined by Robert Hooke. Robert Hooke observed a honeycomb-like structure under the microscope while cutting a thin section of cork, hence he named the structure as a cell.\n\n",
    "passage": "",
    "question_text": "The term cell was given by",
    "option_1_text": "Robert Hooke",
    "option_1_image": "",
    "option_2_text": "Schwann",
    "option_2_image": "",
    "option_3_text": "De Bary",
    "option_3_image": "",
    "option_4_text": "Tatum",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The primary organ involved in gas exchange during respiration in humans is the lungs. The lungs are a pair of respiratory organs located in the chest cavity. They are responsible for the exchange of oxygen and carbon dioxide between the air and the bloodstream.",
    "passage": "",
    "question_text": "Which of the following is the primary organ involved in gas exchange during respiration in humans?",
    "option_1_text": "Diaphragm",
    "option_1_image": "",
    "option_2_text": "Bronchi",
    "option_2_image": "",
    "option_3_text": "Lungs",
    "option_3_image": "",
    "option_4_text": "Trachea",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The pancreas is an organ located in the abdomen, and it serves both digestive and endocrine functions. In terms of hormone production, the pancreas is responsible for producing insulin. Insulin plays a crucial role in regulating blood sugar levels by facilitating the uptake of glucose into cells.",
    "passage": "",
    "question_text": "Which gland is responsible for producing the hormone insulin?",
    "option_1_text": "Thyroid gland",
    "option_1_image": "",
    "option_2_text": "Pituitary gland",
    "option_2_image": "",
    "option_3_text": "Pancreas",
    "option_3_image": "",
    "option_4_text": "Adrenal gland",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Fishes have a swim bladder or air bladder which helps them to remain buoyant without sinking in water. They are present in the body cavity.",
    "passage": "",
    "question_text": "Most fishes do not sink in water because of the presences of:\nI. swim bladder\nII. air bladder\nIII. air sacs\nIV. air in spongy bones",
    "option_1_text": "II and III are correct",
    "option_1_image": "",
    "option_2_text": "I and II are correct",
    "option_2_image": "",
    "option_3_text": "I, II, III and IV are correct",
    "option_3_image": "",
    "option_4_text": "III and IV are correct",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In monohybrid inheritance, the inheritance of a single gene is considered. An organism that carries two different alleles for a particular gene is referred to as heterozygous. The alleles may have different versions or variations of the gene. Heterozygous individuals carry two different alleles, with one being dominant and the other recessive.",
    "passage": "",
    "question_text": "In monohybrid inheritance, if an organism carries two different alleles for a particular gene, it is called:",
    "option_1_text": "Homozygous",
    "option_1_image": "",
    "option_2_text": "Dominant",
    "option_2_image": "",
    "option_3_text": "Heterozygous",
    "option_3_image": "",
    "option_4_text": "Recessive",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The tissue responsible for transporting water and minerals from the roots to the rest of the plant is called xylem. Xylem is a complex tissue composed of specialized cells, such as tracheids and vessel elements, which form long, interconnected tubes. These tubes facilitate the upward movement of water and minerals through the plant. Xylem also provides mechanical support to the plant.",
    "passage": "",
    "question_text": "What is the tissue responsible for transporting water and minerals from the roots to the rest of the plant?",
    "option_1_text": "Xylem",
    "option_1_image": "",
    "option_2_text": "Epidermis",
    "option_2_image": "",
    "option_3_text": "Parenchyma",
    "option_3_image": "",
    "option_4_text": "Phloem",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Abiotic ecological factors are non-living factors that influence an ecosystem. They include physical and chemical factors such as temperature, sunlight, water availability, soil composition, and air quality.",
    "passage": "",
    "question_text": "Which of the following is an example of an abiotic ecological factor?",
    "option_1_text": "Temperature",
    "option_1_image": "",
    "option_2_text": "Competition",
    "option_2_image": "",
    "option_3_text": "Predation",
    "option_3_image": "",
    "option_4_text": "Symbiosis",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Fertilization is the process by which the male and female gametes (reproductive cells) fuse to initiate the development of a new organism.",
    "passage": "",
    "question_text": "Which of the following processes is involved in the reproduction of developing organisms?",
    "option_1_text": "Budding",
    "option_1_image": "",
    "option_2_text": "Germination",
    "option_2_image": "",
    "option_3_text": "Fertilization",
    "option_3_image": "",
    "option_4_text": "Pollination",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Estivation: Certain animals enter a state of estivation, which is similar to hibernation but occurs in response to hot and dry conditions. They become inactive, conserve energy, and reduce water loss during the hottest parts of the day or during extended periods of high temperatures.",
    "passage": "",
    "question_text": "Behavioral adaptation for dealing with a hot climate could include",
    "option_1_text": "Hibernating during the hottest part of the day",
    "option_1_image": "",
    "option_2_text": "Large scales on the back of a lizard",
    "option_2_image": "",
    "option_3_text": "Feeding during the hottest part of the day",
    "option_3_image": "",
    "option_4_text": "A small kidney to conserve wate",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The natural place of an organism or community is known as its habitat. A habitat is an ecological or environmental area that is inhabited by a particular species of animal, plant, or other type of organism. It is the natural environment in which an organism lives, or the physical environment that surrounds a species population.",
    "passage": "",
    "question_text": "The natural place of an organism or community is known as",
    "option_1_text": "Niche",
    "option_1_image": "",
    "option_2_text": "Habit",
    "option_2_image": "",
    "option_3_text": "Biome",
    "option_3_image": "",
    "option_4_text": "Habitat",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Nitrogen fixation is the process in the nutrient cycle that converts atmospheric nitrogen (N2) into a form that plants can utilize, typically ammonium (NH4+) or nitrate (NO3-). This process is carried out by nitrogen-fixing bacteria, which can either be free-living in the soil or form mutualistic relationships with certain plants, such as legumes.",
    "passage": "",
    "question_text": "Which process in the nutrient cycle converts atmospheric nitrogen into a form that plants can utilize?",
    "option_1_text": "Denitrification",
    "option_1_image": "",
    "option_2_text": "Nitrogen fixation",
    "option_2_image": "",
    "option_3_text": "Ammonification",
    "option_3_image": "",
    "option_4_text": "Nitrification",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The skin plays a vital role in maintaining homeostasis by regulating body temperature. When the body becomes too hot, the skin helps to cool it down through processes like sweating and vasodilation.",
    "passage": "",
    "question_text": "Which of the following functions is performed by the skin to help maintain homeostasis in the human body?",
    "option_1_text": "Regulation of body temperature",
    "option_1_image": "",
    "option_2_text": "Filtration of blood",
    "option_2_image": "",
    "option_3_text": "Production of hormones",
    "option_3_image": "",
    "option_4_text": "Digestion of food",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Laterite soil becomes less fertile due to intense leaching caused by tropical rains. Leaching is the process by which nutrients are washed out of the soil by rainfall. In the case of laterite soils, which are common in tropical regions, the heavy rainfall can cause intense leaching, leading to a loss of fertilit",
    "passage": "",
    "question_text": "Which of the following soil types becomes less fertile due to the intense leaching caused by tropical rains?",
    "option_1_text": "Yellow soil",
    "option_1_image": "",
    "option_2_text": "Laterite soil",
    "option_2_image": "",
    "option_3_text": "Red soils",
    "option_3_image": "",
    "option_4_text": "Black soil",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Sexual reproduction involves the fusion of gametes from two parents, typically a male and a female. In this process, specialized cells called gametes (sperm and egg) are produced through meiosis. The fusion of these gametes during fertilization leads to the formation of a zygote, which develops into a new individual with a combination of genetic traits from both parents.",
    "passage": "",
    "question_text": "Which type of reproduction involves the fusion of gametes from two parents?",
    "option_1_text": "Sexual reproduction",
    "option_1_image": "",
    "option_2_text": "Asexual reproduction",
    "option_2_image": "",
    "option_3_text": "Binary fission",
    "option_3_image": "",
    "option_4_text": "Budding",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Nitrogen fixation: This process involves the conversion of atmospheric nitrogen gas (N2) into a usable form, such as ammonium (NH4+), by nitrogen-fixing bacteria or through lightning. This makes nitrogen available for plants and other organisms.\n\nDenitrification: Denitrifying bacteria convert nitrates (NO3-) back into atmospheric nitrogen gas (N2), completing the nitrogen cycle. Denitrification occurs under anaerobic conditions, such as in waterlogged soils or sediments.\n\nAmmonification: Ammonification is the process by which decomposers, like bacteria and fungi, break down organic nitrogen compounds from dead organisms and waste products into ammonium (NH4+). This ammonium can then be used by plants and other organisms.",
    "passage": "",
    "question_text": "Which processes are involved in nutrient cycling in a functioning ecosystem?",
    "option_1_text": "Erosion, weathering, and sedimentation",
    "option_1_image": "",
    "option_2_text": "Decomposition, evaporation, and precipitation",
    "option_2_image": "",
    "option_3_text": "Nitrogen fixation, denitrification, and ammonification",
    "option_3_image": "",
    "option_4_text": "Respiration, photosynthesis, and transpiration",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Autotrophic nutrition refers to the ability of organisms to synthesize their own food molecules from simple inorganic substances such as carbon dioxide and water.\n\n",
    "passage": "",
    "question_text": "What is autotrophic nutrition?",
    "option_1_text": "Nutrition in which organisms obtain food by breaking down complex organic compounds.",
    "option_1_image": "",
    "option_2_text": "Nutrition in which organisms obtain food from other organisms",
    "option_2_image": "",
    "option_3_text": "Nutrition in which organisms obtain food by consuming both plants and animals",
    "option_3_image": "",
    "option_4_text": "Nutrition in which organisms produce their own food using energy from the sun or inorganic substances",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The theory of evolution is a scientific explanation for the diversity of life on Earth. It states that species change over time through a process known as natural selection. This theory, proposed by Charles Darwin and Alfred Russel Wallace in the 19th century, suggests that populations of organisms evolve over generations in response to changes in their environment.",
    "passage": "",
    "question_text": "The theory of evolution can be defined as",
    "option_1_text": "The belief that all species were created in their current form",
    "option_1_image": "",
    "option_2_text": "The hypothesis that organisms strive to improve themselves over generations",
    "option_2_image": "",
    "option_3_text": "The idea that species change over time through natural processes",
    "option_3_image": "",
    "option_4_text": "The concept that evolution occurs through a series of sudden and dramatic changes",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The testis is a male reproductive organ in humans. It is responsible for producing sperm cells and secreting the male sex hormone testosterone. The testes are located within the scrotum, outside the abdominal cavity.",
    "passage": "",
    "question_text": "Which of the following is a male reproductive organ in humans?",
    "option_1_text": "Uterus",
    "option_1_image": "",
    "option_2_text": "Ovary",
    "option_2_image": "",
    "option_3_text": "Testis",
    "option_3_image": "",
    "option_4_text": "Fallopian tube",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Migration is an example of a behavioral adaptation for survival in animals. Migration refers to the regular movement of animals from one place to another, often over long distances. Animals may migrate to find better food sources, suitable breeding grounds, or more favorable climates.",
    "passage": "",
    "question_text": "Which of the following is an example of a behavioral adaptation for survival in animals?",
    "option_1_text": "Sharp teeth",
    "option_1_image": "",
    "option_2_text": "Migration",
    "option_2_image": "",
    "option_3_text": "Wings",
    "option_3_image": "",
    "option_4_text": "Camouflage",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "People with Down syndrome always have intellectual or physical disabilities. High muscle tone is not visible in a person with Down syndrome",
    "passage": "",
    "question_text": "Which of the following traits is not visible in a person with Down syndrome?",
    "option_1_text": "Short neck",
    "option_1_image": "",
    "option_2_text": "High muscle tone",
    "option_2_image": "",
    "option_3_text": "Small stature",
    "option_3_image": "",
    "option_4_text": "Slant eyes",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Population ecology is a branch of ecology that focuses on the study of populations of organisms belonging to the same species. t involves examining how populations are distributed across different habitats and how their numbers change over time.",
    "passage": "",
    "question_text": "What is the definition of population ecology?",
    "option_1_text": "The study of interactions between organisms and their physical environment",
    "option_1_image": "",
    "option_2_text": "The study of evolutionary processes and their effects on populations",
    "option_2_image": "",
    "option_3_text": "The study of interactions between different populations in an ecosystem",
    "option_3_image": "",
    "option_4_text": "The study of the distribution and abundance of individuals within a species",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Carrying capacity refers to the maximum number of individuals of a species that a particular environment can sustain over a prolonged period of time. It represents the balance between the available resources in the environment and the population's demand for those resources.",
    "passage": "",
    "question_text": "What is the term used to describe the maximum number of individuals of a species that an environment can support indefinitely?",
    "option_1_text": "Ecological niche",
    "option_1_image": "",
    "option_2_text": "Limiting factor",
    "option_2_image": "",
    "option_3_text": "Carrying capacity",
    "option_3_image": "",
    "option_4_text": "Density-dependent factor",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The heart is a vital organ in the circulatory system responsible for pumping and circulating blood throughout the body.",
    "passage": "",
    "question_text": "Which of the following statements about the heart is true?",
    "option_1_text": "The heart is responsible for the production of red blood cells",
    "option_1_image": "",
    "option_2_text": "The heart pumps oxygenated blood to the lungs",
    "option_2_image": "",
    "option_3_text": "The heart receives blood from the kidneys and filters waste products",
    "option_3_image": "",
    "option_4_text": "The heart is a muscular organ that contracts to circulate blood throughout the body",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The primary source of variation in a population is mutation. Mutation is a spontaneous change in the DNA sequence of an organism's genome. It introduces new genetic variations by altering the existing genetic information.",
    "passage": "",
    "question_text": "What is the primary source of variation in a population?",
    "option_1_text": "Gene flow",
    "option_1_image": "",
    "option_2_text": "Mutation",
    "option_2_image": "",
    "option_3_text": "Natural selection",
    "option_3_image": "",
    "option_4_text": "Genetic drift",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Red blood cells, also known as erythrocytes, are responsible for carrying oxygen to the body tissues. They contain a protein called hemoglobin, which binds to oxygen in the lungs and transports it to other parts of the body.",
    "passage": "",
    "question_text": "Which component of blood is responsible for carrying oxygen to the body tissues?",
    "option_1_text": "Platelets",
    "option_1_image": "",
    "option_2_text": "White blood cells",
    "option_2_image": "",
    "option_3_text": "Red blood cells",
    "option_3_image": "",
    "option_4_text": "Plasma",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The primary products of photosynthesis are glucose and oxygen. During photosynthesis, plants use sunlight, water, and carbon dioxide to produce glucose, a simple sugar that serves as the main source of energy for the plant. Oxygen is also produced as a byproduct of photosynthesis and is released into the atmosphere.",
    "passage": "",
    "question_text": "What are the primary products of photosynthesis?",
    "option_1_text": "Carbon dioxide and water",
    "option_1_image": "",
    "option_2_text": "Glucose and oxygen",
    "option_2_image": "",
    "option_3_text": "Glucose and carbon dioxide",
    "option_3_image": "",
    "option_4_text": "Oxygen and water",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In genetics, an allele is one of two or more versions of a gene that are found at the same place on a chromosome. Alleles can come in different versions, with each version bringing about different phenotypic traits. For example, a gene for flower color may have one allele that produces red flowers and another allele that produces white flowers. Therefore, the alternate form of a gene is an allele",
    "passage": "",
    "question_text": "The alternate form of a gene is",
    "option_1_text": "Alternate type",
    "option_1_image": "",
    "option_2_text": "Dominant character",
    "option_2_image": "",
    "option_3_text": "Recessive character",
    "option_3_image": "",
    "option_4_text": "Allele",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The alimentary canal, also known as the gastrointestinal tract, is a long, continuous tube that extends from the mouth to the anus. It is responsible for the digestion and absorption of nutrients.\nOesophagus: The esophagus is a muscular tube that connects the mouth to the stomach.\nSmall intestine: The small intestine is the longest part of the alimentary canal and is divided into three sections: duodenum, jejunum, and ileum.\n\nAlimentary Canal: This includes the organs that form a continuous passage from the mouth to the anus, such as: Mouth, Oesophagus, Stomach, Small intestine, Large intestine, Appendix, Rectum, and Anus\n\n \n",
    "passage": "",
    "question_text": "Which organs are part of the alimentary canal in the human digestive system?",
    "option_1_text": "Salivary glands, tongue, and pharynx",
    "option_1_image": "",
    "option_2_text": "Large intestine, appendix, and rectum",
    "option_2_image": "",
    "option_3_text": "Stomach, liver, and gallbladder",
    "option_3_image": "",
    "option_4_text": "Oesophagus, pancreas, and small intestine",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Arthropods are characterized by the presence of a segmented body. This is a key characteristic of the phylum Arthropoda, which includes insects, spiders, and crustaceans. The other options are incorrect. Arthropods do not exhibit radial symmetry, they have an open circulatory system, and their exoskeleton is made of chitin, not bones.",
    "passage": "",
    "question_text": "Which of the following characteristics is typical of the phylum Arthropoda?",
    "option_1_text": "Radial symmetry",
    "option_1_image": "",
    "option_2_text": "Closed circulatory system",
    "option_2_image": "",
    "option_3_text": "Endoskeleton made of bones",
    "option_3_image": "",
    "option_4_text": "Presence of a segmented body",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Implementing sustainable fishing practices is an example of conserving resources in an ecosystem. It identifies a practice that helps in preserving and maintaining the fish populations and the overall health of aquatic ecosystems.",
    "passage": "",
    "question_text": "Which of the following is an example of conserving resources in an ecosystem",
    "option_1_text": "Excessive use of chemical fertilizers in agriculture",
    "option_1_image": "",
    "option_2_text": "Introducing invasive species to an ecosystem",
    "option_2_image": "",
    "option_3_text": "Implementing sustainable fishing practices",
    "option_3_image": "",
    "option_4_text": "Cutting down trees for timber production",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The correct hierarchical organization of life from the smallest to the largest scale is as follows: cells, tissues, organs, organisms, populations, communities, ecosystems.",
    "passage": "",
    "question_text": "Which of the following represents the correct hierarchical organization of life from the smallest to the largest scale?",
    "option_1_text": "Organs, tissues, cells, organisms, populations, communities, ecosystems",
    "option_1_image": "",
    "option_2_text": "Cells, organs, tissues, organisms, populations, communities, ecosystems",
    "option_2_image": "",
    "option_3_text": "Tissues, organs, cells, organisms, populations, communities, ecosystems",
    "option_3_image": "",
    "option_4_text": "Cells, tissues, organs, organisms, populations, communities, ecosystems",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Arteries are blood vessels that carry oxygenated blood away from the heart to various parts of the body.",
    "passage": "",
    "question_text": "Which of the following blood vessels carries oxygenated blood away from the heart?",
    "option_1_text": "Arteries",
    "option_1_image": "",
    "option_2_text": "Venules",
    "option_2_image": "",
    "option_3_text": "Capillaries",
    "option_3_image": "",
    "option_4_text": "Veins",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Temperature primarily affects the distribution of organisms in an ecosystem. Temperature is a crucial factor that influences the survival, growth, and reproductive capabilities of organisms. Different species have specific temperature requirements and tolerance ranges",
    "passage": "",
    "question_text": "Which of the following factors primarily affects the distribution of organisms in an ecosystem",
    "option_1_text": "Wind speed",
    "option_1_image": "",
    "option_2_text": "Soil pH",
    "option_2_image": "",
    "option_3_text": "Temperature",
    "option_3_image": "",
    "option_4_text": "Day length",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Sporulation is a method of reproduction observed in some groups of organisms, such as fungi and certain types of protists. It involves the formation and release of spores, which are specialized reproductive structures that can develop into new individuals under suitable conditions. Sporulation is not a method of reproduction in animals.",
    "passage": "",
    "question_text": "Which of the following is NOT a method of reproduction in animals?",
    "option_1_text": "Asexual reproduction",
    "option_1_image": "",
    "option_2_text": "Budding",
    "option_2_image": "",
    "option_3_text": "Sexual reproduction",
    "option_3_image": "",
    "option_4_text": "Sporulation",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The correct statement about the kingdom Fungi is that fungi obtain nutrients by absorbing organic matter. Fungi are heterotrophic organisms, meaning they cannot synthesize their own organic compounds. Instead, they secrete enzymes to break down organic matter in their surroundings, such as decaying plants or dead animals, and absorb the resulting nutrients.\n\n",
    "passage": "",
    "question_text": "Which of the following statements is true about the kingdom Fungi?",
    "option_1_text": "Fungi obtain nutrients by absorbing organic matter",
    "option_1_image": "",
    "option_2_text": "Fungi are photosynthetic organisms",
    "option_2_image": "",
    "option_3_text": "Fungi are multicellular organisms",
    "option_3_image": "",
    "option_4_text": "Fungi reproduce through the formation of seeds",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Viviparity is a reproductive strategy in which offspring develop and are nourished inside the female's body until they are ready to be born. Viviparity is commonly observed in various organisms, including mammals, some reptiles, and certain fish species. In viviparous species, the developing offspring receive nutrients and oxygen directly from the mother through specialized structures such as a placenta or other nutrient-transfer organs.",
    "passage": "",
    "question_text": "Viviparity refers to the reproductive strategy in which",
    "option_1_text": "Offspring are produced by internal fertilization",
    "option_1_image": "",
    "option_2_text": "Offspring are produced by external fertilization",
    "option_2_image": "",
    "option_3_text": "Offspring develop and are nourished inside the female's body",
    "option_3_image": "",
    "option_4_text": "Offspring develop and are nourished outside the female's body",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The most inclusive level of classification in the Linnaean system is the kingdom.",
    "passage": "",
    "question_text": "Which of the following is the most inclusive level of classification in the Linnaean system?",
    "option_1_text": "Kingdom",
    "option_1_image": "",
    "option_2_text": "Phylum",
    "option_2_image": "",
    "option_3_text": "Domain",
    "option_3_image": "",
    "option_4_text": "Class",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Genetics is the field of biology that studies the inheritance of traits from parents to offspring. Genetics encompasses various concepts and principles, including the study of genes, DNA, chromosomes, genetic inheritance patterns, genetic mutations, and genetic variations.",
    "passage": "",
    "question_text": "Which of the following describes the inheritance of traits from parents to offspring?",
    "option_1_text": "Adaptation",
    "option_1_image": "",
    "option_2_text": "Evolution",
    "option_2_image": "",
    "option_3_text": "Natural selection",
    "option_3_image": "",
    "option_4_text": "Genetics",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "When individuals within a population compete for limited resources such as food, water, or mates, those individuals with favorable traits that enhance their ability to acquire resources are more likely to survive and reproduce.",
    "passage": "",
    "question_text": "Which of the following statements best describes the role of competition in the process of adaptation?",
    "option_1_text": "Competition leads to the selection of individuals with favorable traits for survival and reproduction",
    "option_1_image": "",
    "option_2_text": "Competition ensures equal distribution of resources among individuals in a population",
    "option_2_image": "",
    "option_3_text": "Competition leads to the development of new traits and adaptations in a population",
    "option_3_image": "",
    "option_4_text": "Competition reduces the need for adaptations as individuals coexist peacefully",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Sex-linked traits are traits that are determined by genes located on the sex chromosomes (X and Y chromosomes in humans).",
    "passage": "",
    "question_text": "Which of the following statements is true regarding sex-linked traits?",
    "option_1_text": "Sex-linked traits are located on the sex chromosomes",
    "option_1_image": "",
    "option_2_text": "Sex-linked traits are inherited only from the mother",
    "option_2_image": "",
    "option_3_text": "Sex-linked traits are more commonly observed in females",
    "option_3_image": "",
    "option_4_text": "Sex-linked traits are not influenced by hormonal factors",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Gibberellins are plant hormones that play a significant role in promoting cell elongation and growth.",
    "passage": "",
    "question_text": "Which of the following is a plant hormone responsible for promoting cell elongation and growth?",
    "option_1_text": "Abscisic acid",
    "option_1_image": "",
    "option_2_text": "Gibberellins",
    "option_2_image": "",
    "option_3_text": "Ethylene",
    "option_3_image": "",
    "option_4_text": "Cytokinins",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Industrial discharge refers to the release of pollutants, such as chemicals, heavy metals, and wastewater, from industrial activities into water bodies. This is a primary source of pollution in aquatic ecosystems. Industries generate various pollutants that are often released into nearby water bodies, leading to water pollution and adverse effects on aquatic organisms and ecosystems.",
    "passage": "",
    "question_text": "Which of the following is a primary source of pollution in aquatic ecosystems?",
    "option_1_text": "Soil erosion",
    "option_1_image": "",
    "option_2_text": "Industrial discharge",
    "option_2_image": "",
    "option_3_text": "Air pollution",
    "option_3_image": "",
    "option_4_text": "Deforestation",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The mechanism responsible for providing support in plants is the combination of cell walls and turgor pressure. In plants, the cell walls, composed of cellulose, provide structural support to the cells and tissues. They give rigidity and strength to plant cells, enabling them to maintain their shape and resist external forces. Additionally, turgor pressure, which is the pressure exerted by the cell contents against the cell walls, helps maintain the overall rigidity and upright form of plants.",
    "passage": "",
    "question_text": "Which of the following mechanisms is responsible for providing support in plants?",
    "option_1_text": "Muscles and bones",
    "option_1_image": "",
    "option_2_text": "Exoskeleton",
    "option_2_image": "",
    "option_3_text": "Endocrine system",
    "option_3_image": "",
    "option_4_text": "Cell walls and turgor pressure",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Metamorphosis is commonly observed in certain animal groups, such as insects (e.g., butterflies, beetles) and amphibians (e.g., frogs, salamanders). It involves a dramatic change in body form and structure as an organism progresses through distinct stages of its life cycle. These stages may include egg, larval, pupal, and adult phases.\n\n",
    "passage": "",
    "question_text": "Metamorphosis is a biological process that involves",
    "option_1_text": "The growth and development of an organism from a zygote to an adult",
    "option_1_image": "",
    "option_2_text": "The change in form and structure during the life cycle of certain organisms",
    "option_2_image": "",
    "option_3_text": "The regeneration of lost body parts in an organism",
    "option_3_image": "",
    "option_4_text": "The transformation of an organism from an adult stage to a larval stage",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "\nThe kidneys are primarily responsible for excretion in humans. The kidneys are the major excretory organs in humans. They filter waste products, excess ions, and water from the blood to produce urine, which is then eliminated from the body.\n\n",
    "passage": "",
    "question_text": "Which of the following organs is primarily responsible for excretion in humans?",
    "option_1_text": "Liver",
    "option_1_image": "",
    "option_2_text": "Pancreas",
    "option_2_image": "",
    "option_3_text": "Kidneys",
    "option_3_image": "",
    "option_4_text": "Lungs",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The kidneys are primarily responsible for excretion in humans. The kidneys are the major excretory organs in humans. They filter waste products, excess ions, and water from the blood to produce urine, which is then eliminated from the body.\n\n",
    "passage": "",
    "question_text": "Which of the following is the correct classification of carbohydrates?",
    "option_1_text": "Lipid",
    "option_1_image": "",
    "option_2_text": "Phytonutrient",
    "option_2_image": "",
    "option_3_text": "Macronutrient",
    "option_3_image": "",
    "option_4_text": "Micronutrient",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Myopia, also known as nearsightedness, is an eye defect characterized by the inability of the eye to focus light on the retina. Myopia is characterized by the ability to see nearby objects clearly while distant objects appear blurred. It occurs when the eyeball is elongated or the cornea is too curved, causing the incoming light to focus in front of the retina instead of directly on it.",
    "passage": "",
    "question_text": "Which of the following eye defects is caused by the inability of the eye to focus light on the retina?",
    "option_1_text": "Glaucoma",
    "option_1_image": "",
    "option_2_text": "Myopia",
    "option_2_image": "",
    "option_3_text": "Cataracts",
    "option_3_image": "",
    "option_4_text": "Astigmatism",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Germination refers to the process by which a seed breaks dormancy and starts to grow into a new plant. Germination occurs when a seed is exposed to favorable environmental conditions, including proper moisture, oxygen availability, and suitable temperature.",
    "passage": "",
    "question_text": "Germination is the process in which a seed",
    "option_1_text": "Begins to photosynthesize",
    "option_1_image": "",
    "option_2_text": "Develops into a mature plant",
    "option_2_image": "",
    "option_3_text": "Absorbs nutrients from the soil",
    "option_3_image": "",
    "option_4_text": "Breaks dormancy and starts to grow",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The statement that is true regarding sexual reproduction in organisms is that it involves the fusion of gametes from two parents, resulting in offspring with genetic variation. Sexual reproduction involves the production of haploid gametes (sperm and eggs) by two parents, which then fuse during fertilization to form a genetically diverse offspring.",
    "passage": "",
    "question_text": "Which of the following statements is true regarding sexual reproduction in organisms?",
    "option_1_text": "It involves the fusion of gametes from two parents, resulting in offspring with genetic variation",
    "option_1_image": "",
    "option_2_text": "It involves the production of offspring through a single parent, resulting in genetically identical offspring",
    "option_2_image": "",
    "option_3_text": "It is a form of asexual reproduction where offspring are produced without the involvement of gametes",
    "option_3_image": "",
    "option_4_text": "It does not involve the formation of gametes or the fusion of reproductive cells",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Vegetative propagation is a method of asexual reproduction in plants. It refers to the production of new plants from vegetative structures, such as stems, leaves, or roots, without the involvement of seeds or spores. This method allows plants to produce genetically identical offspring to the parent plant.",
    "passage": "",
    "question_text": "Which of the following is a method of asexual reproduction in plants?",
    "option_1_text": "Pollination",
    "option_1_image": "",
    "option_2_text": "Vegetative propagation",
    "option_2_image": "",
    "option_3_text": "Seed dispersal",
    "option_3_image": "",
    "option_4_text": "Fertilization",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Xylem is the plant tissue responsible for transporting water and nutrients from the roots to the rest of the plant.",
    "passage": "",
    "question_text": "Which of the following plant tissues is responsible for transporting water and nutrients from the roots to the rest of the plant?",
    "option_1_text": "Mesophyll",
    "option_1_image": "",
    "option_2_text": "Xylem",
    "option_2_image": "",
    "option_3_text": "Epidermis",
    "option_3_image": "",
    "option_4_text": "Phloem",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The statement that best describes courtship behaviors in animals is that they involve displays and rituals performed by both males and females to attract a mate. Courtship behaviors play a crucial role in mate selection and reproductive success in many animal species. They involve a variety of displays, rituals, vocalizations, dances, or other behaviors that serve to communicate sexual receptivity, readiness, and attractiveness.\n\n",
    "passage": "",
    "question_text": "Which of the following statements best describes courtship behaviors in animals?",
    "option_1_text": "Courtship behaviors are solely performed by males to establish dominance within a social group",
    "option_1_image": "",
    "option_2_text": "Courtship behaviors involve displays and rituals performed by both males and females to attract a mate",
    "option_2_image": "",
    "option_3_text": "Courtship behaviors are primarily performed by females to attract males for mating",
    "option_3_image": "",
    "option_4_text": "Courtship behaviors are aggressive interactions between males competing for a female mate",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Physiological variation in biology refers to the variations in the physiological processes and functions of organisms. Physiological variation encompasses the variations in the internal processes and functions of organisms, including metabolic processes, hormone regulation, immune responses, cellular functions, and physiological adaptations.",
    "passage": "",
    "question_text": "Which of the following best describes physiological variation in biology?",
    "option_1_text": "Variations in the physiological processes and functions of organisms",
    "option_1_image": "",
    "option_2_text": "Differences in physical characteristics and appearance within a population",
    "option_2_image": "",
    "option_3_text": "Differences in behavior and social interactions among individuals",
    "option_3_image": "",
    "option_4_text": "Variations in the genetic makeup of individuals within a species",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The correct identification of excretory organs in animals is lungs, kidneys, and skin.\nLungs play a vital role in excretion by eliminating carbon dioxide, a waste product of cellular respiration, through exhalation.\nKidneys are major excretory organs responsible for filtering blood and removing metabolic wastes, excess water, and dissolved solutes in the form of urine.\nSkin, although primarily a protective organ, also participates in excretion. Sweating, through sweat glands in the skin, helps regulate body temperature and eliminates small amounts of metabolic waste such as urea and salts.\n\n",
    "passage": "",
    "question_text": "Which of the following options correctly identifies excretory organs in animals?",
    "option_1_text": "Stomach, intestines, and bladder",
    "option_1_image": "",
    "option_2_text": "Lungs, kidneys, and skin",
    "option_2_image": "",
    "option_3_text": "Brain, spinal cord, and nerves",
    "option_3_image": "",
    "option_4_text": "Heart, liver, and spleen",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The concept of trophic levels in a functioning ecosystem refers to the levels of energy flow within the ecosystem. Trophic levels represent the hierarchical structure of feeding relationships within an ecosystem, with each level representing a different position in the food chain.",
    "passage": "",
    "question_text": "Which of the following best describes the concept of trophic levels in a functioning ecosystem?",
    "option_1_text": "The levels of ecological interactions within an ecosystem",
    "option_1_image": "",
    "option_2_text": "The levels of energy flow within an ecosystem",
    "option_2_image": "",
    "option_3_text": "The levels of nutrient cycling within an ecosystem",
    "option_3_image": "",
    "option_4_text": "The levels of biological diversity within an ecosystem",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Pollination in plants refers to the transfer of pollen from the anther (male reproductive organ) to the stigma (female reproductive organ) of a flower.",
    "passage": "",
    "question_text": "Which of the following statements best describes pollination in plants?",
    "option_1_text": "Pollination is the process of transferring pollen from the stigma to the anther of a flower",
    "option_1_image": "",
    "option_2_text": "Pollination is the process of transferring pollen from the anther to the stigma of a flower",
    "option_2_image": "",
    "option_3_text": "Pollination is the process of releasing pollen into the air for dispersal",
    "option_3_image": "",
    "option_4_text": "Pollination is the process of seed formation within a flower",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A natural habitat in ecology refers to an area where organisms naturally live and interact with their surroundings. A natural habitat encompasses the ecological conditions, physical features, and resources that support the survival and interactions of organisms within their natural environment. It includes factors such as climate, vegetation, soil composition, and other biotic and abiotic components.",
    "passage": "",
    "question_text": "Which of the following best describes a natural habitat in ecology?",
    "option_1_text": "An area where organisms naturally live and interact with their surroundings",
    "option_1_image": "",
    "option_2_text": "A human-created environment for wildlife conservation",
    "option_2_image": "",
    "option_3_text": "A controlled laboratory setting for ecological experiments",
    "option_3_image": "",
    "option_4_text": "A protected area for endangered species",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Viruses are considered parasitic because they require a host cell to replicate. They do this by injecting their genetic material into the host cell and using the cell's machinery to replicate.",
    "passage": "",
    "question_text": "Which of the following statements about viruses is true?",
    "option_1_text": "Viruses can reproduce outside of a host cell",
    "option_1_image": "",
    "option_2_text": "Viruses require a host cell to replicate",
    "option_2_image": "",
    "option_3_text": "Viruses possess a cellular structure",
    "option_3_image": "",
    "option_4_text": "Viruses are living organisms",
    "option_4_image": "",
    "answer": 2,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cell growth refers to an increase in cell size or mass over time. Cell growth occurs by cell division, as cells undergo division to increase their numbers and contribute to overall growth in tissues and organisms.",
    "passage": "",
    "question_text": "Which of the following statements is true regarding cell growth?",
    "option_1_text": "Cell growth is solely influenced by external factors",
    "option_1_image": "",
    "option_2_text": "Cell growth is a continuous process throughout the life of a cell",
    "option_2_image": "",
    "option_3_text": "Cell growth involves an increase in the number of organelles within a cell",
    "option_3_image": "",
    "option_4_text": "Cell growth occurs by cell division",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The urinary tubule, a part of the nephron in the kidney, is indeed responsible for the production of urine. It does this by reabsorbing useful substances from the filtrate, such as glucose and ions, and secreting waste products into it. The modified filtrate, now called urine, is then passed on to the bladder for storage and eventual excretion.\n\n \n",
    "passage": "",
    "question_text": "Which of the following statements is true regarding the urinary tubule in the excretory system?",
    "option_1_text": "The urinary tubule is responsible for the production of urine",
    "option_1_image": "",
    "option_2_text": "The urinary tubule regulates the water and electrolyte balance in the body",
    "option_2_image": "",
    "option_3_text": "The urinary tubule connects the kidneys to the bladder",
    "option_3_image": "",
    "option_4_text": "The urinary tubule is the site of filtration of blood",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The liver is a vital organ in the human body with multiple functions, but its primary function is the detoxification and metabolism of nutrients and drugs. The liver plays a crucial role in various metabolic processes. It detoxifies harmful substances, such as drugs and toxins, by breaking them down into less harmful forms that can be eliminated from the body.",
    "passage": "",
    "question_text": "What is the primary function of the liver in the human body?",
    "option_1_text": "Regulation of body temperature",
    "option_1_image": "",
    "option_2_text": "Regulation of blood pressure",
    "option_2_image": "",
    "option_3_text": "Production of hormones",
    "option_3_image": "",
    "option_4_text": "Detoxification and metabolism of nutrients and drugs",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Ecological succession can be primary or secondary. Primary succession occurs in areas where no previous community existed, such as on bare rock or after a volcanic eruption. Secondary succession occurs in areas where a previous community has been disturbed, such as after a forest fire or human disturbance. Throughout the succession process, the community gradually changes in terms of species composition, population sizes, and community interactions, leading to a more stable and mature ecosystem.",
    "passage": "",
    "question_text": "Ecological succession refers to",
    "option_1_text": "The movement of organisms from one habitat to another",
    "option_1_image": "",
    "option_2_text": "The competition among species for limited resources",
    "option_2_image": "",
    "option_3_text": "The process of natural selection in a population",
    "option_3_image": "",
    "option_4_text": "The gradual and predictable change in a community over time",
    "option_4_image": "",
    "answer": 4,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The statement that best describes adaptation for survival in organisms is that it is the inherited trait that increases an organism's chances of survival and reproduction in its environment. It refers to the process by which populations of organisms evolve and become better suited to their environment over time.",
    "passage": "",
    "question_text": "Which of the following options best describes adaptation for survival in organisms?",
    "option_1_text": "Adaptation is the inherited trait that increases an organism's chances of survival and reproduction in its environment",
    "option_1_image": "",
    "option_2_text": "Adaptation is the process by which organisms acquire new characteristics during their lifetime",
    "option_2_image": "",
    "option_3_text": "Adaptation refers to the ability of an organism to change its environment to better suit its needs",
    "option_3_image": "",
    "option_4_text": "Adaptation involves the development of new traits in response to changes in the environment",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Digestive enzymes play a vital role in the process of digestion by breaking down food into smaller molecules that can be easily absorbed and utilized by the body. Digestive enzymes are produced by various organs in the digestive system, including the salivary glands, stomach, pancreas, and small intestine.\n\n ",
    "passage": "",
    "question_text": "Digestive enzymes are responsible for",
    "option_1_text": "Breaking down food into smaller molecules",
    "option_1_image": "",
    "option_2_text": "Absorbing nutrients into the bloodstream",
    "option_2_image": "",
    "option_3_text": "Regulating the pH of the digestive tract",
    "option_3_image": "",
    "option_4_text": "Transporting food through the digestive system",
    "option_4_image": "",
    "answer": 1,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "One of the main differences between plant and animal cells is that plant cells contain chloroplasts for photosynthesis, while animal cells do not. However, plant cells contain chloroplasts, which are organelles responsible for photosynthesis, enabling plants to convert sunlight into energy-rich molecules. Animal cells lack chloroplasts and obtain energy through other means, such as consuming organic matter",
    "passage": "",
    "question_text": "Which of the following is a difference between plant and animal cells?",
    "option_1_text": "Plant cells have a nucleus, while animal cells do not",
    "option_1_image": "",
    "option_2_text": "Plant cells have a cell membrane, while animal cells have a cell wall",
    "option_2_image": "",
    "option_3_text": "Plant cells contain chloroplasts for photosynthesis, while animal cells do not",
    "option_3_image": "",
    "option_4_text": "Plant cells have a central vacuole, while animal cells have multiple small vacuoles",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The cochlea is a spiral-shaped structure in the inner ear that is filled with fluid and lined with cells with very fine hairs. These hairs move when the fluid in the cochlea moves, thereby converting sound vibrations into nerve signals that the brain can interpret. Therefore, the correct answer is 'Cochlea.' The eardrum and ossicles help to transmit sound vibrations to the cochlea, but it is the cochlea that transmits these vibrations as signals to the auditory nerve.",
    "passage": "",
    "question_text": "Which of the following structures in the ear is responsible for transmitting sound vibrations to the auditory nerve?",
    "option_1_text": "Eardrum",
    "option_1_image": "",
    "option_2_text": "Ossicles",
    "option_2_image": "",
    "option_3_text": "Cochlea",
    "option_3_image": "",
    "option_4_text": "Auditory canal",
    "option_4_image": "",
    "answer": 3,
    "year": 2023
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Household combustion devices, motor vehicles, industrial facilities and forest fires are common sources of air pollution. Pollutants of major public health concern include particulate matter, carbon monoxide, ozone, nitrogen dioxide and sulfur dioxide.",
    "passage": "",
    "question_text": "sources of air pollutants are?",
    "option_1_text": "industrial chimneys, burning fossil oils and river dams",
    "option_1_image": "",
    "option_2_text": "sulphurdioxide, acid rain and pesticides",
    "option_2_image": "",
    "option_3_text": "sulphur dioxide, vehicle exhausts, and aerosols",
    "option_3_image": "",
    "option_4_text": "sewage,smoke and old vehicles",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A snail's body consists of these main parts â€“ the head, the visceral hump, and the foot",
    "passage": "",
    "question_text": "The body of a snail is divided into head?",
    "option_1_text": "thorax and abdomen",
    "option_1_image": "",
    "option_2_text": "visceral mass and abdomen",
    "option_2_image": "",
    "option_3_text": "thorax and foot",
    "option_3_image": "",
    "option_4_text": "visceral mass and foot",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The porcupine fish has spines on its body. The fish sucks in water and swells up to make the spines stick out. This transforms it from a small mouthful into an uneatable ball of prickly spines. Its flesh also contains a deadly poison as an extra defense.",
    "passage": "",
    "question_text": "An adaptation for defense in animals is?",
    "option_1_text": "croaking of a male toad",
    "option_1_image": "",
    "option_2_text": "basking in lizard",
    "option_2_image": "",
    "option_3_text": "spines in porcupine fish",
    "option_3_image": "",
    "option_4_text": "huddling together of penguins",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "taxis (tactic movement) A change in direction of locomotion in a motile micro-organism or cell, made in response to certain types of external stimulus",
    "passage": "",
    "question_text": "The movement of Euglena towards the source of light is a?",
    "option_1_text": "tropic movement",
    "option_1_image": "",
    "option_2_text": "tactic movement",
    "option_2_image": "",
    "option_3_text": "nastic movement",
    "option_3_image": "",
    "option_4_text": "kinetic movement",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Mitosis is understood to involve five phases, based on the physical state of the chromosomes and spindle. These phases are prophase, prometaphase, metaphase, anaphase, and telophase.\n\nMetaphase is the third phase of mitosis, which is a process that separates the duplicated genetic material carried in the nucleus of a parent cell into two, identical daughter cells",
    "passage": "",
    "question_text": "During mitosis, the stage at which chromosomes lines up around the equator is?",
    "option_1_text": "telophase",
    "option_1_image": "",
    "option_2_text": "metasphase",
    "option_2_image": "",
    "option_3_text": "anaphase",
    "option_3_image": "",
    "option_4_text": "prophase",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Most terrestrial insects produce uric acid as their main nitrogenous waste product. Uric acid is a relatively non- toxic and highly insoluble waste product.",
    "passage": "",
    "question_text": "The waste product of insects is?",
    "option_1_text": "uric acid",
    "option_1_image": "",
    "option_2_text": "urine",
    "option_2_image": "",
    "option_3_text": "Mucilage",
    "option_3_image": "",
    "option_4_text": "sweat",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Succession can be defined as a progressive natural development of vegetation towards a climax during which one community is gradually replaced by others. The abandoned farmland is a secondary succession as a result of the fact that it follows a partial destruction of the original vegetation.",
    "passage": "",
    "question_text": "Succession that occurs on an abandoned farm land is?",
    "option_1_text": "tertiary",
    "option_1_image": "",
    "option_2_text": "secondary",
    "option_2_image": "",
    "option_3_text": "primary",
    "option_3_image": "",
    "option_4_text": "climax",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Southern Guinea Savanna occurs in parts of Oyo, Ondo, Osun and Kwara states.",
    "passage": "",
    "question_text": "In Nigeria, Southern Guinea Savanna is found in?",
    "option_1_text": "Borno and Sokoto",
    "option_1_image": "",
    "option_2_text": "Kogi and Kwara",
    "option_2_image": "",
    "option_3_text": "Kaduna and Cross River",
    "option_3_image": "",
    "option_4_text": "Kano and Niger",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Dark stage, also known as biosynthetic or assimilatory, is the second stage in photosynthesis;\n\nin this stage, a cluster of reactions; solar light is not needed and converts carbon dioxide â€“ among other complexes  into sugars.\n\nsome enzymes are involved in carbon assimilation process depend on solar light.",
    "passage": "",
    "question_text": "Which of the following is associated with the dark stage of photosynthesis?",
    "option_1_text": "Assimilation of Carbon(IV)oxide",
    "option_1_image": "",
    "option_2_text": "Photophosphorylation",
    "option_2_image": "",
    "option_3_text": "Photolysis",
    "option_3_image": "",
    "option_4_text": "Excitation of chlorophyll",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Sweat glands are used to regulate temperature and remove waste by secreting water, sodium salts, and nitrogenous waste (such as urea) onto the skin surface.",
    "passage": "",
    "question_text": "The part of mammalian skin that excretes metabolic wastes is?",
    "option_1_text": "sweat gland",
    "option_1_image": "",
    "option_2_text": "horny layer",
    "option_2_image": "",
    "option_3_text": "Malpighian layer",
    "option_3_image": "",
    "option_4_text": "sebaceous gland",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Cows are not immune to ticks and thanks to their hairy hides, ticks love to attack herds of cattle. Feeding off their host's blood supply, ticks spend their lives on animals of all kinds, including cows. Ticks can even transmit potentially fatal diseases to cows through their bites.\n\nThe cattle tick is considered to be the most important parasite of livestock worldwide ",
    "passage": "",
    "question_text": "The feeding relationship that exists between a tick and a cow is?",
    "option_1_text": "parasitism",
    "option_1_image": "",
    "option_2_text": "mechanism",
    "option_2_image": "",
    "option_3_text": "saprophytism",
    "option_3_image": "",
    "option_4_text": "commensalism",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "An aggregate fruit is a fruit that develops from the merger of several ovaries that were separated in a single flower.",
    "passage": "",
    "question_text": "The type of fruit that is formed from a single flower having several free carpels is?",
    "option_1_text": "indehiscent fruit",
    "option_1_image": "",
    "option_2_text": "aggregate fruit",
    "option_2_image": "",
    "option_3_text": "simple fruit",
    "option_3_image": "",
    "option_4_text": "fleshy fruit",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Urethra â€” this is a tube that extends from the bladder to the external opening at the end of the penis. The urethra carries both urine and sperm.",
    "passage": "",
    "question_text": "The part that performs urinogenital function in the male reproductive system is the?",
    "option_1_text": "seminal vesacle",
    "option_1_image": "",
    "option_2_text": "epididymis",
    "option_2_image": "",
    "option_3_text": "urethra",
    "option_3_image": "",
    "option_4_text": "ureter",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "It has four main components: plasma, red blood cells, white blood cells, and platelets.\n\nBlood has many different functions, including: transporting oxygen and nutrients to the lungs and tissues",
    "passage": "",
    "question_text": "The components of blood in man are?",
    "option_1_text": "red blood cells, white blood cells, plasma and water",
    "option_1_image": "",
    "option_2_text": "red blood cells, white blood cells, and plasma",
    "option_2_image": "",
    "option_3_text": "red blood cells, white blood cells, and platelets",
    "option_3_image": "",
    "option_4_text": "red blood cells, white blood cells, plasma and platelets",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Acquired traits include things such as calluses on fingers, larger muscle size from exercise or from avoiding predators",
    "passage": "",
    "question_text": "he development of big muscles by a wrestler is an example of?",
    "option_1_text": "acquired characteristics",
    "option_1_image": "",
    "option_2_text": "inherited characteristics",
    "option_2_image": "",
    "option_3_text": "mutation",
    "option_3_image": "",
    "option_4_text": "atrophication",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Red blood cells are microscopic and have the shape of a flat disk or doughnut, which is round with an indentation in the center, but it isn't hollow.\n\nRed blood cells don't have a nucleus like white blood cells, allowing them to change shape and move throughout your body easier.",
    "passage": "",
    "question_text": "Lack of nucleus is a feature in?",
    "option_1_text": "osteocyte",
    "option_1_image": "",
    "option_2_text": "neurone",
    "option_2_image": "",
    "option_3_text": "erythrocyte",
    "option_3_image": "",
    "option_4_text": "leucocyte",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Blood donors with type O- (O negative) red blood cells are referred to as universal donors and their red blood cells can be given to any other blood type.\n\nType AB-positive blood is called the \"universal recipient\" type because a person who has it can receive blood of any type.",
    "passage": "",
    "question_text": "A universal recipient of blood belongs to blood group?",
    "option_1_text": "O",
    "option_1_image": "",
    "option_2_text": "AB",
    "option_2_image": "",
    "option_3_text": "B",
    "option_3_image": "",
    "option_4_text": "A",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The spongy mesophyll's function is to allow for the interchange of gases (CO 2) that are needed for photosynthesis. ",
    "passage": "",
    "question_text": "The internal structure of a leaf that has larger air space is?",
    "option_1_text": "palisade mesophyll",
    "option_1_image": "",
    "option_2_text": "epidermis",
    "option_2_image": "",
    "option_3_text": "spongy mesophyll",
    "option_3_image": "",
    "option_4_text": "vascular bundles",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Arboreal animals are those animals that spend most of their life on trees. They feed, travel, play, and sleep on trees.\n\n1. Koalas Â· 2. Black spider monkeys Â· 3. Siamang Gibbon Â· 4. Three-toed Sloth Â· 5. squirrel Â· 6. Rough green snake Â· 7. Veiled Chameleons Â· 8. Common brown lemurs.",
    "passage": "",
    "question_text": "An example of arboreal animal is?",
    "option_1_text": "squirrels",
    "option_1_image": "",
    "option_2_text": "duck",
    "option_2_image": "",
    "option_3_text": "pig",
    "option_3_image": "",
    "option_4_text": "rat",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Translocation is the movement of materials in plants from the leaves to other parts of the plant.\n\nNutrients, mainly sugars, are created in the leaves during photosynthesis. These are then transported throughout the plant through phloem, which are a long series of connected cells.",
    "passage": "",
    "question_text": "The movement of sugars from the leaf to other parts of plant is?",
    "option_1_text": "guttation",
    "option_1_image": "",
    "option_2_text": "transpiration",
    "option_2_image": "",
    "option_3_text": "transportation",
    "option_3_image": "",
    "option_4_text": "translocation",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In simple organisms, such as cnidarians and flatworms, every cell in the body is close to the external environment.\n\nTheir cells are kept moist and gases diffuse quickly via direct diffusion. Flatworms are small, literally flat worms, which â€œbreatheâ€ through diffusion across the outer membrane.\n\nAnnelids have a closed circulatory system; the blood is entirely contained in vessels. \n\nAnnelids have no lungs, although many species have simple gills.",
    "passage": "",
    "question_text": "Gaseous exchange in annelids is more advanced and efficient compared to flatworms because?",
    "option_1_text": "the cells of their epidermis have no blood capillaries",
    "option_1_image": "",
    "option_2_text": "they have well developed respiratory structures",
    "option_2_image": "",
    "option_3_text": "their cylindrical shape gives high surface area to volume ratio",
    "option_3_image": "",
    "option_4_text": "their surface area to volume ratio is very low",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Centromeres are chromosomal regions that mediate kinetochore assembly and spindle attachment during cell division",
    "passage": "",
    "question_text": "The structure that joins the two strands of a chromosome together is the?",
    "option_1_text": "spindle",
    "option_1_image": "",
    "option_2_text": "cellulose",
    "option_2_image": "",
    "option_3_text": "centromere",
    "option_3_image": "",
    "option_4_text": "chromatid",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "If a woman is colorblind, that means she has the nonworking gene on both X chromosomes.\n\nSince sons almost always get their only X chromosome from their mom, chances are they will be colorblind too",
    "passage": "",
    "question_text": "When a colour blind woman marries a normal man, what is the probability of their son being colour blind?",
    "option_1_text": "25%",
    "option_1_image": "",
    "option_2_text": "100%",
    "option_2_image": "",
    "option_3_text": "50%",
    "option_3_image": "",
    "option_4_text": "0.00%",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Arteries carry blood away from the heart and veins carry blood back to the heart.\n\nArteries transport blood away from the heart and branch into smaller vessels, forming arterioles. Arterioles distribute blood to capillary beds, the sites of exchange with the body tissues. Capillaries lead back to small vessels known as venules that flow into the larger veins and eventually back to the heart.",
    "passage": "",
    "question_text": "The correct pathway for blood flow from the heart to the tissues of mammals is?",
    "option_1_text": "heart-arteriole-artery-tissues",
    "option_1_image": "",
    "option_2_text": "heart-artery-arteriole-tissues",
    "option_2_image": "",
    "option_3_text": "heart-vein-venule-tissues",
    "option_3_image": "",
    "option_4_text": "heart-venule-vein-tissues",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Rainforest trees are quite different from trees of temperate forests. In the rainforest, trees grow to gigantic size, supported by strong, strut-like buttresses at the base of the trunk that help to stabilize them in shallow forest soils. Huge creepers twine themselves around the trunks of trees.",
    "passage": "",
    "question_text": "Tall trees with buttress roots and evergreen leaves are characteristics features of?",
    "option_1_text": "temperate grass land",
    "option_1_image": "",
    "option_2_text": "Southern Guinea Savanna",
    "option_2_image": "",
    "option_3_text": "Southern Guinea Savanna",
    "option_3_image": "",
    "option_4_text": "Northern Guinea savanna",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Specifically, meiosis creates new combinations of genetic material in each of the four daughter cells.\n\nThese new combinations result from the exchange of DNA between paired chromosomes. Such exchange means that the gametes produced through meiosis exhibit an amazing range of genetic variation.",
    "passage": "",
    "question_text": "The genes crossing over occurs during?",
    "option_1_text": "fertilization",
    "option_1_image": "",
    "option_2_text": "mutation",
    "option_2_image": "",
    "option_3_text": "mitosis",
    "option_3_image": "",
    "option_4_text": "meiosis",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "AS and AS should not marry, there is every chance of having a child with SS. AS and SS\n\nAA marries an AS. You'll end up with kids with AA and AS which is good.",
    "passage": "",
    "question_text": "In genetic counseling, a man with hemoglobin formation HbA HbS is most preferred to marry a woman of?",
    "option_1_text": "HbA HbA",
    "option_1_image": "",
    "option_2_text": "HbC HbH",
    "option_2_image": "",
    "option_3_text": "HbM HbF",
    "option_3_image": "",
    "option_4_text": "HbS HbS",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Wind direction is usually measured using a wind vane. ",
    "passage": "",
    "question_text": "An ecological instrument used to measure wind direction is?",
    "option_1_text": "Secchi disc",
    "option_1_image": "",
    "option_2_text": "wind vane",
    "option_2_image": "",
    "option_3_text": "anemometer",
    "option_3_image": "",
    "option_4_text": "slope gauge",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Bread mold is saprophytic, as are most types of fungi.\n\nAn organism that is saprophytic is one that feeds off of dead or decaying.",
    "passage": "",
    "question_text": "The growth of mucor on a piece of bread is?",
    "option_1_text": "scavenging",
    "option_1_image": "",
    "option_2_text": "commensalism",
    "option_2_image": "",
    "option_3_text": "autotrophism",
    "option_3_image": "",
    "option_4_text": "saprophytism",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "As photosynthetic organisms, plants take up atmospheric CO2, chemically reducing the carbon.\n\nThis represents not only an acquisition of stored chemical energy for the plant, but also provides the carbon skeletons for the organic molecules that make up a plants' structure.",
    "passage": "",
    "question_text": "Conversion of atmosphere carbon into chemical bond energy occurs during the process of?",
    "option_1_text": "transpiration",
    "option_1_image": "",
    "option_2_text": "photosynthesis",
    "option_2_image": "",
    "option_3_text": "digestion",
    "option_3_image": "",
    "option_4_text": "respiration",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Tail wagging, bright colors, mouth gaping/display, inflation, body posture, head bobs and 'push-ups' (some animals are capable of changing color to attract mates) are some displays that allow lizards to send signals to translate to a potential mate",
    "passage": "",
    "question_text": "The display of male agama lizard is to?",
    "option_1_text": "scare predators",
    "option_1_image": "",
    "option_2_text": "regulate body temperature",
    "option_2_image": "",
    "option_3_text": "attract female for mate",
    "option_3_image": "",
    "option_4_text": "give invite to intruders",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The final product of carbohydrate digestion is primarily glucose along with some fructose, glucose, and galactose, while amino acids are the end products of protein digestion",
    "passage": "",
    "question_text": "The end product of the digestion of carbohydrate is?",
    "option_1_text": "amino acid",
    "option_1_image": "",
    "option_2_text": "glycerol",
    "option_2_image": "",
    "option_3_text": "glucose",
    "option_3_image": "",
    "option_4_text": "sucrose",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Phenotype refers to an individual's observable traits, such as height, eye color and blood type.\n\nA person's phenotype is determined by both their genomic makeup (genotype) and environmental factors.\n\n",
    "passage": "",
    "question_text": "The sum total of all observable features of an organism is?",
    "option_1_text": "phenotype",
    "option_1_image": "",
    "option_2_text": "heterozygous",
    "option_2_image": "",
    "option_3_text": "genotype",
    "option_3_image": "",
    "option_4_text": "homozygous",
    "option_4_image": "",
    "answer": 1,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The limbs of crocodiles, birds, whales, horses, bats and humans all look very different they share the same five fingered bone structure.\n\nThis provides evidence for the theory of evolution .",
    "passage": "",
    "question_text": "Pentadactyl plan of the fore limbs of frog, bird, horse, whale and man is a proof of?",
    "option_1_text": "spontaneous generation",
    "option_1_image": "",
    "option_2_text": "evolution",
    "option_2_image": "",
    "option_3_text": "locomotion",
    "option_3_image": "",
    "option_4_text": "creation",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Congenital hypothyroidism, previously known as cretinism, is a severe deficiency of thyroid hormone in newborns.\n\nIt causes impaired neurological function, stunted growth, and physical deformities",
    "passage": "",
    "question_text": "The under secretion of thyroxine in children results in?",
    "option_1_text": "goitre",
    "option_1_image": "",
    "option_2_text": "gigantism",
    "option_2_image": "",
    "option_3_text": "kwashiorkor",
    "option_3_image": "",
    "option_4_text": "cretinism",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "They typically function as protection for the flower in bud, and often as support for the petals when in bloom.",
    "passage": "",
    "question_text": "petaloid sepals serve the function of?",
    "option_1_text": "carrying out photosynthesis",
    "option_1_image": "",
    "option_2_text": "attracting pollinating agents to a flower",
    "option_2_image": "",
    "option_3_text": "retaining pollen grains in the corolla tubes",
    "option_3_image": "",
    "option_4_text": "protecting the inner floral parts of the flower",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Carolus Linnaeus is the father of taxonomy, which is the system of classifying and naming organisms.\n\nOne of his contributions was the development of a hierarchical system of classification of nature.\n\nToday, this system includes eight taxa: domain, kingdom, phylum, class, order, family, genus, and species.\n\n",
    "passage": "",
    "question_text": "The system of classification in which there are seven hierarchies from kingdom to species was introduced by?",
    "option_1_text": "Felix Dujardin",
    "option_1_image": "",
    "option_2_text": "Carolus Linneus",
    "option_2_image": "",
    "option_3_text": "Theodore Schwann",
    "option_3_image": "",
    "option_4_text": "Charles Darwin",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The hump present in the camel helps them travel long periods without water to survive in the desert's harsh conditions.\n\nThus the hump acts as a fat reserve or an energy reserve.",
    "passage": "",
    "question_text": "An adaptive feature of camel to the desert is?",
    "option_1_text": "ability to increase sweat production",
    "option_1_image": "",
    "option_2_text": "ability to pass high amount of urine",
    "option_2_image": "",
    "option_3_text": "ability to tolerate low degree of dehydration",
    "option_3_image": "",
    "option_4_text": "ability to tolerate high degree of dehydration",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "q259.jpeg",
    "explanation_image": "",
    "explanation_text": "Similar cytoplasmic bridges link the cells of all volvocacean embryos.\n\nI.e neighboring cells are often joined together by strands of cytoplasm.",
    "passage": "",
    "question_text": "The part labelled II is?",
    "option_1_text": "pellicle",
    "option_1_image": "",
    "option_2_text": "cytoplasmic connections",
    "option_2_image": "",
    "option_3_text": "flagella",
    "option_3_image": "",
    "option_4_text": "cells",
    "option_4_image": "",
    "answer": 2,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "q260.jpeg",
    "explanation_image": "",
    "explanation_text": "Volvox is a polyphyletic genus of chlorophyte green algae in the family Volvocaceae. It forms spherical colonies of up to 50,000 cells.\n\nIts plant body is coenobium and consists of large number of biflagellate, pear-shaped cells.\n\n",
    "passage": "",
    "question_text": "The organism above is?",
    "option_1_text": "chlamydomonas",
    "option_1_image": "",
    "option_2_text": "algae",
    "option_2_image": "",
    "option_3_text": "volvox",
    "option_3_image": "",
    "option_4_text": "euglena",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "q261.jpeg",
    "explanation_image": "",
    "explanation_text": "The beaks of nectar sucking birds are long slender and pointed.\n\nThis helps in sucking nectar and also feeding insects and food to the young ones.\n\nBirds like Hummingbirds have this kind of beaks.",
    "passage": "",
    "question_text": "The beak structure of the organism is best adapted for?",
    "option_1_text": "pecking grass",
    "option_1_image": "",
    "option_2_text": "killing and picking fish",
    "option_2_image": "",
    "option_3_text": "pecking woods",
    "option_3_image": "",
    "option_4_text": "sucking nectars",
    "option_4_image": "",
    "answer": 4,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The water activates special proteins, called enzymes, that begin the process of seed growth. ",
    "passage": "",
    "question_text": "One of the functions of water in seed germination is to?",
    "option_1_text": "dilute the embryo",
    "option_1_image": "",
    "option_2_text": "make the soil wet and soft",
    "option_2_image": "",
    "option_3_text": "activate the enzymes",
    "option_3_image": "",
    "option_4_text": "promote aerobic respiration",
    "option_4_image": "",
    "answer": 3,
    "year": 2022
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "xylem, plant vascular tissue that conveys water and dissolved minerals from the roots to the rest of the plant and also provides physical support.",
    "passage": "",
    "question_text": "One of the functions of the xylem is?",
    "option_1_text": "strengthening the stem",
    "option_1_image": "",
    "option_2_text": "manufacturing food",
    "option_2_image": "",
    "option_3_text": "reducing loss of water",
    "option_3_image": "",
    "option_4_text": "conducting manufactured food",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Wind-pollinated flowers:\n\nNo bright colors, special odors, or nectar.\nSmall.\nMost have no petals.\nStamens and stigmas exposed to air currents.\nLarge amount of pollen.\nPollen smooth, light, easily airborne.\nStigma feathery to catch pollen from wind.",
    "passage": "",
    "question_text": "Which of the statements below is not characteristic of wind-pollinated flowers?",
    "option_1_text": "Stigmas are usually large and feathery",
    "option_1_image": "",
    "option_2_text": "Stigmas are usually large and feathery",
    "option_2_image": "",
    "option_3_text": "The pollen grains have rough spiny surfaces",
    "option_3_image": "",
    "option_4_text": "The flowers are not scented.",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "cold-blooded ness;\nThe teeth of reptiles are also less specialized in function than are mammalian teeth.\na dry skin with scales but not feathers (a characteristic of birds) or hair (a characteristic of mammals);\nNB: Birds do not have teeth, although they may have ridges on their bills that help them grip food.\n\n       Birds swallow their food whole, and their gizzard (a muscular part of their stomach) grinds up the food so they can digest it.",
    "passage": "",
    "question_text": "Some of the features of an animal are scales, teeth, nares, and backbone. The animal is likely to be a?",
    "option_1_text": "toad",
    "option_1_image": "",
    "option_2_text": "bird",
    "option_2_image": "",
    "option_3_text": "lizard",
    "option_3_image": "",
    "option_4_text": "rat",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The functional group in a food chain include:\n\nPrimary producer â†’ Primary consumer â†’ Secondary consumer\n\nGrass, grasshopper, toad, snake, hawk",
    "passage": "",
    "question_text": "Choose the sequence which represents the correct order of organisms in a food chain",
    "option_1_text": "Grass, snake, toad, grasshopper, hawk",
    "option_1_image": "",
    "option_2_text": "Grass, grasshopper, toad, snake, hawk",
    "option_2_image": "",
    "option_3_text": "Grass, grasshopper, snake, toad, hawk.",
    "option_3_image": "",
    "option_4_text": "Grass, snake, grasshopper, toad, hawk",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "- The most familiar invertebrates include the Protozoa, Porifera, Coelenterata, Platyhelminthes, Nematoda, Annelida, Echinodermata, Mollusca and Arthropoda.\n\n- Invertebrates are animals that neither possess nor develop a vertebral column, derived from the notochord.",
    "passage": "",
    "question_text": "Flatworms and roundworms are said to be invertebrates because?",
    "option_1_text": "they are small animals",
    "option_1_image": "",
    "option_2_text": "they can live inside the vertebrates",
    "option_2_image": "",
    "option_3_text": "some of them are unicellular",
    "option_3_image": "",
    "option_4_text": "they have no backbones",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Exosmosis is the movement of water outside the cells when a cell is placed in a hypertonic solution.\n\nThe cell becomes flaccid by the movement of water outside.",
    "passage": "",
    "question_text": "When a Spirogyra cell is immersed in a salt solution more concentrated than its cell sap, it?",
    "option_1_text": "remains unchanged",
    "option_1_image": "",
    "option_2_text": "takes tip water and burst",
    "option_2_image": "",
    "option_3_text": "absorbs a little water",
    "option_3_image": "",
    "option_4_text": "loses water and shrivels",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Air Pollutants\n\nCarbon Monoxide.\nLead.\nNitrogen Oxides.\nOzone.\nParticulate Matter.\nSulfur Dioxide.\nOther Air Pollutants.\nThe primary pollutants of concern in land and soil are heavy metals, such as lead, mercury and others, pesticides and other persistent organic pollutants, and pharmaceuticals, such as antibiotics used for livestock management.\n\nNitrogen (N), nonmetallic element of Group 15 [Va] of the periodic table.\n\nIt is a colourless, odourless, tasteless gas that is the most plentiful element in Earth's atmosphere and is a constituent of all living matter.",
    "passage": "",
    "question_text": "Which of the following is NOT regarded as a pollutant on land or in the air?",
    "option_1_text": "Smoke",
    "option_1_image": "",
    "option_2_text": "Nitrogen",
    "option_2_image": "",
    "option_3_text": "Noise",
    "option_3_image": "",
    "option_4_text": "Sulphur dioxide",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Percentage of water content (retained) = Waterabsorbed/Weightofsoilâˆ—100\n \n\nâ†’ 50âˆ’35/50*100\n\n= 30%",
    "passage": "",
    "question_text": "The initial volume of water poured into a bag of dry soil was 50ml and the amount that drained through was 35mI. The percentage water content of the fully soaked soil is therefore?",
    "option_1_text": "46.7",
    "option_1_image": "",
    "option_2_text": "25",
    "option_2_image": "",
    "option_3_text": "20",
    "option_3_image": "",
    "option_4_text": "3000.00%",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "When the queen dies, production of the blocking pheromone stops, and secondary reproductives may be produced.\n\nIn the Reticulitermes species, the queen and king may be replaced by numerous secondary reproductives, and the colony may become very large with the added productivity of many queens.",
    "passage": "",
    "question_text": "When the original king and queen of termites die, they are replaced by",
    "option_1_text": "the king and queen of another colony",
    "option_1_image": "",
    "option_2_text": "some adult reproductives from the same colony",
    "option_2_image": "",
    "option_3_text": "some adult workers which are specially fed to breed",
    "option_3_image": "",
    "option_4_text": "developing nymphs nurtured as secondary reproductives",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Always use a completely opaque water storage tank - Algae uses photosynthesis to reproduce ",
    "passage": "",
    "question_text": "In demonstrating the importance of mineral elements in plants, the culture bottle must be darkened to?",
    "option_1_text": "prevent algal growth in culture solution",
    "option_1_image": "",
    "option_2_text": "allow root growth",
    "option_2_image": "",
    "option_3_text": "prevent breakdown of mineral elements",
    "option_3_image": "",
    "option_4_text": "prevents photosynthesis in the root",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The alveoli are where the lungs and the blood exchange oxygen and carbon dioxide during the process of breathing in and breathing out.",
    "passage": "",
    "question_text": "In the mammalian respiratory system. exchange of gases occurs in the?",
    "option_1_text": "lungs",
    "option_1_image": "",
    "option_2_text": "bronchi",
    "option_2_image": "",
    "option_3_text": "bronchioles",
    "option_3_image": "",
    "option_4_text": "alveoli",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Together with the spleen, the liver breaks down worn out red blood cells (erythrocytes)",
    "passage": "",
    "question_text": "Aged erythrocytes are destroyed in the?",
    "option_1_text": "pancreas",
    "option_1_image": "",
    "option_2_text": "liver",
    "option_2_image": "",
    "option_3_text": "lymph nodes",
    "option_3_image": "",
    "option_4_text": "kidney",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The villi of the small intestine project into the intestinal cavity, greatly increasing the surface area for food absorption and adding digestive secretions.",
    "passage": "",
    "question_text": "The villus in the small intestine is significant because it?",
    "option_1_text": "increases the surface area for absorption",
    "option_1_image": "",
    "option_2_text": "increases the surface area for digestion",
    "option_2_image": "",
    "option_3_text": "assists in mixing digested food",
    "option_3_image": "",
    "option_4_text": "assists in filtering undigested food",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In lab, we used Benedict's reagent to test for one particular reducing sugar: glucose. \n\nBenedict's reagent starts out aqua-blue. As it is heated in the presence of reducing sugars, it turns yellow to orange.",
    "passage": "",
    "question_text": "Which of the following food substances will produce a brick-red colour when warmed with Benedict's solution?",
    "option_1_text": "Glucose",
    "option_1_image": "",
    "option_2_text": "Starch",
    "option_2_image": "",
    "option_3_text": "Egg White",
    "option_3_image": "",
    "option_4_text": "Maltose",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The portal vein or hepatic portal vein (HPV) is a blood vessel that carries blood from the gastrointestinal tract, gall bladder, pancreas, and spleen to the liver.\n\nThis blood contains nutrients and toxins extracted from digested contents. ",
    "passage": "",
    "question_text": "The blood vessel which carries blood from the alimentary canal to the liver is the?",
    "option_1_text": "hepatic artery",
    "option_1_image": "",
    "option_2_text": "hepatic vein",
    "option_2_image": "",
    "option_3_text": "hepatic portal vein",
    "option_3_image": "",
    "option_4_text": "mesenteric artery",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In Paramecium, Conjugation is a form of sexual reproduction. It is a temporary union of two individuals of same species for mutual exchange of genetic materials.\n\nThrough a process called conjugation, two paramecia line up side by side and then fuse together.\n\nThe two paramecium separate and go on their way in their watery environment.\n\nThey begin again to produce multiple copies of themselves through asexual fission.\n\nDuring sexual reproduction, the micronuclei of each paramecium undergo meiosis, ultimately halving the genetic content to create a haploid nucleus.\n\nThese are exchanged between the two connected mates.\n\nThe haploid nuclei from each mate fuse to create a new, genetically varied, micronucleus.",
    "passage": "",
    "question_text": "Which of the following is TRUE of the process of conjugation in Paramecium?",
    "option_1_text": "Micronucleus disintegrates",
    "option_1_image": "",
    "option_2_text": "Each ex-conjugant divides only once",
    "option_2_image": "",
    "option_3_text": "Macro nucleus undergoes division",
    "option_3_image": "",
    "option_4_text": "Each micronucleus divides twice",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "It's discovered that tetraethyl lead (better known as lead) provided octane to gasoline, to fix knocking or pinging in engines that could damage them and waste gasoline.\n\nExtremely high lead levels can lead to seizures, coma, and death.",
    "passage": "",
    "question_text": "People who suck petrol with their mouths run the risk of increasing in their blood the concentration of",
    "option_1_text": "iron",
    "option_1_image": "",
    "option_2_text": "lead",
    "option_2_image": "",
    "option_3_text": "calcium",
    "option_3_image": "",
    "option_4_text": "magnesium",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Schistosomiasis, also known as bilharzia or 'snail fever', is a disease caused by parasites (worms called schistosomes) carried by freshwater snails.\n\nSchistosomiasis control focuses on reducing disease through periodic, large-scale population treatment with medication;\n\na more comprehensive approach including potable water, adequate sanitation, and snail control would also reduce transmission.",
    "passage": "",
    "question_text": "Which of the following is a measure for the control of bilharzia?",
    "option_1_text": "Cutting low bushes around homes",
    "option_1_image": "",
    "option_2_text": "Application of molluscicides in water bodies",
    "option_2_image": "",
    "option_3_text": "Screening windows and doors with mosquito nets",
    "option_3_image": "",
    "option_4_text": "Application of herbicides in water bodies",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The appendicular skeleton includes the bones of the shoulder girdle, the upper limbs, the pelvic girdle, and the lower limbs.",
    "passage": "",
    "question_text": "The appendicular skeleton is composed of the pectoral girdle?",
    "option_1_text": "pelvic girdle, fore and hind limbs",
    "option_1_image": "",
    "option_2_text": "pelvic girdle and fore limbs",
    "option_2_image": "",
    "option_3_text": "lumbar vertebrae and pelvic girdle",
    "option_3_image": "",
    "option_4_text": "lumbar vertebrae, fore and hind limbs",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Aerenchyma is found in hydrophytes like  water lily.\n\nThis tissue encloses air and provides buoyancy to the plant parts",
    "passage": "",
    "question_text": "A freshwater plant such as water lily can solve the problem of buoyancy by the possession of?",
    "option_1_text": "aerenchyma tissues",
    "option_1_image": "",
    "option_2_text": "dissected leaves",
    "option_2_image": "",
    "option_3_text": "thin cell walls of the epidermis",
    "option_3_image": "",
    "option_4_text": "water-repelling epidermis",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "In mammals(humans), the process of olfaction begins when volatile molecules enter the nasal cavity and activate receptors in the olfactory epithelium (OE). The olfactory receptor (OR) proteins are located in hair-like projections of the olfactory sensory neurons (OSNs).",
    "passage": "",
    "question_text": "The correct sequence for the perception of smell in mammals is?",
    "option_1_text": "chemicals --> olfactory nerve endings --> brain",
    "option_1_image": "",
    "option_2_text": "dissolved chemicals --> nasal sensory cells --> brain",
    "option_2_image": "",
    "option_3_text": "chemicals --> mucus membrane sensory cells --> brain",
    "option_3_image": "",
    "option_4_text": "dissolved chemicals --> sensory cells --> olfactory nerve --> brain",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Low mortality rate, high birth rate, high immigration rate and low emigration rate are causes for rapid over-crowding.",
    "passage": "",
    "question_text": "I. High birth rate and high immigration rate\nII. Low birth rate and high immigration rate\nIII. Low mortality rate and low emigration rate\nIV. High mortality rate and high emigration rate.\nWhich combination of the above can cause rapid over-crowding in climax biotic communities and human settlements?",
    "option_1_text": "II and III",
    "option_1_image": "",
    "option_2_text": "I and III",
    "option_2_image": "",
    "option_3_text": "I and IV",
    "option_3_image": "",
    "option_4_text": "I and II",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "No of  Imperata spp = 23\n\nTotal plant species = 50\n\n\nPercentage of imperata spp = 2350âˆ—100â„…\n\n= 46â„…",
    "passage": "",
    "question_text": "The number of plant species obtained from a population study of a garden is as follows: Guinea grass (15), Ipomoea spp (5), Sida spp (7) and Imperata spp (23)\n\nWhat is the percentage of occurrence of Imperata spp?",
    "option_1_text": "35%",
    "option_1_image": "",
    "option_2_text": "16%",
    "option_2_image": "",
    "option_3_text": "46%",
    "option_3_image": "",
    "option_4_text": "23.00%",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Saltwater fish can't survive in freshwater because their bodies are highly concentrated of salt solution (too much for freshwater). The water would flow into their body until all their cells accumulate so much water that they bloat and die eventually.\n\n",
    "passage": "",
    "question_text": "When a marine fish was taken from the ocean and put in a tank of fresh water, it died after a short period because?",
    "option_1_text": "the tank was too small compared to the large-ocean",
    "option_1_image": "",
    "option_2_text": "the body cells of the fish swelled and burst as a result of the hypotonic fresh water",
    "option_2_image": "",
    "option_3_text": "the body cells of the fish shrank as their sap was hypertonic to the freshwater",
    "option_3_image": "",
    "option_4_text": "there was no food in the tank, so the fish starved",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The complementary strand for TCA is AGT\n\nA\tT\nG\tC\nT\tA\nC\tG\nA\tT\nT\tA\nG\tC\nA\tT\n ",
    "passage": "",
    "question_text": "If a DNA strand has a base sequence TCA, its complementary strand must be?",
    "option_1_text": "ATG",
    "option_1_image": "",
    "option_2_text": "TAG",
    "option_2_image": "",
    "option_3_text": "GAT",
    "option_3_image": "",
    "option_4_text": "AGT",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The Naâº / Kâº - helps maintain resting potential, affects transport, and regulates cellular volume.",
    "passage": "",
    "question_text": "The two key cations involved in the action potential of nervous transmissions are?",
    "option_1_text": "Na+ and Fe2+",
    "option_1_image": "",
    "option_2_text": "Mg2+ and K+",
    "option_2_image": "",
    "option_3_text": "Na+ and K+",
    "option_3_image": "",
    "option_4_text": "Fe2+ and Mg2+",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Evolutionary sequence in vertebrates: Fishes â†’ Amphibians â†’ Reptiles â†’ Birds â†’ Mammals.\n\nIV â†’ III â†’ II â†’ I",
    "passage": "",
    "question_text": "I. Rattus rattus. Il. Agama agama III. Bufo regularis IV. Tilapia zillii\nThe order of evolutionary advancement of the above vertebrates is?",
    "option_1_text": "I, II, III, IV",
    "option_1_image": "",
    "option_2_text": "I, IV, III, II",
    "option_2_image": "",
    "option_3_text": "II, III, IV, I",
    "option_3_image": "",
    "option_4_text": "IV, III, II, I",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The pancreas has two main functions: an exocrine function that helps in digestion and an endocrine function that regulates blood sugar.",
    "passage": "",
    "question_text": "Which of the following produces both hormones and enzymes?",
    "option_1_text": "Ileum",
    "option_1_image": "",
    "option_2_text": "Pancreas",
    "option_2_image": "",
    "option_3_text": "Gall bladder",
    "option_3_image": "",
    "option_4_text": "Kidney",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The kidneys filter unwanted substances from the blood and produce urine to excrete them.\n\nThere are three main steps of urine formation: glomerular filtration, reabsorption, and tubular secretion.\n\nThese processes ensure that only waste and excess water are removed from the body.",
    "passage": "",
    "question_text": "The correct sequence of the movement of urea during urine formation is?",
    "option_1_text": "glomerulus ---> Bowman's capsule -> convoluted tubule ---> Henle's loop -> collecting- tubule",
    "option_1_image": "",
    "option_2_text": "glomerulus -> Bowman's capsule -> convoluted tubule -> Henle's loop -> convoluted tubule -> collecting tubule",
    "option_2_image": "",
    "option_3_text": "convoluted tubule -> glomerulus --> Nettle's loop -> Bowman's capsule->collecting tubule",
    "option_3_image": "",
    "option_4_text": "convoluted tubule -> Bowman's capsule -> Henle's loop -7> glomerulus -> collecting tubule",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The order of passage of food in the digestive system is",
    "option_1_text": "ileum --> caecum ->large intestine -> rectum",
    "option_1_image": "",
    "option_2_text": "ileum --> colon --> caecum -> rectum",
    "option_2_image": "",
    "option_3_text": "large intestine --> ileum -> caecum -> rectum",
    "option_3_image": "",
    "option_4_text": "colon -> caecum -> ileum -> rectum",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Mass of a crucible = 10g,\n\nMass of a crucible and soil before heating =29g\n\nMass of a crucible and soil after heating = 18g\n\nFrom the information above, determine the percentage of water in the given soil sample?",
    "option_1_text": "20%",
    "option_1_image": "",
    "option_2_text": "25%",
    "option_2_image": "",
    "option_3_text": "40%",
    "option_3_image": "",
    "option_4_text": "60.00%",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Stomata allow a plant to take in carbon dioxide, which is needed for photosynthesis. They also help to reduce water loss.\n\nThe alveoli are where the lungs and the blood exchange oxygen and carbon dioxide during the process of breathing in and breathing out.\n\nThe Malpighian tubules are tubular structures that are free floating in the haemolymph and function as excretory and osmoregulatory organs of insects. \n\n Contractile vacuoles (in the cells of the lower organisms) protect a cell from absorbing too much water and potentially exploding by excreting excess water.",
    "passage": "",
    "question_text": "I. Stomata --> Spirogyra\n\nII. Alveoli --> Earthworm\n\nIII. Malpighian tubule -> Mammal\n\nIV. Contractile vacuole -> Protozoa\n\nWhich of the above structures is correctly matched with the organisms in which it is found?",
    "option_1_text": "II",
    "option_1_image": "",
    "option_2_text": "I",
    "option_2_image": "",
    "option_3_text": "IV",
    "option_3_image": "",
    "option_4_text": "III",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Fish exchange gases by pulling oxygen-rich water through their mouths and pumping it over their gills. In some fish, capillary blood flows in the opposite direction to the water, causing counter-current exchange. The gills push the oxygen-poor water out through openings in the sides(opercula) of the pharynx.",
    "passage": "",
    "question_text": "The sequence of the one-way gaseous exchange mechanism in a fish is?",
    "option_1_text": "mouth --> operculum -> gills",
    "option_1_image": "",
    "option_2_text": "mouth -> gills > operculum",
    "option_2_image": "",
    "option_3_text": "operculum > gills -> mouth",
    "option_3_image": "",
    "option_4_text": "gills -> operculum --> mouth",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "People with type AB+ blood are universal recipients because they have no antibodies to A, B or Rh in their blood and can receive red blood cells from a donor of any blood type.\n\n Donors with blood type AB can donate to recipients with blood type AB only.",
    "passage": "",
    "question_text": "Which of the following is true in blood transfusion?",
    "option_1_text": "A person of blood group AB can donate blood only to another person of blood group AB",
    "option_1_image": "",
    "option_2_text": "Persons of blood groups A and B can donate or receive blood from each other",
    "option_2_image": "",
    "option_3_text": "A person of blood group AB can receive blood only from persons of blood group A or B",
    "option_3_image": "",
    "option_4_text": "A person of blood group O can donate only to a person of blood group O",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Plants that live in water and adapt to their environment are known as hydrophytes.\n\nEpiphyte, also called air plant, any plant that grows upon another plant or object merely for physical support.\n\n Plants that grow in dry habitat are called xerophytes.\n\nMesophytes are terrestrial plants which are neither adapted to particularly dry nor particularly wet environments.",
    "passage": "",
    "question_text": "The plants that grow in deserts or very dry areas are referred to as?",
    "option_1_text": "hydrophytes",
    "option_1_image": "",
    "option_2_text": "epiphytes",
    "option_2_image": "",
    "option_3_text": "xerophytes",
    "option_3_image": "",
    "option_4_text": "mesophytes",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The phylum Arthropoda is the largest in the animal kingdom, having its class Insecta as 70% of all known species of animals.",
    "passage": "",
    "question_text": "The most abundant group of organisms in the animal kingdom?",
    "option_1_text": "Mammalia",
    "option_1_image": "",
    "option_2_text": "Aves",
    "option_2_image": "",
    "option_3_text": "Insecta",
    "option_3_image": "",
    "option_4_text": "Annelida",
    "option_4_image": "",
    "answer": 3,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Taxism: oriented movement of a motile organism in response to an external stimulus, as toward or away from light.\n\nA tropism is a biological phenomenon, indicating growth or turning movement of a biological organism, usually a plant, in response to an environmental stimulus.\n\n In tropisms, this response is dependent on the direction of the stimulus.\n\nThe movement or directional growth of plants or plant organs (as the tendrils of climbing plants) in response to the stimulus of touch.\n\nThe non-directional movement (of plants) in response to a stimulus (e.g. humidity, temperature, light irradiance, nutrients, gravity, etc.",
    "passage": "",
    "question_text": "The movement of part of a plant in response to external stimulus of no particular direction is?",
    "option_1_text": "taxism",
    "option_1_image": "",
    "option_2_text": "tropism",
    "option_2_image": "",
    "option_3_text": "haptotropic movement",
    "option_3_image": "",
    "option_4_text": "nastic movement",
    "option_4_image": "",
    "answer": 4,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Gregor Mendel, through his work on pea plants, discovered the fundamental laws of inheritance. \n\n Hugo de Vries (1901) put forward a theory of evolution, called mutation theory. \n\nJean Baptiste Lamarck believed that traits changed or acquired over an individual's lifetime could be passed down to its offspring.\n\nThe Theory of Evolution by natural selection was first formulated in Charles Darwin's book \"On the Origin of Species\" published in 1859.",
    "passage": "",
    "question_text": "The mutation theory of organic evolution was propounded by?",
    "option_1_text": "Gregor Mendel",
    "option_1_image": "",
    "option_2_text": "Hugo de Vries",
    "option_2_image": "",
    "option_3_text": "Jean Lamarck",
    "option_3_image": "",
    "option_4_text": "Charles Darwin",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "q301_e.jpeg",
    "explanation_text": "In genetics, when both parents are heterozygous for a trait (Aa), the possible combinations for their offspring can be AA, Aa, aA, or aa. The probability of an offspring being homozygous recessive (aa) is 1 out of 4, or 1/4. So, the correct answer is '1/4'.\n\nIf both parents are heterozygous for a trait, the probability that an offspring will be recessive for that trait is 25%. When both parents are heterozygous (meaning they carry both the dominant and recessive alleles), there is a 1 in 4 chance that an offspring will inherit two recessive alleles and express the recessive phenotype. \n\nHeterozygous: An individual carrying both a dominant and a recessive allele for a trait. \n\nRecessive trait: A trait that is only expressed when an individual inherits two copies of the recessive allele. ",
    "passage": "",
    "question_text": "If both parents are heterozygous for a trait. the probability that an offspring will be recessive for that trait is?",
    "option_1_text": "1/2",
    "option_1_image": "",
    "option_2_text": "1/4",
    "option_2_image": "",
    "option_3_text": "1",
    "option_3_image": "",
    "option_4_text": "4572000.00%",
    "option_4_image": "",
    "answer": 2,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "It is called a double circulatory system because blood passes through the heart twice per circuit. ",
    "passage": "",
    "question_text": "Blood circulation in a mammal is said to be double because?",
    "option_1_text": "it passes twice through the heart in a complete circuit",
    "option_1_image": "",
    "option_2_text": "it moves in both arteries and veins",
    "option_2_image": "",
    "option_3_text": "it circulates in both the heart and other organs",
    "option_3_image": "",
    "option_4_text": "the heart contains auricles and ventricles",
    "option_4_image": "",
    "answer": 1,
    "year": 2021
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Insulin helps control blood glucose levels by signaling the liver and muscle and fat cells to take in glucose from the blood",
    "passage": "",
    "question_text": "The hormone which regulates the amount of glucose in the blood is called?",
    "option_1_text": "Adrenalin",
    "option_1_image": "",
    "option_2_text": "Auxin",
    "option_2_image": "",
    "option_3_text": "Insulin",
    "option_3_image": "",
    "option_4_text": "Thyroxine",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Deamination is used to break down amino acids for energy, and occurs primarily in the liver.",
    "passage": "",
    "question_text": "Deamination occurs in the?",
    "option_1_text": "Kidney",
    "option_1_image": "",
    "option_2_text": "Pancreas",
    "option_2_image": "",
    "option_3_text": "Spleen",
    "option_3_image": "",
    "option_4_text": "Liver",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The living components of an ecosystem are called the biotic components, option A has all living components.",
    "passage": "",
    "question_text": "In an agricultural ecosystem, the biotic component consist of",
    "option_1_text": "crops, pests and beneficial insects",
    "option_1_image": "",
    "option_2_text": "crops, temperature and humidity",
    "option_2_image": "",
    "option_3_text": "pests, beneficial insects and water",
    "option_3_image": "",
    "option_4_text": "crops, water and soil",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Commensalism is a type of symbiosis, specifically, a biological relationship in which one specie benefits from an interaction, while the host species is neither positively or negatively affected to any tangible degree.",
    "passage": "",
    "question_text": "Epiphytes growing on the branches of trees provide an example of the relationship known as?",
    "option_1_text": "parasitism",
    "option_1_image": "",
    "option_2_text": "commensalism",
    "option_2_image": "",
    "option_3_text": "saprophytism",
    "option_3_image": "",
    "option_4_text": "holophytism",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Hyphae that have walls between the cells are called septate hyphae; hyphae that lack walls and cell membranes between the cells are called nonseptate or coenocytic hyphae)",
    "passage": "",
    "question_text": "The hypha of rhizopus is said to be non-septate because it",
    "option_1_text": "does not contain chloropyll",
    "option_1_image": "",
    "option_2_text": "has no cross wall",
    "option_2_image": "",
    "option_3_text": "is vacuoled",
    "option_3_image": "",
    "option_4_text": "stores oil globus",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A ribosome is a cell organelle. It functions as a micro-machine for making proteins.",
    "passage": "",
    "question_text": "The function of ribosome in cells is",
    "option_1_text": "protein synthesis",
    "option_1_image": "",
    "option_2_text": "starch synthesis",
    "option_2_image": "",
    "option_3_text": "transport of material",
    "option_3_image": "",
    "option_4_text": "lipid storage",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "External fertilization is a mode of reproduction in which a male organism's sperm fertilizes a female organism's egg outside of the female's body. Many fish, amphibians, and other sexual aquatic animals use external fertilization (the exceptions are aquatic mammals, sharks, and some other special types of fish).",
    "passage": "",
    "question_text": "In which of the following does external fertilization take place?",
    "option_1_text": "toad",
    "option_1_image": "",
    "option_2_text": "lizard",
    "option_2_image": "",
    "option_3_text": "bird",
    "option_3_image": "",
    "option_4_text": "cockroach",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Villis are specialized for absorption in the small intestine as they have a thin wall, one cell thick, which enables a shorter diffusion path.",
    "passage": "",
    "question_text": "The villus in the small intestine is significant because",
    "option_1_text": "Increases the surface area for absorption",
    "option_1_image": "",
    "option_2_text": "increases the surface area for digestion",
    "option_2_image": "",
    "option_3_text": "assists in mixing digested food",
    "option_3_image": "",
    "option_4_text": "assists in filtering undigested food",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Butterflies are important pollinators to most agricultural crops.",
    "passage": "",
    "question_text": "The butterfly is of great economic importance because",
    "option_1_text": "of it's use in scientific studies",
    "option_1_image": "",
    "option_2_text": "it sucks nectar from flowers",
    "option_2_image": "",
    "option_3_text": "it adds to the beauty of the environment",
    "option_3_image": "",
    "option_4_text": "it pollinates flowers of crops and other plants",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The males display their beautiful fanned trains as part of their courtship behaviour to the Peahens.",
    "passage": "",
    "question_text": "The bright colours of the comb and feathers in the peacock are for?",
    "option_1_text": "sex differentiation",
    "option_1_image": "",
    "option_2_text": "beauty",
    "option_2_image": "",
    "option_3_text": "courtship",
    "option_3_image": "",
    "option_4_text": "defence",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "An ecosystem consists of all the biotic and abiotic factors that influence that community.",
    "passage": "",
    "question_text": "What is the term used to describe biotic and abiotic factors in the environment of the organism?",
    "option_1_text": "habitat",
    "option_1_image": "",
    "option_2_text": "biome",
    "option_2_image": "",
    "option_3_text": "ecosystem",
    "option_3_image": "",
    "option_4_text": "ecological niche",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Common abiotic factors are atmosphere, chemical elements, sunlight/temperature, wind and water, all other options are instrument used to measure these apart from microscope which can be used to observe small objects, even cells.",
    "passage": "",
    "question_text": "Which of the following instruments is NOT used in measuring abiotic factors in any habitat?",
    "option_1_text": "microscope",
    "option_1_image": "",
    "option_2_text": "thermometer",
    "option_2_image": "",
    "option_3_text": "hygrometer",
    "option_3_image": "",
    "option_4_text": "windvane",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The smallest living organism which share the characteristics of both living and non-living matter are",
    "option_1_text": "bacteria",
    "option_1_image": "",
    "option_2_text": "fungi",
    "option_2_image": "",
    "option_3_text": "viruses",
    "option_3_image": "",
    "option_4_text": "protozoa",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Your body normally destroys old or faulty red blood cells in the spleen or other parts of your body through a process called hemolysis",
    "passage": "",
    "question_text": "The process by which a red blood cell placed in distilled water absorbs water until it burst and realease it's content into the surrounding is known as",
    "option_1_text": "osmosis",
    "option_1_image": "",
    "option_2_text": "plasmolysis",
    "option_2_image": "",
    "option_3_text": "turgidity",
    "option_3_image": "",
    "option_4_text": "hemolysis",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The waste products of a plant are carbon dioxide, water vapour and oxygen.\n\nPlants produce several waste products, including:\n\nOrganic by-products:These include gums, oils, latex, and resins, which plants store in their barks, stems, and leaves\n\nCarbon dioxide: A waste product of respiration, which plants exhale through stomata in their leaves \n\nWater vapour: A waste product of respiration, which plants exhale through stomata in their leaves and the surfaces of their fruits and stems \n\nOxygen:A waste product of photosynthesis, which plants exhale through stomata in their leaves ",
    "passage": "",
    "question_text": "Which of the following waste products in plants is excreted through the stomata and lenticles?",
    "option_1_text": "carbon dioxide",
    "option_1_image": "",
    "option_2_text": "alkaloids",
    "option_2_image": "",
    "option_3_text": "tannins",
    "option_3_image": "",
    "option_4_text": "anthoocyanins",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q318.jpeg",
    "explanation_image": "",
    "explanation_text": "There are five different vertebrae namely; cervical, Thoracic, Lumbar, sacral, and caudal.\n\n Thoracic vertebra; it is found in the chest region.",
    "passage": "",
    "question_text": "Use the diagram to answer the question\n\nThe vertebra illustrated is",
    "option_1_text": "lumber",
    "option_1_image": "",
    "option_2_text": "thoracic",
    "option_2_image": "",
    "option_3_text": "caudal",
    "option_3_image": "",
    "option_4_text": "cervical",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q319.jpeg",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Use the diagram to answer the question\n\nThe neural arch is labelled",
    "option_1_text": "i",
    "option_1_image": "",
    "option_2_text": "ii",
    "option_2_image": "",
    "option_3_text": "iii",
    "option_3_image": "",
    "option_4_text": "iv",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Nephridia remove metabolic wastes from an animal's body. Nephridia come in two basic categories: metanephridia and protonephridia.",
    "passage": "",
    "question_text": "The excretory structure in the earthworm is the",
    "option_1_text": "malphighian tubule",
    "option_1_image": "",
    "option_2_text": "flame cell",
    "option_2_image": "",
    "option_3_text": "nephridium",
    "option_3_image": "",
    "option_4_text": "kidney",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Amphibians utilize gills for breathing early in life, and develop primitive lungs in their adult life; additionally, they are able to breathe through their skin.",
    "passage": "",
    "question_text": "In which of the following vertebrates does the skin function as a respiratory surface",
    "option_1_text": "rat",
    "option_1_image": "",
    "option_2_text": "lizard",
    "option_2_image": "",
    "option_3_text": "fish",
    "option_3_image": "",
    "option_4_text": "frog",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Coordination of voluntary movements. Most movements are composed of a number of different muscle groups acting together in a temporally coordinated fashion. One major function of the cerebellum is to coordinate the timing and force of these different muscle groups to produce fluid limb or body movements.",
    "passage": "",
    "question_text": "The process of walking is under the control of the part of the brain called",
    "option_1_text": "optic lobe",
    "option_1_image": "",
    "option_2_text": "olfactory lobe",
    "option_2_image": "",
    "option_3_text": "cerebellum",
    "option_3_image": "",
    "option_4_text": "medulla oblongata",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "The ability of the eye to focus distant as well as nearby objects clearly on the retina of the eye is called accommodation. When our eyes see distant objects then the ciliary muscles relax and the focal length is maximum in this position.",
    "passage": "",
    "question_text": "The ability of the eyes to focus on both near and distance objects is termed",
    "option_1_text": "image formation",
    "option_1_image": "",
    "option_2_text": "refraction",
    "option_2_image": "",
    "option_3_text": "hypermetropia",
    "option_3_image": "",
    "option_4_text": "accommodation",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "A community is formed by populations of different species living together and interacting with each other. A community forms an ecosystem by its interaction with the abiotic environment.",
    "passage": "",
    "question_text": "A group of organism of different species living in a particular area is described as a",
    "option_1_text": "colony",
    "option_1_image": "",
    "option_2_text": "community",
    "option_2_image": "",
    "option_3_text": "population",
    "option_3_image": "",
    "option_4_text": "niche",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "competition between species in a particular habitat is a biotic factor of ecological primary succession.",
    "passage": "",
    "question_text": "The biological association that contributes directly to succession in a community is",
    "option_1_text": "competition",
    "option_1_image": "",
    "option_2_text": "predation",
    "option_2_image": "",
    "option_3_text": "parasitism",
    "option_3_image": "",
    "option_4_text": "commensalism",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Phytoplankton are microscopic marine organisms that sit at the bottom of the food chain, most phytoplankton are buoyant and float in the upper part of the ocean. However, they are not heterotrophic like the zooplanktons.\n\nmicrobes are living organisms around us that we can't see with our naked eyes.\n\nnektons are organisms that are able to swim and move independently of current.",
    "passage": "",
    "question_text": "Floating microscopic heterotrophs are mostly grouped as",
    "option_1_text": "phytoplankton",
    "option_1_image": "",
    "option_2_text": "zooplankton",
    "option_2_image": "",
    "option_3_text": "microbes",
    "option_3_image": "",
    "option_4_text": "nekton",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Vaccination is carried out in order to",
    "option_1_text": "check the production of poison",
    "option_1_image": "",
    "option_2_text": "increase the activities of white blood cells",
    "option_2_image": "",
    "option_3_text": "increase the number of red blood cells",
    "option_3_image": "",
    "option_4_text": "stimulate the production of anti-bodies",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Anabolism centers around growth and building the organization of molecules. In this process, small, simple molecules are built up into larger, more complex ones while Catabolism is what happens when you digest food and the molecules break down in the body for use as energy.",
    "passage": "",
    "question_text": "For growth to occur in organisms, the rate of",
    "option_1_text": "anabolism must exceed that of catabolism",
    "option_1_image": "",
    "option_2_text": "catabolism must exceed that of anabolism",
    "option_2_image": "",
    "option_3_text": "food storage must be low",
    "option_3_image": "",
    "option_4_text": "food storage must be high",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The probability of a baby being a boy or a girl depends on the contribution of the",
    "option_1_text": "father's sex cells",
    "option_1_image": "",
    "option_2_text": "father's stomatic chromosome",
    "option_2_image": "",
    "option_3_text": "mother's sex cell",
    "option_3_image": "",
    "option_4_text": "mother's X-chromosome",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Both recesssive and dominant characters are found",
    "option_1_text": "on different chromosome in the cell",
    "option_1_image": "",
    "option_2_text": "at the same logus of a homologous chromosome",
    "option_2_image": "",
    "option_3_text": "at a different loci of a homologous chromosome",
    "option_3_image": "",
    "option_4_text": "on the same chromatid in a chromosome",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "In a population of living things, the parameters of size, height, weight and colours are examples of",
    "option_1_text": "continuous variation",
    "option_1_image": "",
    "option_2_text": "non-heritable variation",
    "option_2_image": "",
    "option_3_text": "discontinuous variation",
    "option_3_image": "",
    "option_4_text": "physiological variation",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q332.jpeg",
    "explanation_image": "",
    "explanation_text": "Water loss in frogs and toads through the skin primarily occurs through evaporation. Since amphibians like frogs and toads need to keep their skin moist for breathing, they lose water rapidly through the skin surface due to evaporation, particularly when they are in dry environments. \n\nFrogs and toads primarily absorb water through their skin via a process called osmosis; water moves from the surrounding environment (typically with a lower solute concentration) into their bodies through the permeable skin, driven by the concentration gradient between the water and their bodily fluids. \n\nIn summary, water loss is by evaporation while water intake is via osmosis. Option A is the correct answer.",
    "passage": "",
    "question_text": "Use the diagram to answer the question.\n\nThe process of water loss and intake indicated by the arrows labelled i and ii are respectively",
    "option_1_text": "evaporation and osmosis",
    "option_1_image": "",
    "option_2_text": "osmosis and exhalation",
    "option_2_image": "",
    "option_3_text": "osmosis and diffusion",
    "option_3_image": "",
    "option_4_text": "urination and diffusion",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The noticeable adaptation of the animal to it's aquatic habitat is the possession of",
    "option_1_text": "webbed digits",
    "option_1_image": "",
    "option_2_text": "four limb",
    "option_2_image": "",
    "option_3_text": "wide mouth",
    "option_3_image": "",
    "option_4_text": "large eyes",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Paternity disputes can most accurately be resolved through the use of",
    "option_1_text": "blood group typing",
    "option_1_image": "",
    "option_2_text": "finger printing",
    "option_2_image": "",
    "option_3_text": "tongue rolling",
    "option_3_image": "",
    "option_4_text": "DNA Analysis",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q335.jpeg",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Use the table below to answer the question.\n\nHigh relative humidity will be expected in Zones",
    "option_1_text": "ii and iv",
    "option_1_image": "",
    "option_2_text": "ii and iii",
    "option_2_image": "",
    "option_3_text": "i and iii",
    "option_3_image": "",
    "option_4_text": "i and iv",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q336.jpeg",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Use the table to answer the question.\n\nWhich of the zones is likely to be a desert?",
    "option_1_text": "i",
    "option_1_image": "",
    "option_2_text": "ii",
    "option_2_image": "",
    "option_3_text": "iii",
    "option_3_image": "",
    "option_4_text": "iv",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "When bacteria swim from cold to warm regions, this is known as",
    "option_1_text": "positive phototaxis",
    "option_1_image": "",
    "option_2_text": "negative phototaxis",
    "option_2_image": "",
    "option_3_text": "positive thermotaxis",
    "option_3_image": "",
    "option_4_text": "negative chemotaxis",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "The only caste in the termite colony whose members can feed themselves are the",
    "option_1_text": "workers",
    "option_1_image": "",
    "option_2_text": "reproductives",
    "option_2_image": "",
    "option_3_text": "soldiers",
    "option_3_image": "",
    "option_4_text": "nymphs",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following is the best explanation for a child who is phenotypically short and born of two tall parents",
    "option_1_text": "both parent possess genes for shortness",
    "option_1_image": "",
    "option_2_text": "the father possess a gene for shortness",
    "option_2_image": "",
    "option_3_text": "nature makes the child short",
    "option_3_image": "",
    "option_4_text": "",
    "option_4_image": "",
    "answer": 1,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Which of the following vertebrates has the most simple structured heart",
    "option_1_text": "reptile",
    "option_1_image": "",
    "option_2_text": "fish",
    "option_2_image": "",
    "option_3_text": "mammal",
    "option_3_image": "",
    "option_4_text": "Amphibian",
    "option_4_image": "",
    "answer": 2,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q341.jpeg",
    "explanation_image": "",
    "explanation_text": "",
    "passage": "",
    "question_text": "Use the diagram to answer the question.\n\nThe type of protective adaption exhibited by the animal is",
    "option_1_text": "disruptive colouration",
    "option_1_image": "",
    "option_2_text": "flash colouration",
    "option_2_image": "",
    "option_3_text": "countershading colouration",
    "option_3_image": "",
    "option_4_text": "warning colouration",
    "option_4_image": "",
    "answer": 3,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "q342.jpeg",
    "explanation_image": "",
    "explanation_text": "The part labeled I is commonly called tactile hairs, sinus hairs, whiskers, or vibrissae. ( are the long, specialized hairs found on the face and nose of rodents like rats, etc, and other animals like pussy cats)",
    "passage": "",
    "question_text": "Use the diagram to answer the question.\n\nThe structure labelled i is",
    "option_1_text": "photosensitive",
    "option_1_image": "",
    "option_2_text": "radiosensitive",
    "option_2_image": "",
    "option_3_text": "chemoreceptive",
    "option_3_image": "",
    "option_4_text": "tactile",
    "option_4_image": "",
    "answer": 4,
    "year": 2020
  },
  {
    "subject": "Biology",
    "question_image": "",
    "explanation_image": "",
    "explanation_text": "Amphibians, reptiles, mammals, and birds evolved after fish. The first amphibians evolved from a lobe-finned fish ancestor . They were the first vertebrates to live on land, but they had to return to water to reproduce.",
    "passage": "",
    "question_text": "The first organism evolved from which of the following habitat?",
    "option_1_text": "terrestrial",
    "option_1_image": "",
    "option_2_text": "arboreal",
    "option_2_image": "",
    "option_3_text": "aquatic",
    "option_3_image": "",
    "option_4_text": "desert",
    "option_4_image": "",
    "answer": 3,
    "year": 2024
  }
]